[
  {
    "Audio": "SL19091",
    "Title": "Smith-Pettit Lecture: God: A Human History",
    "Presenters": "Reza Aslan, Lindsay Hansen Park",
    "Description": "Introduction of Sunstone conference and Smith-Pettit Presentation: Lindsay Hansen Park\n\nIn God, Reza Aslan sheds new light on mankind’s relationship with the divine and challenges our perspective on the history of faith and the birth of religion.\n\nFrom the origins of spiritual thought to the concept of an active, engaged, divine presence that underlies all creation, Aslan examines how the idea of god arose in human evolution, was gradually personalized, endowed with human traits and emotions, and eventually transformed into a single Divine Personality: the God known today by such names as Yahweh, Father, and Allah.",
    "URL": "https://sunstonemagazine.com/audio/SL19091.mp3"
  },
  {
    "Audio": "SL19111",
    "Title": "The Future of Faith",
    "Presenters": "Taylor Petrey, Lindsay Hansen Park",
    "Description": "In order to understand the future of faith, we need to also understand its past and the present. A currently beleaguered faith is part of a broad paradigm shift in how we understand the nature of reality in the modern era. These challenges are not easily dismissed. At the same time, many, including Latter-day Saints, have undertaken the hard work of reconciling faith and modernity. But what about faith and post-modernity? How might faith contribute to the critique of modernity’s shortcomings, not through nostalgia for something lost, but as a paradigm for where to train our attention?",
    "URL": "https://sunstonemagazine.com/audio/SL19111.mp3"
  },
  {
    "Audio": "SL1921",
    "Title": "“Your Religion Is Showing:” Negotiation and Personal Experience in LDS Garments",
    "Presenters": "Nancy Ross, Natalie Shepherd Barkdull",
    "Description": "This session examines 4,500 survey responses from members of LDS Church answering questions on the practice of wearing garments, or sacred underwear. Men and women report different experiences with their garments. This study looks at responses from both those who are still wearing their garments and from those who have stopped wearing their garments.",
    "URL": "https://sunstonemagazine.com/audio/SL19121.mp3"
  },
  {
    "Audio": "SL19122",
    "Title": "Future Ways to Explore a Past Faith: A Post Mormon Nature Philosophy",
    "Presenters": "Tom Bennett, Josh Allred",
    "Description": "“I am constantly in awe of the great mystery which surrounds us,” is the defining statement of the Holy Order of Wildlife, or H.O.W.L.: an amalgamation of early Mormonism, Buddhism, Luciferianism, and Gnostic Christianity amongst other paths. We seek a sacred grove of our own as we turn to nature is the primary source of connection to the divine. While we beleive strongly in spiritual experiences and the seeking of such experiences we also beleive in science and the laws of nature.",
    "URL": "https://sunstonemagazine.com/audio/SL19122.mp3"
  },
  {
    "Audio": "SL19123",
    "Title": "From \"Shhh, Be Still\" to Speaking Up—Remaking the Church Experience",
    "Presenters": "Susan M. Hinckley, Jen Perlmutter Tanner",
    "Description": "After decades of feeling alone, I’d almost given up seeking a place for myself at church. When I accepted the calling to teach in a new ward, I wasn’t sure what I believed but I felt inspired to try building the space I needed into my lessons. I knew what I had found lacking, and what I longed for. After five years of consistently saying the things I need to hear at church, there’s been a transformation in our Relief Society. It seems the more I’m willing to speak my truth, the more I create space for others to do the same.",
    "URL": "https://sunstonemagazine.com/audio/SL19123.mp3"
  },
  {
    "Audio": "SL19124",
    "Title": "Mormon Theology and the Game of Thrones: Discerning the Difference between King-men and the Kingdom of God",
    "Presenters": "Mark Crego, Tom Kimball",
    "Description": "Both the Book of Mormon and the Game of Thrones present personal struggle against the backdrop of violent war narratives, differing only in level of explicit graphic detail. Both use the symbol of the steel sword as that which enforced good. Both are tragedies. The true heroes in both are those who are internally transformed away from the banality of the sword into personal nonviolence. In the vignettes of these heroes, whether Alma or the Hound, Ammon or Arya, Samuel, or the Red Woman, the futility of violence gives way to the personal transformation of the Kingdom of God within.",
    "URL": "https://sunstonemagazine.com/audio/SL19124.mp3"
  },
  {
    "Audio": "SL19125",
    "Title": "The Book of Mormon Yesterday, Today and Tomorrow:  How Digital Analysis, Hermetics, and Chaos Theory Change What We See",
    "Presenters": "Brian W. Kassenbrock, Steve Florman",
    "Description": "The Book of Mormon has a long history, but how it was seen by its original readers is quite different from how it is seen today. This presentation explores the path from the early 19th century to today and how Mormonism's founding text may be seen in the future.",
    "URL": "https://sunstonemagazine.com/audio/SL19125.mp3"
  },
  {
    "Audio": "SL19126",
    "Title": "Isrealite Origins and Mormonism",
    "Presenters": "Ryan Wimmer, Johnny Stephenson",
    "Description": "Aware of the growing number of LDS members exiting the Church the LDS hierarchy have responded to some of the cause with the Gospel Topic Essays; many of which focus on Mormon origins, but the problems with the traditional narrative is much larger. The biblical record of Isrealite origins is based primarily on myth presenting problems for literal beliefs of all religions that have grown out of the ancient Israelite traditions. Mormon theology centers on many of these origin myths such as the gathering of Israel. What does this all mean to the future of Mormonism and related traditions?",
    "URL": "https://sunstonemagazine.com/audio/SL19126.mp3"
  },
  {
    "Audio": "SL19127",
    "Title": "Mormon Poetry and the Prophetic Imagination: Opening (the) Faith Toward Possibility",
    "Presenters": "Tyler Chadwick, Dayna Patterson, Elizabeth Pinborough, Terresa Wellborn, Kathryn Knight Sonntag, Stephen Carter",
    "Description": "The prophetic imagination as a mode of consciousness disrupts mainstream cultural trends and seeks to expand individual and communal faith using language ripe with poetic rhythms and imagery. Whereas dogma intends to pin down and flatten out ideas and to narrow the conceptual frames through which people view the world, poetry relies on metaphor, nuance, ambiguity, and emotion to open audiences toward the abundance and possibilities of human knowledge, experience, relationships, organizations, and culture. In this session, five poets/editors consider the work of poetry and the prophetic imagination in the ongoing development of our Mormon faith community.",
    "URL": "https://sunstonemagazine.com/audio/SL19127.mp3"
  },
  {
    "Audio": "SL19131",
    "Title": "When God Isn’t A White CisHet Dude",
    "Presenters": "Mette Harrison, Natalie Sperry Mandelin",
    "Description": "Many post-Mormons reject God altogether after rejecting the Mormon temple god with a beard, but what other versions of God might work for the rest of us?",
    "URL": "https://sunstonemagazine.com/audio/SL19131.mp3"
  },
  {
    "Audio": "SL19132",
    "Title": "The Epistemology of Two Different Questions: What Do I Think Will Make Me Happy vs. What Is True?",
    "Presenters": "Kathleen Kimball Melonakos, Tom Kimball",
    "Description": "Many formerly faithful Mormons leave the church because it no longer makes them happy, or they discover it is not true, or both. They often face a spiritual crisis affecting their jobs, their relationships, their ethics, and their mental health. Sometimes they become confused and lose faith in their own ability to sort out what is good, true or real. This paper will explore ways of knowing what is good and true about the world including emotions, logic, reasoning and the evaluation of evidence. We will discuss the scientific method as a means of guiding one’s decisions and its limits.",
    "URL": "https://sunstonemagazine.com/audio/SL19132.mp3"
  },
  {
    "Audio": "SL19133",
    "Title": "The Malnourished Children of Madagascar",
    "Presenters": "Bob Rees, Gloria Rees, Stephen Carter",
    "Description": "The Bountiful Children’s Foundation is an NGO that addresses malnutrition among Latter-day Saint and other children in the developing world. The foundation is currently serving the needs of malnourished children in over 200 congregations in 20 countries. Recently the Foundation expanded its operation to Madagascar, one of the poorest (and yet most beautiful) countries in the world. This session reports on the work of the foundation in Madagascar and the challenges of addressing children’s malnutrition in an increasingly global church.",
    "URL": "https://sunstonemagazine.com/audio/SL19133.mp3"
  },
  {
    "Audio": "SL19134",
    "Title": "Bringing Book of Mormon Artifacts to Augmented Reality",
    "Presenters": "Steve Otteson, Mark Petersen",
    "Description": "Through the power of augmented reality, Book of Mormon artifacts come to life! Learn how the gold plates, the Urim and Thummim (breastplate and spectacles) and other artifacts were modeled in 3D using historical research and eyewitness accounts. See how these and other artifacts can be viewed on your mobile device as if they existed in the real world.",
    "URL": "https://sunstonemagazine.com/audio/SL19134.mp3"
  },
  {
    "Audio": "SL19135",
    "Title": "Missionaries to the Mormons:  NOW’s ERA Missionary Project",
    "Presenters": "Bill Connors, Laurie Vertner",
    "Description": "In the summer of 1981, the National Organization for Women sent feminist “missionaries” to Utah to advocate for the Equal Rights Amendment.  This presentation tells this never-before-published story based on NOW’s institutional records from the Harvard Schlesinger Library. NOW was upset at the LDS Church’s participation against the ERA and recruited and trained women and men to go door to door in the major cities of Utah on a program modeled after the LDS missionary program.  Their purpose: to demonstrate and increase Utah support for the ERA and to reveal the LDS Church’s opposition in the national press.",
    "URL": "https://sunstonemagazine.com/audio/SL19135.mp3"
  },
  {
    "Audio": "SL19136",
    "Title": "What Color Is Your Faith Crisis?",
    "Presenters": "Russell Osmond, Natalie Shepherd Barkdull",
    "Description": "Two hundred years after Eric Hoffer’s True Believers found permanent and repetitive “purchase” along the fertile banks of what became the Erie Canal (before, during, & after its construction), the fires of faith (and subsequent “conversion”) simply would not stop re-kindling. Multiple movements that are still pulsing energetically today sprung up there. This presentation explores four contrasting views of why and draws relevant links to today’s polarized US Milieu/Melee.",
    "URL": "https://sunstonemagazine.com/audio/SL19136.mp3"
  },
  {
    "Audio": "SL19137",
    "Title": "Grace, Works, Devotion...and Video Games?",
    "Presenters": "George Andrew Spriggs, Rebecca Smyrniotopoulos",
    "Description": "Each year, the population of “nones,” disenfranchised from conventional religion, increases. But the decline in traditional religions does not result in a lack of appreciation for religious concepts like works, devotion, and self-improvement. The rise of video gaming represents a new interactive model for myth-making, the practice of works, and devotion. By looking at age-old religious tensions (such as the fraught relationship between works and grace) through the seemingly secular lens of games like Celeste, Cuphead, and Sekiro, we can gain new insights about these eternal questions.",
    "URL": "https://sunstonemagazine.com/audio/SL19137.mp3"
  },
  {
    "Audio": "SL19142",
    "Title": "Utah Politics: The Elephant in the Room",
    "Presenters": "Rod Decker, Devery Anderson",
    "Description": "Utah became a Republican state because Latter-day Saints disagreed with changes brought by the sexual revolution. Abortion, pornography, gay marriage, as well as the decline of traditional families and the rise of out-of-marriage births led them to Republicanism; Utah non-Mormons, facing a seemingly permanent religious-political majority, became Democrats. LDS adherence to the old morality also affected Utah demography, making the state the youngest and most married. Decker’s new book, Utah Politics, changes the story of Utah history and shows how the state assimilated until the mid-1970s, when political and demographical changes reoccurred. Decker offers a new look at Utah history, politics, and government, one that highlights the importance of Latter-day Saint moral and family differences.",
    "URL": "https://sunstonemagazine.com/audio/SL19142.mp3"
  },
  {
    "Audio": "SL19144",
    "Title": "Film Screening: Straws",
    "Presenters": "Søren Simonsen, Blair M. White",
    "Description": "A colorful straw history animation narrated by Oscar winner Tim Robbins, Straws leaves audiences with a clear understanding of the problems caused by plastic pollution and empowers individuals to be part of the solution. The film last 30 minutes.",
    "URL": "https://sunstonemagazine.com/audio/SL19144.mp3"
  },
  {
    "Audio": "SL19151",
    "Title": "Mayor of Hildale: Short Creek's First Female Leader",
    "Presenters": "Donia Jessop, Nadine McCombs Hansen",
    "Description": "Donia Jessop, the first woman mayor of Hildale and a driving force behind the Utah town's ongoing transition away from its notorious past will speak about her experiences in the last several years, how her work has impacted herself and her community.",
    "URL": "https://sunstonemagazine.com/audio/SL19151.mp3"
  },
  {
    "Audio": "SL19152",
    "Title": "Movement Toward A Spectrum of Belief",
    "Presenters": "Kristin Perkins, Chris Peck, Kyle Bond, Jen Perlmutter Tanner",
    "Description": "These essays will show how the future of Mormonism exists through the creation of what we term a “spectrum of belief,” arguing for more inclusivity within Mormonism. Perkins’s essay argues for inclusivity for LGBTQ+ communities without direct authority from LDS leadership. Peck’s essay incorporates existentialism as a way to bring about a spectrum of belief through subjectivity and an emphasis on meaningful choice. Finally, Bond discusses first the portrait of a “none,” and argues for greater inclusivity for spiritual diaspora within a Mormon context.",
    "URL": "https://sunstonemagazine.com/audio/SL19152.mp3"
  },
  {
    "Audio": "SL19153",
    "Title": "Church for the Unchurched Revisited",
    "Presenters": "John Hamer, Roy Schmidt",
    "Description": "For the past three years, John Hamer has built up a new community at Toronto Centre Place committed to a five-point mission: (1) invite everyone into community, (2) continually learn and grow, (3) abolish poverty and end needless suffering, (4) pursue peace and justice, and (5) live life meaningfully together. Regular participants at Centre Place include a vast diversity of backgrounds and beliefs from Mormon to Protestant, Ethiopian Orthodox to Quaker, from Isma’ili to Sunni Muslim, as well as Jews, Buddhists, Hindus, agnostics, humanists, and atheists. Hamer will outline the formula for the Toronto Centre Place and Creating Connection communities.",
    "URL": "https://sunstonemagazine.com/audio/SL19153.mp3"
  },
  {
    "Audio": "SL19154",
    "Title": "A Reading of the Winning Essays from the 2018 Eugene England Memorial Personal Essay Contest",
    "Presenters": "Susan M. Hinckley, Dayna Patterson, Tyler Chadwick",
    "Description": "The winners of the 2018 Eugene England Memorial Personal Essay Contest will come together to read their essays:\n\n1st Place: “The Process of Staying,” by Susan M. Hinckley. For many people, it looks like Hinckley, with her independent ways, is in the process of leaving the LDS Church. But she argues that she’s actually in the process of staying.\n\n2nd Place: “Fledglings,” by Dayna Patterson. Raising daughters in the LDS Church, and in America, is a difficult undertaking. Among the tools one needs to succeed are seagulls, Star Trek, and King Lear.\n\nHonorable Mention: “The Gods Step Out of Their Hiding Place: Meditations on Divine Presence,” by Tyler Chadwick. A flock of doves, Walt Whitman, and Emma Lou Thayne come together in this meditation on how words guide the soul and the community it is part of.",
    "URL": "https://sunstonemagazine.com/audio/SL19154.mp3"
  },
  {
    "Audio": "SL19155",
    "Title": "Across the Aisle: Communicating Through Differences in Faith and Belief",
    "Presenters": "Nicholas R Stewart, Anthony Miller, Matt Harward, Ian Harris, LaNeece Flamm",
    "Description": "This session is a discussion group centered on the theme of how to engage with people whose faith/belief is different than your own. Both active, believing Mormons and post/ex/etc-Mormons will be represented. This session will be a discussion with ample participation from the attendees, with the panelists mostly there to help guide the conversation and share their own insights.",
    "URL": "https://sunstonemagazine.com/audio/SL19155.mp3"
  },
  {
    "Audio": "SL19156",
    "Title": "John Pierce Hawley and the Temple at Zodiac Texas 1849-1851",
    "Presenters": "Melvin C. Johnson, Andrew Hamilton",
    "Description": "This presentation will give an overview of temple development—from Kirtland to Nauvoo to Zodiac and to the Endowment House.  The center of the presentation will be a contextualization of Hawley's insight into the changing of the Endowment and other ordinances through those years.",
    "URL": "https://sunstonemagazine.com/audio/SL19156.mp3"
  },
  {
    "Audio": "SL19157",
    "Title": "The Religious Case for Environmental Stewardship",
    "Presenters": "Rachael Lauritzen, Madison Daniels, Søren Simonsen, Madison Daniels",
    "Description": "Joseph Smith’s first visionary experience with the Divine was occasioned by pondering the swirling stars, radiant sun, and powerful Earth. Early Mormonism was tied directly to the land, be it the banks of the Susquehanna, Nauvoo, or the Salt Lake Valley. Sacred Land is an idea rooted deeply within the Mormon psyche. But that connection seems to be waning in modern Mormonism. This panel will discuss and explore the idea of Sacred Land within Mormonism— including rumination on how Mormonism has lost this land-ethic and why Mormonism needs to reclaim that land-ethic to confront both, our individual role in anthropogenic climate change, and to create a faith worthy of a more sustainable future",
    "URL": "https://sunstonemagazine.com/audio/SL19157.mp3"
  },
  {
    "Audio": "SL19161",
    "Title": "The Primary Colors and My Duct-taped Shelf",
    "Presenters": "Carole Thayne Warburton, Stephen Carter",
    "Description": "Using my favorite Primary songs as a framework for growth, I’ve learned to live without fear, trust my gut, be an advocate for social justice, heal from crippling depression, and recognize that there are many spiritual paths and that Mormonism is just one possible path to the top of the mountain. Using Primary lyrics, I will share stories of courage from friends I have known, especially among the LGBTQ community. My own prompting to do “what is right, let the consequence follow” led me to become a proactive ally for the LGBTQ community, and start an Affirmation-type group in Cache Valley. “Nature is my church, Love is my religion.”",
    "URL": "https://sunstonemagazine.com/audio/SL19161.mp3"
  },
  {
    "Audio": "SL19162",
    "Title": "The Only True and Living Church - A Case of Mood Confusion",
    "Presenters": "McKay Lyman Platt, Jennifer Koski",
    "Description": "A subjunctive statement in the Lord’s voice about the “only true and living church” (D&C 1:30) has been widely misunderstood as a statement of fact. Statements made as hopes or possibilities can be misunderstood as declarations. Mood confusion occurs when a statement made in one mood is understood to have been made in another mood and causes us to misunderstand God’s meaning and to misquote God. A basic understanding of the subjunctive mood can prevent us from mistaking an invitation from God for a divine endorsement of our present state before him.",
    "URL": "https://sunstonemagazine.com/audio/SL19162.mp3"
  },
  {
    "Audio": "SL19163",
    "Title": "Smith, Smith, Smithereens",
    "Presenters": "Shawn McCraney, Natalie Shepherd Barkdull",
    "Description": "The powerful Restorationist movement of the 19th century, couched in a fervent eschatological view of an eminent Second Coming of Christ, helped establish the notion in thousands of earnest hearts and minds that doctrinal and practical reform was needed as a means to help usher in Jesus’ return. Most churches focused on any level of restoration readily accepted the standard Catholic/Protestant view of end times without much resistance or alternative view. After nearly 2000 years American Evangelicalism (along with Roman Catholicism, Orthodoxy and Mormonism) continues to perpetuate the idea that Jesus’ return is eminent despite a preponderance of evidence to the contrary.",
    "URL": "https://sunstonemagazine.com/audio/SL19163.mp3"
  },
  {
    "Audio": "SL19164",
    "Title": "Faith Crisis as Disorienting Dilemma: Road to Transformation",
    "Presenters": "Paul Sparks, Rebecca Smyrniotopoulos",
    "Description": "As greater numbers of believers suffer a faith crisis, better tools are needed to help with understanding and recovery. Mezirow’s Ten Phases of Transformative Learning—an adult learning theory—can assist in alleviating pain by guiding reflection and an exploration of new possibilities. Indeed, with a healthy process of acquiring new knowledge, identity, and relationships, transformation can be transcendent.",
    "URL": "https://sunstonemagazine.com/audio/SL19164.mp3"
  },
  {
    "Audio": "SL19165",
    "Title": "Babel'd: A Contemporary Performance",
    "Presenters": "Kristin Perkins, Josh Allred",
    "Description": "Babel’d is an exploration of queerness, Mormonism, community, and memory through solo performance. Centering around a game of giant jenga, the audience pulls blocks randomly that trigger scenes; from questions asked while blowing bubbles, to a monologue by the ghost of Morris Young. Babel’d uses texts and visuals from interviews, anecdote, scripture, and Mormon history to ask: where do “peculiar and queer intersect?” While grounded in queer theory and Mormon history, this presentation uses performance epistemology to assert an alternative way of knowing— a knowing that comes through the lived experiences of queer Mormons in Mormon communities.",
    "URL": "https://sunstonemagazine.com/audio/SL19165.mp3"
  },
  {
    "Audio": "SL19166",
    "Title": "Sex Abuse and Resources: What Options Are Available for Victims",
    "Presenters": "Amber Whiteley, Paula Baker",
    "Description": "Whiteley will speak to the current state of sexual abuse within the LDS Church. A brief presentation will be made regarding the current systems put in place by the Church to support survivors and how these systems can be problematic at times. The presenters will review how to access resources that help survivors. The presentation will include a question and answer period.",
    "URL": "https://sunstonemagazine.com/audio/SL19166.mp3"
  },
  {
    "Audio": "SL19167",
    "Title": "The Mesa Easter Pageant and the Future of the LDS Church",
    "Presenters": "Brian Simper, Mark Petersen",
    "Description": "The Mesa Easter Pageant is an annual passion play of the life of Christ on the grounds of the Mesa Arizona Temple with a distinctive LDS flavor. During its two-week run up to Easter, the pageant attracts up to fifteen thousand people every night. It features a live cast of 500 local people and is one of the few pageants that will be continued even after Manti and others are ending. It is a community event that attracts the Christian community in Phoenix as the elements in the event have become more mainstream Christian over time.",
    "URL": "https://sunstonemagazine.com/audio/SL19167.mp3"
  },
  {
    "Audio": "SL19171",
    "Title": "Liquor and Mormons",
    "Presenters": "Lisa Barlow, Michael Eccleston, Tanner Lenart, Blair M. White",
    "Description": "Utah liquor laws are constantly evolving, and they don't always reflect what's best for businesses, customers, or even the safety of the community. The majority of people who make the laws in Utah don't drink, and this leads to frustration, misunderstandings, and bad press for the state.",
    "URL": "https://sunstonemagazine.com/audio/SL19171.mp3"
  },
  {
    "Audio": "SL19172",
    "Title": "Mormons and ERA",
    "Presenters": "Anissa Rasheta, Rebecca McHood, Sara Vranes, Kalani Tonga",
    "Description": "The Equal Rights Amendment (ERA) has a long history beginning in 1923. It is still not part of the U.S. Constitution. This would guarantee constitutional equality of the sexes. The LDS Church had an impact on the bill’s inability to be ratified by the arbitrary deadline, yet there has been a recent shift within the Church. With the Women’s Marches, #MeToo movement, and growing numbers of female representation in our government, the ERA is back in the spotlight. We will discuss the history of the ERA, why and how the ERA is still relevant, and what it will take to be ratified.",
    "URL": "https://sunstonemagazine.com/audio/SL19172.mp3"
  },
  {
    "Audio": "SL19173",
    "Title": "Overcoming the Anger: How to Let Go and Move On",
    "Presenters": "John Larsen, Jennifer Koski",
    "Description": "When individuals leave the Church they are often overwhelmed with negative emotions: anger, betrayal, hurt, lose and loneliness to name a few. While righteous indignation can seem cathartic at first, hosting negative feelings can begin to feel burdensome. Based on his many years working with individuals in faith transition, John will discuss ways to move on from the pain and embrace more peace and joy.",
    "URL": "https://sunstonemagazine.com/audio/SL19173.mp3"
  },
  {
    "Audio": "SL19174",
    "Title": "Theological Development in Mormon Fundamentalism",
    "Presenters": "Lindsay Hansen Park, Jacob Vidrine, Cristina Rosetti, Kris Wray, Drew Ostler",
    "Description": "This panel will explore “doctrinal formation” in a broader sense: where different fundamentalist ideas came from, and how different groups and individuals have interpreted, rejected, or altered doctrine based on their historical understanding, experiences, and beliefs.",
    "URL": "https://sunstonemagazine.com/audio/SL19174.mp3"
  },
  {
    "Audio": "SL19175",
    "Title": "Radiant Mormonism",
    "Presenters": "Margaret Young, John T. Kesler, Bob Rees, Lorie Winder Stromberg",
    "Description": "Richard Bushman coined the term “Radiant Mormonism,”  which suggests that certain Latter-day Saints radiate their influence “like rays of light and beams of energy from the sun.” He adds, “They are not official, but a part of each of them originates in the church and in core Mormonism. They are part of a great Mormon sphere of influence that reaches far beyond the church itself. . . . Radiant Mormonism is elevating. It improves the world. It operates on the principle of good will. Underlying it is the desire to work for the good of mankind.” This session consists of  half-hour interviews with two Radiant Mormons, followed by a question and answer period.",
    "URL": "https://sunstonemagazine.com/audio/SL19175.mp3"
  },
  {
    "Audio": "SL19176",
    "Title": "What's to a Faith Crisis? A Breakdown of the Process",
    "Presenters": "Allan Mount, Heather Beutler Shaffer, Jake Garrett, Dallin Johnson, Melvin Johnson",
    "Description": "What leads to people transitioning out of the Church? How do transitions evolve? How do relationships with the Church and still active loved ones look once someone has transitioned? This panel will explore those questions, and others, through hearing the transition stories of the panelists.",
    "URL": "https://sunstonemagazine.com/audio/SL19176.mp3"
  },
  {
    "Audio": "SL19177",
    "Title": "Finding Spiritual Paths After Mormonism",
    "Presenters": "Roman Bateman",
    "Description": "Though some leave the faith of their fathers, they still continue to seek truth and knowledge. This panel will explore how different individuals in the Mormon spectrum have connected with their own spirituality post-Mormonism.",
    "URL": "https://sunstonemagazine.com/audio/SL19177.mp3"
  },
  {
    "Audio": "SL19211",
    "Title": " Mormonism and Masonry: Emerging Evidence",
    "Presenters": "Clair Barrus, Cheryl Bruno, Laurie Vertner, H. Michael Marquardt",
    "Description": "Clair Barrus will investigate how Joseph Smith’s treasure seeking changed direction in the 1820s in response to Masonic ideology, opening the way for the restoration of scripture. Cheryl Bruno will investigate the underlying objectives of Nauvoo Freemasonry, demonstrating their cross-purposes with the Grand Lodge. The dramatic clash of Mormons and Masons from New York to the Western frontier mirrors the modern Church’s dissociation with prevailing social currents in the contemporary world. The Mormon/Masonic experience is a template for today.",
    "URL": "https://sunstonemagazine.com/audio/SL19211.mp3"
  },
  {
    "Audio": "SL19212",
    "Title": "Getting Unstuck From the Faith Crisis Narrative.",
    "Presenters": "Amy Logan, Brent Flamm",
    "Description": "The Thought Model empowers a person to understand how they process thoughts, make decisions, and take action in order to make lasting changes in their lives. People often get stuck in the circular thinking/questioning phase of a faith crisis when they feel deceived by the current church narrative and newfound information. This tool helps people break out of the victim mentality.",
    "URL": "https://sunstonemagazine.com/audio/SL19212.mp3"
  },
  {
    "Audio": "SL19213",
    "Title": "Finding Consensus in Mormon Controversy",
    "Presenters": "Jim Bennett, Jay Griffith",
    "Description": "Skeptics insist that the evidence makes it impossible for Mormons to confront thorny historical and doctrinal questions with their faith intact. But just as there’s more than one way to Mormon, there’s also more than one way to ex-Mormon. Jim Bennett explores the multiplicity of legitimate ways to evaluate the truth claims of the Church and looks for opportunities for people across the entire Mormon spectrum to find common ground.",
    "URL": "https://sunstonemagazine.com/audio/SL19213.mp3"
  },
  {
    "Audio": "SL19214",
    "Title": "Happily Ever After: Lessons From Mixed-Faith Marriages",
    "Presenters": "Nicholas R. Stewart, Allan Mount, Kattie Niu Mount, Matt Harward, Tricia Harward, Roy Schmidt",
    "Description": "How does your relationship with the Church effect your spouse and your relationship? Is your spouse willing to talk about things from their point of view? Can a mixed-faith marriage work? In this session, people (both believing Mormon and not) who are in mixed-faith marriages share their stories as well as tips and strategies for making mixed-faith marriages work.",
    "URL": "https://sunstonemagazine.com/audio/SL19214.mp3"
  },
  {
    "Audio": "SL19215",
    "Title": "Polygamy: Beyond Mormonism",
    "Presenters": "Tom Bennett, Stephen Carter",
    "Description": "Polygamy is common in most large mammals, from deer to elk to the great apes and more. Is polygamy natural amongst humans? Would modern young people benefit from practicing a non-patriarchial polygamy? How do modern Americans feel about polygamy? Tom has traveled the country asking these questions, and the answers may surprise you.",
    "URL": "https://sunstonemagazine.com/audio/SL19215.mp3"
  },
  {
    "Audio": "SL19216",
    "Title": "Jon McNaughton Mormon Artist, Right-Wing Propogandist: Take Two",
    "Presenters": "Bob Rees, Tom Rogers",
    "Description": "Latter-day Saint painter Jon McNaughton, who promotes himself as “America’s Artist,” continues to produce paintings that are reminiscent of the propagandistic art of totalitarian regimes. For all the color McNaughton uses in his paintings, the vision of the world he presents is starkly black and white—Obama, Democrats, liberals, and progressives are all shown as being on the side of Satan while Trump, Republicans, the Founding Fathers and the common man are triumphantly on the side of God, angels, and McNaughton himself. McNaughton’s art, which he claims is inspired by the Holy Ghost seems more beholden to Fox News. McNaughton’s work isn’t simply bad art: like all propaganda, it is dangerous.",
    "URL": "https://sunstonemagazine.com/audio/SL19216.mp3"
  },
  {
    "Audio": "SL19217",
    "Title": "Misplaced Priorities, Fixation on Ideals, and the Road to Healing",
    "Presenters": "Donna Shaffer, Emily Tucker",
    "Description": "Ideals should never be more important than human beings. If we want actions to improve, we need to elevate hope, not increase despair. This session addresses the causes as well as the harm of misplaced priorities and challenges religion to understand and embrace its own doctrine. It discusses lesser and even hijacked identities stemming from such priorities, as well as the need for healing vs. the hindering role the ego plays in it. It begins a discussion into the power of conscious presence and the value of being authentically good vs. needing to look good, and offers numerous resources for healing.",
    "URL": "https://sunstonemagazine.com/audio/SL19217.mp3"
  },
  {
    "Audio": "SL19218",
    "Title": "Jesus was Married: Celestial marriage and the Jesus Mormons are afraid to tell you about. The lost disciple and Women's relationship to the Christ.",
    "Presenters": "David Patrick, Rick C. Bennett",
    "Description": "Evidence of Jesus’ marriage was once a common teaching of the Church, but has been lost as the Church has given up “the principle” for a more convenient world view. How can a perfect being and example that followed all of God’s laws not follow that one great law to multiply and replenish the earth? This presentation will explore evidences, lore, and Church history on the subject of Jesus Christ’s marriage(s) to put his family’s story back in plain view. Who were the most important women in Jesus' life?",
    "URL": "https://sunstonemagazine.com/audio/SL19218.mp3"
  },
  {
    "Audio": "SL19221",
    "Title": "What the LDS Church Can Learn From the Catholic Response to Fundamentalism",
    "Presenters": "Cristina Rosetti, Brian Hauglid",
    "Description": "From 1970 to 1995, Veronica Luekin reported ecstatic visions of Mary, the Mother of Jesus. As the visions become more widely reported, Luekin developed a following that culminated in the building of a shrine in Bayside, New York. Her visions reported that the end was near and that a Vatican infiltration caused the Second Vatican Council. \n\nLueken is one of many women whose intense religious experiences led to resurgences in Catholic traditionalism. However, despite their controversial beliefs and practices, traditionalist Catholics are not always condemned by Catholic leadership. I argue that the lack of condemnation benefits the Roman Catholic Church hierarchy and leads to less schism in the Catholic movement and that the LDS Church can learn something from this approach.",
    "URL": "https://sunstonemagazine.com/audio/SL19221.mp3"
  },
  {
    "Audio": "SL19222",
    "Title": "An Alternative Orthodoxy for Mormonism",
    "Presenters": "Jana Spangler, LaNeece Flamm",
    "Description": "Fr. Richard Rohr, OFM, a prominent Catholic priest, writer, and teacher, has referred to his Franciscan teachings as an alternative orthodoxy that “doesn’t throw out the mainline tradition; [it] simply place[s] our effort and our energy on overlooked or misunderstood aspects of the tradition.” In this session, we will use Fr. Rohr’s alternate orthodoxy as a guide to explore what an alternative orthodoxy might look like in the Mormon tradition if we emphasize certain aspects of the radical wisdom teachings of Jesus of Nazareth combined with the mystical teachings of Joseph Smith. What might this approach open up for spiritual seekers and younger Mormons who are feeling a disconnect in today’s LDS Church?",
    "URL": "https://sunstonemagazine.com/audio/SL19222.mp3"
  },
  {
    "Audio": "SL19223",
    "Title": "Re-membering ourselves in the wake of a faith crisis",
    "Presenters": "Shirlee Draper, Steve Florman",
    "Description": "Many people who leave high-demand religions or cults are ashamed of their upbringing and past. This pathology can be reinforced by well-meaning “helpers” who contend that the refugee’s former life was bad, but that if they disown it, they can now be good. This can cause disastrous consequences, both psychologically and emotionally, for the refugee. This session examines the harm of disowning and dismembering the self, with suggestions for practices to “re-member” ourselves for healing and growth.",
    "URL": "https://sunstonemagazine.com/audio/SL19223.mp3"
  },
  {
    "Audio": "SL19224",
    "Title": "Revelation and Relativity: Black Holes, Time Dilation, and the Throne of God",
    "Presenters": "Joseph Callender, Melvin Johnson",
    "Description": "The 4.1-million solar mass black hole at the center of our galaxy, closely surrounded by thousands of typical (25 – 40 solar mass) black holes, is “the great one,” Kolob, with “many great ones near unto it.” Recent scientific studies indicate black holes likely involve higher-dimensional portals leading out of our universe and into an alternate reality. It is this sense in which Kolob is “nearest to the throne of God.” In addition, terms and phrases such as “one planet above another,” “set time,” and “the order of that upon which thou standest,” all become clear in terms of relativity.",
    "URL": "https://sunstonemagazine.com/audio/SL19224.mp3"
  },
  {
    "Audio": "SL19225",
    "Title": "Developing True Human Connection in the Midst of Doubt",
    "Presenters": "Randall Davis, Rick C. Bennett",
    "Description": "One of the tensions within faith communities is the binary view that faith and doubt are on opposites sides of the spectrum, when faith and doubt may be better viewed as uneasy siblings. Unfortunately, when doubt is viewed in narrow terms, people who deeply question are often afraid of revealing their uncertainties to family and friends. Consequently, emotional connection and intimacy are lost. In this session, the presenter discusses how doubt can lead to healthy paradigms of faith and facilitates a discussion on ways of supporting one another in mixed-faith marriages and friendships where doubt exists. Audience participation is encouraged.",
    "URL": "https://sunstonemagazine.com/audio/SL19225.mp3"
  },
  {
    "Audio": "SL19226",
    "Title": "Healing After Sexual Abuse: A Research Study With LDS/Mormon/Latter-day Saint Survivors of Childhood Sexual Abuse",
    "Presenters": "Amber Choruby Whiteley, Natalie Sperry Mandelin",
    "Description": "This presentation will review the results of Amber’s doctoral dissertation, which was a qualitative research study with adult survivors of childhood sexual abuse. The research was conducted with diverse participants including varying gender and sexual identities. Results include a gender analysis to show the differing experiences participants experienced across their gender identities. A theoretical model will also be reviewed, which shows the intersections of church experiences and internalized guilt and shame a survivor may experience.",
    "URL": "https://sunstonemagazine.com/audio/SL19226.mp3"
  },
  {
    "Audio": "SL19227",
    "Title": "The Truth That Once Was Spoken: Love As The Fufillment Of Our Faith",
    "Presenters": "Parker Johnson, Yoshimi Fey Gonzalez",
    "Description": "The future of institutional Mormonism does not look very bright. It has become what Moroni prophecied of in Mormon chapter 8 of the Book of Mormon. However, the Book of Mormon teaches that there will be a latter-day City of Peace called Zion, a city that is defined by everyone knowning the Lord and being of one heart and mind with each other without poverty. The future of true, authentic Mormonism (and Christianity) is inseperably tied to coming back into the presence of the Lord, and loving others.",
    "URL": "https://sunstonemagazine.com/audio/SL19227.mp3"
  },
  {
    "Audio": "SL19228",
    "Title": "LDS Urantian: Pursuing Personal Religion through Social Experiences",
    "Presenters": "Tim Williams, Blair M. White",
    "Description": "Discovering Christ’s pursuit of personal religious expression using the Bible, Book of Mormon, and Urantia Book can help us understand how all enlightened worlds (not us) saw Christ, his mission, and his gospel.  It also helps us understand how power from heaven comes through personal religious pursuit in social and religious association with our fellow brothers and sisters.",
    "URL": "https://sunstonemagazine.com/audio/SL19228.mp3"
  },
  {
    "Audio": "SL19231",
    "Title": " It's Not Hopeless! Navigating Mixed Faith Marriage",
    "Presenters": "Lisa Butterworth, Sara Hughes Zabawa, Jennifer Rooney White, Natasha Helfer Parker, Josh Allred",
    "Description": "As more Mormons experience faith transitions and faith awakenings many couples find themselves unexpectedly in mixed-faith marriages. This session presents both personal and professional insights into honoring both the challenges and benefits of differing beliefs in a marriage. We will highlight the gifts associated with individualization and fostering mutual respect for each person’s spiritual journey. We will offer suggestions for reducing conflict, improving communication, and strengthening a couple’s emotional connection and intimacy.",
    "URL": "https://sunstonemagazine.com/audio/SL19231.mp3"
  },
  {
    "Audio": "SL19232",
    "Title": "Zion: The Roots of Mormon Correlation",
    "Presenters": "Matthew Bowman, Brian Hauglid",
    "Description": "This presentation will explore the practical, theoretical, and theological underpinnings of the correlation movement, a bureaucratic reform movement which spanned the first two thirds of the twentieth century and reinvented the organization and culture of the Church.",
    "URL": "https://sunstonemagazine.com/audio/SL19232.mp3"
  },
  {
    "Audio": "SL19233",
    "Title": "John W. Woolley as a Highly Trusted Mormon From September 1886 to December 1913",
    "Presenters": "D. Michael Quinn, Johnny Stephenson",
    "Description": "Most “Fundamentalist Mormons” have honored John W. Woolley (born in 1831) as the man who became senior “High Priest Apostle” following the death in 1918 of LDS Church president Joseph F. Smith. According to that belief, both were among the six men allegedly commissioned in 1886–87 by President John Taylor to preserve plural marriage if the Church officially abandoned it. After Woolley was excommunicated in 1914 for performing plural marriages in violation of the Church’s 1890 “Manifesto” and its 1904 “Second Manifesto,” LDS leaders and LDS historians have portrayed him negatively. As a counter-balance, this presentation examines his activities from 1886 to 1913 (as seen mainly in sources from the time period), when LDS General Authorities clearly regarded him as a trustworthy Latter-day Saint.",
    "URL": "https://sunstonemagazine.com/audio/SL19233.mp3"
  },
  {
    "Audio": "SL19234",
    "Title": "The Colorado City Music Festival",
    "Presenters": "Tom Bennett, Jen Perlmutter Tanner",
    "Description": "The Colorado City Music Festival, held in a polygamist hotbed, is the first festival of its kind. Bennett, one of its founders, will outline the relationships built, the challenges, and how he found Mormon fundamentalists open to sharing their culture. He’ll also talk about the changes he has seen in the community since the event began three years ago.",
    "URL": "https://sunstonemagazine.com/audio/SL19234.mp3"
  },
  {
    "Audio": "SL19235",
    "Title": "The Role of Reason in the Transformation of the RLDS Church to 'Community of Christ'",
    "Presenters": "Bill Russell, Steve Florman",
    "Description": "The RLDS Church went through the process of transitioning itself from sect to denomination over the past half-century or so. Two causes often cited are the increase in graduate education and the effect of missionary work in non-Christian nations. This paper will contend that the life of the mind is the primary reason for the theological divide, and the Wesleyan Quadrilateral is a useful tool in the pursuit of religious truth.",
    "URL": "https://sunstonemagazine.com/audio/SL19235.mp3"
  },
  {
    "Audio": "SL19236",
    "Title": "Essence of The Classic Yoga Scriptures: The Yoga Sutras",
    "Presenters": "Philip McLemore, Jay Griffith",
    "Description": "Yoga, not to be confused with the modern yoga movement of physical postures, is one of the major schools of Hindu philosophy, referring to an awakened state of Oneness with and in God and the path that leads to that realization. Why do so few Christians and Mormons experience inner transformation and rebirth? What are the main obstacles to spiritual awakening?  Are there clear steps one can take to realize Oneness with and in God? The Yoga Sutras has clear answers to all of these questions and much more.",
    "URL": "https://sunstonemagazine.com/audio/SL19236.mp3"
  },
  {
    "Audio": "SL19237",
    "Title": "From Lingering Longer to Bowling Alone: Tracking the Changes in Community and Social Capital Related to Faith Transitions",
    "Presenters": "Kelly Furr, Mark Petersen",
    "Description": "The LDS Church has historically been a social hub for many of its members, and as one’s orthodoxy wanes, often so too does one’s sense of community and belonging. This presentation will examine Robert Putnam’s research on the interplay between social capital, community, and religion in the Mormon context, and will tackle the following questions: What happens when a faith transition causes one to lose social capital? How can those who leave rebuild a new community? What can the institutional Church do to keep unorthodox member engaged? How does one’s social capital and sense of community affect one’s mental health?",
    "URL": "https://sunstonemagazine.com/audio/SL19237.mp3"
  },
  {
    "Audio": "SL19238",
    "Title": "Mormon Mean Girls (It's not just girls!)",
    "Presenters": "April Carlson, Jesse Curtis",
    "Description": "Mormon mean girls terrorize their peers with emotional violence inflicted through the weapons of relational aggression: gossip, social exclusion, conditional friendship, silent treatment, concern trolling, betrayal, doxing, belittling (under the guise of joking), or stealing the work of others. But it’s not just the girls! Learn why relational aggression thrives across age and gender in Mormon spaces. Discover what works to make it better and protect yourself. Hear stories from survivors and join in a community discussion of how to address relational aggression when it shows up in your network of connection.",
    "URL": "https://sunstonemagazine.com/audio/SL19238.mp3"
  },
  {
    "Audio": "SL19242",
    "Title": "Sunstone Hymn Sing Along",
    "Presenters": "Alan Eastman, Vickie Eastman",
    "Description": "This session honors the tradition of music and singing at Sunstone. The Eastmans are a beloved part of the Sunstone community and will lead the Symposium congregation in singing some of the hymns of the restoration, with Alan Eastman at the piano and Vickie Eastman leading.",
    "URL": "https://sunstonemagazine.com/audio/SL19242.mp3"
  },
  {
    "Audio": "SL19243",
    "Title": "Faithful Screening",
    "Presenters": "Dane Christensen",
    "Description": "Faithful Screening",
    "URL": "https://sunstonemagazine.com/audio/SL19243.mp3"
  },
  {
    "Audio": "SL19251",
    "Title": "Why We Stay",
    "Presenters": "Christian Kimball, Matt Jones, LaShawn Williams, Dan Wotherspoon",
    "Description": "This perennially well-received session features the stories of those who have chosen to remain active, dedicated Latter-day Saints even in the face of challenges to traditional faith.",
    "URL": "https://sunstonemagazine.com/audio/SL19251.mp3"
  },
  {
    "Audio": "SL19261",
    "Title": "The Art of Polygamy",
    "Presenters": "Kelly McAfee, Jennifer Koski",
    "Description": "Kelly McAfee became interested in early Mormon polygamy when she learned she was related to Fanny Alger. She pulled out her watercolors and began painting what would become over one hundred portraits of the men and women of early Mormon polygamy over a nine-week period. She then took on a five-week task of painting faces and sewing clothes for character dolls of Joseph Smith’s 40 wives, along with dolls of Joseph Smith and Jane Manning. Taking a step back from the project, the results were not what she expected. Come see for yourself.",
    "URL": "https://sunstonemagazine.com/audio/SL19261.mp3"
  },
  {
    "Audio": "SL19262",
    "Title": "I Go to Two Churches",
    "Presenters": "Stephen Carter, Gina Colvin, Eric Canfield, Wendy Smith",
    "Description": "It seems strange to go to another church when you already attend the only true and living church on the face of the earth. But the members of this panel have actually found that supplementing their LDS church-going with another religious tradition has enriched their spiritual lives and made them better people.",
    "URL": "https://sunstonemagazine.com/audio/SL19262.mp3"
  },
  {
    "Audio": "SL19263",
    "Title": "Protect Every Child",
    "Presenters": "Sam Young, Rebecca Smyrniotopoulos",
    "Description": "In 2018, thousands in the Mormon community rallied to protect LDS children from ecclesiastical abuse. In 2019, Mormons have formed a coalition to protect children of all religions.",
    "URL": "https://sunstonemagazine.com/audio/SL19263.mp3"
  },
  {
    "Audio": "SL19264",
    "Title": "Quantum Physics and the Light of Christ in the Biblical Creation Story",
    "Presenters": "Joseph Callender, Jen Perlmutter Tanner",
    "Description": "Modern cosmology reveals Genesis 1 as a metaphor for creation of the universe, and the dual, wave/particle personality of light—the “complementarity principle”—defines the spiritual and physical creations and provides a scientific basis for the “fall.” God’s observation (“God saw…”) was the trigger that manifested each “day’s” physical creation from the spiritual.” Adam’s “transgression” was partaking of the “fruit” of physical sensory experience via the “tree of knowledge of good and evil” (the nervous system and senses), manifesting the physical universe to his consciousness, which thereafter competes with consciousness of God, as symbolized by the commandment not to partake.",
    "URL": "https://sunstonemagazine.com/audio/SL19264.mp3"
  },
  {
    "Audio": "SL19265",
    "Title": "What Became of the Woolleys? Mormon Fundamentalism's Founding Family",
    "Presenters": "Tom Bennett, Stephanie Griswold",
    "Description": "In 1886 John Taylor had a revelation to continue plural marriage. The Woolley family was in attendance and was charged to help him. They were pivital in the founding of Short Creek and early Mormon Fundamentalism but their name is not commonly found amongst the principal figures today. What became of the Woolleys?",
    "URL": "https://sunstonemagazine.com/audio/SL19265.mp3"
  },
  {
    "Audio": "SL19266",
    "Title": "Would Jesus Attend Sunstone?",
    "Presenters": "Bob Rees, Bill McGee",
    "Description": "Some Latter-day Saints feel that attending or presenting at Sunstone or publishing in Sunstone Magazine—or even reading it is—inappropriate or, worse, dangerous. It is popular for Latter-day Saints and other Christians to ask WWJD—”What would Jesus do?” This session attempts to answer that question in relation to Sunstone.",
    "URL": "https://sunstonemagazine.com/audio/SL19266.mp3"
  },
  {
    "Audio": "SL19267",
    "Title": "Radio Free Mormon Broadcasting Behind Enemy Lines",
    "Presenters": "Robbie Stone",
    "Description": "For the first time, RFM will personally meet his listeners and others who want to ask about anything and everything that is happening behind enemy lines.",
    "URL": "https://sunstonemagazine.com/audio/SL19267.mp3"
  },
  {
    "Audio": "SL19268",
    "Title": "Nurturing Growth and Development Post-Orthodoxy",
    "Presenters": "Sara Hughes-Zabawa, Jana Spangler, Anthony D. Miller, Yoshimi Fey Gonzalez",
    "Description": "As more Mormons experience faith transitions and faith awakenings, many find themselves looking for continued growth and expansion without knowing how to pursue that in emotionally safe and intellectually stimulating ways. This session aims to explore approaches to individual and/or spiritual growth outside of an orthodox framework. We invite others to be empowered in their personal development by discussing our personal and professional experiences in owning and expanding individual development post-orthodoxy. We will also explore how nurturing our own individual growth and progression can foster a greater ability to sit with others in their differences.",
    "URL": "https://sunstonemagazine.com/audio/SL19268.mp3"
  },
  {
    "Audio": "SL19271",
    "Title": "Imagining Mormonism: The Church at Mid-Century",
    "Presenters": "Bob Rees, Galen Murdock, Jana Spangler, Becky Gomez",
    "Description": "Thirty years ago, no one—likely not even prophets and visionaries—could have imagined today’s LDS Church, especially with the advent of modern technology like the Internet, iPhones, and other inventions. So, how can we begin to imagine the Church at mid-century? This session consists of a panel of futurists and other visionaries who gaze into the globe of the future to tell us what the Church may be like in thirty years. Attendees will be invited to preset their own soothsaying prognostications.",
    "URL": "https://sunstonemagazine.com/audio/SL19271.mp3"
  },
  {
    "Audio": "SL19272",
    "Title": "Different Views on Priesthood",
    "Presenters": "Deven Ransom, Joe Darger, Joanna Smith, Charlotte Erickson, Various members of Mormon traditions",
    "Description": "There is a diversity of thought about priesthood and its role in Mormonism cosmology of authority. This panel of individuals from various Mormon movements will discuss their understanding of how priesthood functions and who has authority.",
    "URL": "https://sunstonemagazine.com/audio/SL19272.mp3"
  },
  {
    "Audio": "SL19273",
    "Title": "What's in a Name? The History Behind the Label \"Mormon\"",
    "Presenters": "Bryan Buchanan, Lindsay Hansen Park, Anne Wilde, D. Michael Quinn, Richie Wilcox",
    "Description": "Over the course of Mormonism's history, followers out of the Restoration have struggled with what to call themselves. This panel will explore the historical context of the label \"Mormon.\"",
    "URL": "https://sunstonemagazine.com/audio/SL19273.mp3"
  },
  {
    "Audio": "SL19274",
    "Title": "How the Succession Crisis is Solved by Knowing the Sealed Portion",
    "Presenters": "Jason LeRoy Wharton, Drew Ostler",
    "Description": "One of the hottest debates among Mormon fundamentalists is about who has the priesthood keys and authority. Many Mormon offshoot groups claim to have it, but there can only be one legitimate successor.  Who is right?  \n\t\n\nWharton will argue that the  answers have been there all along in the scriptures, hidden in the sealed portion. He will present on how to decipher the symbology of the sealed portion to determine when and where the keys of the priesthood have been transferred and to positively identify where they are now.",
    "URL": "https://sunstonemagazine.com/audio/SL19274.mp3"
  },
  {
    "Audio": "SL19275",
    "Title": "BYU Students Take On a Homogeneous Campus",
    "Presenters": "Franchesca Lopez, Julia Stark, Grant Frazier, Evan Jones, Jennifer Koski",
    "Description": "In a campus environment known for its marked homogeneity, some students at BYU struggle to find a home within the ranks of Mormon orthodoxy. Four students and former students talk about their experiences of carving out space for nuanced belief. With an array of experiences with and beliefs about the LDS Church, they will discuss the effects that BYU has had on their individual faith journeys and how they’ve challenged some of the dogma that exists in the BYU community.",
    "URL": "https://sunstonemagazine.com/audio/SL19275.mp3"
  },
  {
    "Audio": "SL19276",
    "Title": "Bisexuality and Mormonism",
    "Presenters": "Nicholas R. Stewart, Blaire Ostler, Blair M. White",
    "Description": "This session will explore the experience of bisexual people in Mormonism. Where in the framework of Mormonism do bisexual people fit? What additional challenges exist within Mormonism (versus outside of Mormonism) for bisexual people? How does being bisexual impact ones faith/belief?",
    "URL": "https://sunstonemagazine.com/audio/SL19276.mp3"
  },
  {
    "Audio": "SL19277",
    "Title": "The Return of the Divine Feminine and The Search For Magic Within",
    "Presenters": "Heather McGee Teodoro, Jesse Curtis",
    "Description": "This session will explore our spiritual and energetic nature as humans, including our light body, our auric field, and our chakra system. This session will also explore the relationship between the magnetic energy of the Divine Feminine and the electric energy of the Divine Masculine, and give tools for balancing these energies within our own lives.",
    "URL": "https://sunstonemagazine.com/audio/SL19277.mp3"
  },
  {
    "Audio": "SL19278",
    "Title": "The Mormon Mind-game: Common Mormon Thinking Errors",
    "Presenters": "Jennifer White, Sara Hughes-Zabawa, Lisa Butterworth, Wendy Demandante",
    "Description": "Every culture, organization, religion, and person experiences thinking errors, which are commonly called cognitive distortions. Cognitive distortion can cause individuals to perceive reality inaccurately, producing, and reinforcing negative thoughts and emotions. This session will build off of the popular session “Mormon Thinking Errors” which addressed typical ways myth and overgeneralizations present themselves in our LDS families and church settings. This session will take the conversation further and offer concrete strategies to combat the cognitive distortions we are personally experiencing and how to address them in our internally as well as with our interactions with our in our family and friends.",
    "URL": "https://sunstonemagazine.com/audio/SL19278.mp3"
  },
  {
    "Audio": "SL19291",
    "Title": "\"Pure\" and Purity Movements",
    "Presenters": "Linda Kay Klein, Bethany Middleton Gull",
    "Description": "From a woman who has been there and back, this session will take an inside look at the devastating effects evangelical Christianity’s purity culture has had on a generation of young women—and how these lessons can also apply to Mormon interpretations of purity.",
    "URL": "https://sunstonemagazine.com/audio/SL19291.mp3"
  },
  {
    "Audio": "SL19301",
    "Title": "Hope: A Devotional",
    "Presenters": "Bob Rees, Stephen Carter",
    "Description": "Emily Dickinson says that “hope is a thing with feathers.” St. Paul included hope in his golden triad of Christian virtues, in between faith and love. This devotional considers the dimensions of hope in a world that often seems hopeless, examining it through the prism of scripture, art, poetry, and music.",
    "URL": "https://sunstonemagazine.com/audio/SL19301.mp3"
  },
  {
    "Audio": "SL19311",
    "Title": "Naturalistic Explanations for the Origin of the Book of Mormon:  1829 to 2018",
    "Presenters": "Brian C. Hales, Amylin Peterson",
    "Description": "Even before it was published, alternate stories were issued to compete with Joseph Smith’s explanation of the Book of Mormon’s origin. Five will be introduced and tracked chronologically: 1. The original manuscript of the Book of Mormon was written by Solomon Spaulding. 2. Collaborators helped Joseph Smith create the text. 3. Joseph Smith’s mental illness enhanced his writing ability. 4. Automatic writing—Joseph function as a spirit-medium while dictating the Book of Mormon. 5. Joseph Smith, perhaps with help from his environment, the Bible, and other books, was capable of producing the Book of Mormon from his own intellect.",
    "URL": "https://sunstonemagazine.com/audio/SL19311.mp3"
  },
  {
    "Audio": "SL19312",
    "Title": "Welcome to Mormon Transhumanism",
    "Presenters": "Blaire Ostler, Lincoln Cannon, Ben Blair, Drew Ostler",
    "Description": "People are starting to recognize parallels and complements between Mormon and Transhumanist views. On one hand, Mormonism is a religion of the Judeo-Christian tradition that advocates immersive discipleship of Jesus Christ. On the other hand, Transhumanism is a mostly secular ideology that advocates ethical use of technology to expand human abilities. However, Mormonism and Transhumanism advocate remarkably similar views of human nature and potential.",
    "URL": "https://sunstonemagazine.com/audio/SL19312.mp3"
  },
  {
    "Audio": "SL19313",
    "Title": "Reflecting on the Wives of Joseph Smith",
    "Presenters": "Todd Compton, Lindsay Hansen Park, Nadine McCombs Hansen",
    "Description": "In this paper Compton will tell the story of how he came to write In Sacred Loneliness: the Plural Wives of Joseph Smith. For years he had been studying Classics, ancient Greek and Latin, but a series of odd accidents led him to start transcribing and annotating the diaries of Eliza R. Snow Smith. This in turn led him to try to come up with a reliable, scholarly list of Joseph Smith’s wives, so he could understand the women Eliza was associating with. To create that list he found that he needed to understand the full lives of those thirty-three women, and so ended up reading their diaries, letters and autobiographies. Eventually he began writing biographies of each of them. Problems and complexities in their marriage history led him on an exciting scholarly/detective quest. In addition, their writings were so moving that he ended up feeling deeply connected to each of them.",
    "URL": "https://sunstonemagazine.com/audio/SL19313.mp3"
  },
  {
    "Audio": "SL19314",
    "Title": "Graffiti and the Kirtland Temple",
    "Presenters": "Tom Kimball, Yoshimi Fey Gonzalez",
    "Description": "Tom Kimball has worked as a volunteer handyman and tour guide at the Kirtland Temple since 2016. At some point, he began actively looking for and logging the existing graffiti in the temple. Some of it is likely from teens gathered in the bell tower over a 1920’s RLDS reunion campout, but some of it is much older. From a scrawled 1956 date next to initials in the bell tower and stylish Italian cursive under Aaronic alters, to initials and possible signatures of 1830s church leaders, the discoveries are historical and fantastic.",
    "URL": "https://sunstonemagazine.com/audio/SL19314.mp3"
  },
  {
    "Audio": "SL19315",
    "Title": "The Rising Strong Process: Official DARE TO LEAD™ Brené Brown Curriculum",
    "Presenters": "Suzy Benson-Gillies, Mark Petersen",
    "Description": "Based on the research of Dr. Brené Brown, Dare to Lead is an empirically based courage- building program. Learn the role that curiosity and recognition of emotion play in developing rising results. Recognize common strategies for offloading hurt and learn more effective behaviors for managing emotion. Learn the physics of vulnerability. Learn to rise after the fall. Learn how to write down the story we make up (SFD) that helps us make meaning of our experiences. Identify patterns of overfunctioning/underfunctioning with others. Explore grief, anxiety, and forgiveness.",
    "URL": "https://sunstonemagazine.com/audio/SL19315.mp3"
  },
  {
    "Audio": "SL19316",
    "Title": "On Beyond Faith in the Borderlands",
    "Presenters": "D. Jeff Burton, Stephen Carter, Roy Schmidt",
    "Description": "Many troubled LDS members dwell in the Borderlands of the Church. Acceptability is always an issue for Borderlanders. But acceptability has two facets: (1) what we need to do to be acceptably faithful, and (2) what can be done to make Borderland members like us more acceptable and better perceived as “being faithful.” This session will explore these two facets of acceptability and their relationships to “being faithful.”",
    "URL": "https://sunstonemagazine.com/audio/SL19316.mp3"
  },
  {
    "Audio": "SL19317",
    "Title": "Joseph, Brigham, and John, and the “King over Israel” Coronation",
    "Presenters": "Jacob Vidrine, Christopher C. Smith",
    "Description": "While it might be surprising to some, the first three LDS prophets were secretly anointed to an office described as the “Ruler over Israel” and the “Prophet, Priest, and King” over the Kingdom. In recent years, new sources about this ordinance have come to light, including a revelation in John Taylor’s own handwriting to be anointed to this office. This new document and others illuminate the history and significance of this ordinance. The never fully implemented office of the Queen over the Kingdom, originally intended to preside alongside the Prophet, Priest, and King, will also be discussed.",
    "URL": "https://sunstonemagazine.com/audio/SL19317.mp3"
  },
  {
    "Audio": "SL19318",
    "Title": "Relational Trajectories of Ex-LDS Children and Their Active LDS Parents",
    "Presenters": "Jared Worwood, Blair M. White",
    "Description": "Ex-LDs individuals face a unique and perhaps turbulent time in their relationship with their parent if the individual decides to leave the LDS Church. To explore this phenomena, we propose the following questions:  “What turning points exist within the relationships of ex-LDS children and their active LDS parent?” and “What trajectories occur in relationships of ex-LDS children and their active LDS parent?” 30 participants were interviewed using a qualitative research method, the retrospective interview technique (RIT). Through turning point analysis (an analysis component of RIT), we identified 155 turning points and nine relationship trajectories.",
    "URL": "https://sunstonemagazine.com/audio/SL19318.mp3"
  },
  {
    "Audio": "SL19321",
    "Title": "Revelation: Foundational Principle and the Ground of Equality",
    "Presenters": "Janice Allred, Bill McGee",
    "Description": "We usually consider faith from the human perspective. If we fail to reach out to God, will God abandon us? The good news of the gospel is that God loves all people and initiates the work of salvation through revelation. Revelation is a foundational principle of the gospel, bringing all people into equality in Christ. It is the ground of equality because it gives every person direct access to God through the Holy Spirit. It is a foundational principle of the church because it establishes communication between God and his people and unifies them through the Holy Spirit.",
    "URL": "https://sunstonemagazine.com/audio/SL19321.mp3"
  },
  {
    "Audio": "SL19322",
    "Title": "Millennials, Mormonism(s), and Myth",
    "Presenters": "Jaxon Washburn, Natalie Sperry Mandelin",
    "Description": "Though Jaxon Washburn has been a Mormon all his life, being a transhumanist is an identity he has only recently taken. Now in the process of beginning his career path and life as a young adult, Jaxon has found direction, inspiration, and wonder in continuing to explore the boundaries of both his Mormon and transhumanist identities. At the end of the day, he remains a transhumanist not in spite of his Mormonism, but because of it.",
    "URL": "https://sunstonemagazine.com/audio/SL19322.mp3"
  },
  {
    "Audio": "SL19323",
    "Title": " The Beatles, Rock and Roll, and Mormonism",
    "Presenters": "Todd Compton, Clair Von Barrus, Harold Peterson, Jane Griffith",
    "Description": "In this panel, Mormons who have written about the Beatles will discuss their “Mormon” experience with the band. For Compton, Paul McCartney’s emphasis on love, family, and home after the Beatle breakup led him to see Mormonism a little more sympathetically. More broadly, he sees great art, music, and literature as part of the gospel, so the Beatle albums are part of his canon of holy writ. Clair will explore how Beatles backwards masking in the 60s influenced CES curricula in the 80s, which influenced Clair's views of rock music and spirituality.",
    "URL": "https://sunstonemagazine.com/audio/SL19323.mp3"
  },
  {
    "Audio": "SL19324",
    "Title": "Paradisiacal Glory: Our Future Lives in the Mormon Millennium",
    "Presenters": "Paul Haymore, Nancy Ross",
    "Description": "When Joseph Smith wrote the 10th Article of Faith in 1842, what did our Mormon ancestors imagine the future of the faith to look like? Mormonism, born from Millennialism, has its own unique take on the great and dreadful day, but has less to say about the particulars of the 1000-year personal reign of Jesus Christ. What would life look like for the average person born 600 years into the Millennium? How would The Church of Jesus Christ of Latter-Day Saints perfectly govern the inhabitants of the renewed earthly paradise as a promised theocracy? Would you want to live there?",
    "URL": "https://sunstonemagazine.com/audio/SL19324.mp3"
  },
  {
    "Audio": "SL19325",
    "Title": "The Rising Strong Process: Official DARE TO LEAD™ Brené Brown Curriculum Continued",
    "Presenters": "Suzy Benson-Gillies, Mark Petersen",
    "Description": "Based on the research of Dr. Brené Brown, Dare to Lead is an empirically based courage- building program. Learn the role that curiosity and recognition of emotion play in developing rising results. Recognize common strategies for offloading hurt and learn more effective behaviors for managing emotion. Learn the physics of vulnerability. Learn to rise after the fall. Learn how to write down the story we make up (SFD) that helps us make meaning of our experiences. Identify patterns of overfunctioning/underfunctioning with others. Explore grief, anxiety, and forgiveness. This session is a continuation of session 315.",
    "URL": "https://sunstonemagazine.com/audio/SL19325.mp3"
  },
  {
    "Audio": "SL19326",
    "Title": "Navigating through Church Trauma",
    "Presenters": "Danna Hartline, Jay Griffith, Rick C. Bennett",
    "Description": "The future of the Mormon faith is going to find many people grappling with just that—their faith.  As the Church continues to increase in its organizational behavior and knuckle down on policies, church trauma is going to see an increase. How does one navigate through that?  What even is church trauma? What are the root causes? What are the consequences? Where does one go for help and healing post trauma?  All of these questions will be explored in this session.",
    "URL": "https://sunstonemagazine.com/audio/SL19326.mp3"
  },
  {
    "Audio": "SL19327",
    "Title": "Joseph Smith's Adam-God Teachings: A Historical Look",
    "Presenters": "Benjamin Shaffer",
    "Description": "This presentation will review many statements from Joseph Smith, including new documentation that has come to light in the Joseph Smith Papers Project, to argue that the Adam-God teachings in Mormonism originate with Joseph Smith and not with Brigham Young. Correcting the record to indicate that Joseph Smith is the origin of Adam-God teachings has broader implications for the LDS movement in general, and the narrative in the LDS Church as well. How this affects approaches to writing LDS theological history will also be explored.",
    "URL": "https://sunstonemagazine.com/audio/SL19327.mp3"
  },
  {
    "Audio": "SL19328",
    "Title": "Culture Clash: Postmodern Religious Identity (re)Creation and Mormon Institutional Conservatism",
    "Presenters": "Kent A. Thompson, Amylin Peterson",
    "Description": "This exploratory paper seeks to understand the impact of postmodernism on spiritual identity (re)creation through the lenses of sociological identity theory and critical social theory. The author argues that the emancipatory nature of postmodern epistemologies on person and group identity (re)creation render traditional religious institutions, such as the Mormon Church, ill-equipped to appeal to postmodern individual and societal spiritual needs. This fundamental disconnect is explored through an analysis of rhetoric of current and past Mormon leaders and its impact on the identity (re)creation process. Finally, the author proposes criteria for successful postmodern religious institutions for further discussion.",
    "URL": "https://sunstonemagazine.com/audio/SL19328.mp3"
  },
  {
    "Audio": "SL19331",
    "Title": "Post-Mormonism and the Witchy World View",
    "Presenters": "Zina Bennion, Sara Hanks, Paula Baker",
    "Description": "Zina Bennion and Sara Hanks are two Utah-based, post-Mormon tarot readers. In the spring of 2019, they launched “Roots, Seeds, and Weeds,” an online course for post-Mormon women and femmes seeking spiritual reclamation on their own terms. Join Zina and Sara for a discussion of mystical, sovereign, earth-based spirituality, the unique challenge facing those who step away from Mormonism and still crave a thriving devotional life, and how to cultivate a spiritual garden with roots from the ancestors, seeds of new discovery, and discernment for the weeds that spring up unexpectedly.",
    "URL": "https://sunstonemagazine.com/audio/SL19331.mp3"
  },
  {
    "Audio": "SL19332",
    "Title": "Queer Mormon Transhumanism",
    "Presenters": "Blaire Ostler, Drew Ostler",
    "Description": "Queer Mormon Transhumanism is concerned with a specific subset of Mormon and transhumanist goals. It is the presenter’s belief that science and technology, the gender revolution, and Mormon theology need not be at odds with one another. Queer Mormon Transhumanism is concerned with reconciling the tensions of these intersections by illuminating how queer Mormon theology already is, and how science and technology can be used to benefit all bodies. In short, the future of faith is queer, or at the very least queer-friendly.",
    "URL": "https://sunstonemagazine.com/audio/SL19332.mp3"
  },
  {
    "Audio": "SL19333",
    "Title": "Break Open The Vessel, Pour The Oil, Cut The Cords",
    "Presenters": "Jody England Hansen, Wendy Demandante",
    "Description": "I sense that many women are following an inner call to claim direct connection to divine presence and power. This paper looks at the ebb and flow of this movement through the author’s life, and the often overlooked examples of women in our history and scriptures that offer a great pattern for claiming authority that is greater than any given by men. How much of our hesitation to claim personal revelation comes from the divisive and limiting, but constantly repeated rhetoric of a few men? It is time to cut the cords that bind us to an altar built to the false Gods of our fathers.",
    "URL": "https://sunstonemagazine.com/audio/SL19333.mp3"
  },
  {
    "Audio": "SL19334",
    "Title": "Many Great and Important Things: The Doctrine of Continued Revelation Today",
    "Presenters": "Wendy Perry, Richie Wilcox",
    "Description": "One of the hallmark doctrines in Mormon theology is belief in the reality of direct and continuing revelation from God to his prophets. Whenever there has been an established “kingdom of God” on earth, we are taught to “follow the prophet” who is God’s mouthpiece. As LDS doctrines do change over time, how do we process changes policy/revelation that are tantamount to reversals? We are asked to manage our belief systems at a seemingly increasing rate. We will discuss timelines regarding significant doctrinal changes from the past, i.e., polygamy, race and priesthood, LGBT issues, as well as current changes and discuss options for a broad understanding based on historical context, and social psychology.",
    "URL": "https://sunstonemagazine.com/audio/SL19334.mp3"
  },
  {
    "Audio": "SL19335",
    "Title": "Essence of The Classic Yoga Scriptures: The Bhagavad Gita",
    "Presenters": "Philip McLemore, Jane Griffith",
    "Description": "The Bhagavad Gita (The Song of The Lord) is the most famous and influential Hindu scripture.  It was a source of inspiration for Albert Einstein. It was a handbook for Gandhi. It had a major influence on Ralph Waldo Emerson, who called it, “the first of books,” and Henry David Thoreau, who said, “In the morning I bathe my intellect in the stupendous and cosmogonical philosophy of the Bhagavad Gita; in comparison . . . our modern world and its literature seem puny and trivial.”  Join McLemore for exploration of the essential teachings of the Gita along with some comparisons and contrasts to Mormon philosophy and the teachings of Jesus.",
    "URL": "https://sunstonemagazine.com/audio/SL19335.mp3"
  },
  {
    "Audio": "SL19336",
    "Title": "The Role of Science in Spirituality",
    "Presenters": "Crystal Scott Ivie, Alice Fisher Roberts",
    "Description": "In the US, the number of people identifying with religion continues to increase. Even the LDS Church has experienced drastic changes to its core teachings in the last 5 years.  With the advent of science and technology, this trend is likely to only increase. Can a person be spiritual without ignoring all scientific thought?",
    "URL": "https://sunstonemagazine.com/audio/SL19336.mp3"
  },
  {
    "Audio": "SL19337",
    "Title": "The Relationship Between the LDS Church and the NAACP, 1918-2019",
    "Presenters": "Robert A Greenwell, Josh Allred",
    "Description": "This session is a discussion of the relationship between the NAACP and the LDS Church, which went through four phases: (1) the LDS Church being ignorant of the existence of the NAACP, (2) contention between the two organizations, (3) cautious recognition of the existence of the two organizations, and (4) friendly cooperation between the two organizations.",
    "URL": "https://sunstonemagazine.com/audio/SL19337.mp3"
  },
  {
    "Audio": "SL19338",
    "Title": "Toward an Inclusive Heaven",
    "Presenters": "Mette Harrison, Kalani Tonga",
    "Description": "What are some ways to think about how disabled, neuro atypical, mentally ill, nonbinary, transgender, gay/bi and others will manifest in the resurrection? Is a cured/fixed version the best we can offer? Who might be offended/hurt by this approach?",
    "URL": "https://sunstonemagazine.com/audio/SL19338.mp3"
  },
  {
    "Audio": "SL19342",
    "Title": "Meet the Women at the MTA",
    "Presenters": "Michaelann Gardner Bradley, Connie Packer, Wendy Smith, Silvia Smith, Lorie Winder Stromberg",
    "Description": "The quickly advancing rate of science and technology developments in our modern world has particularly interesting implications for women, gender, and gender roles. What does it mean to be a woman if babies can be born in artificial wombs or your gender expression can be enhanced or changed through hormones and other technology? How have “time saving” household technologies changed the balance of gender roles? In a world where women are often closed out of both STEM fields and religious authority, both critical influencers on society and daily life, how does Transhumanism help women claim their power and equality?",
    "URL": "https://sunstonemagazine.com/audio/SL19342.mp3"
  },
  {
    "Audio": "SL19343",
    "Title": "You're so Venn Pre-Show",
    "Presenters": "Jerilyn Hassell Pool, Emily Tucker",
    "Description": "You're so Venn Pre-Show",
    "URL": "https://sunstonemagazine.com/audio/SL19343.mp3"
  },
  {
    "Audio": "SL19351",
    "Title": "\"What the Second Coming Means to People Like Me\"",
    "Presenters": "Kim McCall, Alice Fisher Roberts",
    "Description": "In September of this year, after \"much anxious prayer,\" a bishopric member decided I would be the right person to speak on the theme of the Second Coming. There are 100 things I'd rather speak on, and 200 reasons I didn't really like this theme. But I decided I could find new ways to think about it and reimagine slightly what it was to address my fellow \"saints.\" After exploring honestly why I'm uncomfortable with this whole idea/doctrine, I consider what the Second Coming meant to earlier members of the faith and how I might share in that understanding. Most importantly, I try to explore what it might mean to believe deeply and powerfully in things you doubt are literally true.",
    "URL": "https://sunstonemagazine.com/audio/SL19351.mp3"
  },
  {
    "Audio": "SL19352",
    "Title": "The New God Argument",
    "Presenters": "Lincoln Cannon, Stephanie Griswold",
    "Description": "The New God Argument is a logical argument for faith in God. Given assumptions consistent with contemporary science and technological trends, the argument proves that if we trust in our own superhuman potential then we should also trust that superhumanity probably would be more compassionate than we are and created our world. Because a compassionate creator may qualify as God in some religions, trust in our own superhuman potential may entail faith in God, and atheism may entail distrust in our superhuman potential.",
    "URL": "https://sunstonemagazine.com/audio/SL19352.mp3"
  },
  {
    "Audio": "SL19353",
    "Title": "Community of Christ Meets Postmodernism",
    "Presenters": "Lachlan Mackay, Melvin Johnson",
    "Description": "The rapidly shifting religious landscape in North America and Western Europe has had a profound impact on Community of Christ. This paper explores the ways in which this faith with a future is navigating the challenging terrain.",
    "URL": "https://sunstonemagazine.com/audio/SL19353.mp3"
  },
  {
    "Audio": "SL19354",
    "Title": "Adult Refugee Entrepreneurs in Utah",
    "Presenters": "Jabra Ghneim, Richie Wilcox",
    "Description": "As an educational researcher and a Palestinian-American Mormon living in Utah, Ghneim will discuss whether Gordon B. Hinckley’s criteria of “friend, job, and nourishment by the word” can be the basis of a formula for refugee resettlement in a new place. Can we use it in whole or in part to make newcomers to the United States feel welcome and at home?. Second, how strongly does the Book of Mormon emphasize the Christian obligation to the stranger, and how pertinent is that message in the Trump era?",
    "URL": "https://sunstonemagazine.com/audio/SL19354.mp3"
  },
  {
    "Audio": "SL19355",
    "Title": "Finding Human Connection Post Mormonism",
    "Presenters": "Bill Reel, Blaire Ostler",
    "Description": "Humans have always sought out human connection. Belonging inside one’s tribe has always been a priority. This session will discuss the role that evolution has played in human survival and help deconstructed Mormons sense what it means to lean into human connection in a new way, where authenticity and vulnerability matter to a greater degree.",
    "URL": "https://sunstonemagazine.com/audio/SL19355.mp3"
  },
  {
    "Audio": "SL19356",
    "Title": "Tarot, Mormonism & The Fool’s Journey",
    "Presenters": "Sara Katherine Staheli Hanks, Joshua Baird, LaNeece Flamm",
    "Description": "The 22 Major Arcana cards of the Tarot represent the soul’s archetypal journey through life. These cards have a remarkable ability to illuminate reality, including iconic moments and figures in Mormon history, and to support spiritual growth. The core of this presentation will be an overview of the Major Arcana with commentary on the traditional Tarot, followed by how they relate—sometimes with remarkable coincidence—to significant events & individuals of early Mormon history, represented in Joshua’s depiction of the Tarot. Sara will also do a simple Tarot exercise for audience members and conclude with a daring reading for Mormonism as a whole.",
    "URL": "https://sunstonemagazine.com/audio/SL19356.mp3"
  },
  {
    "Audio": "SL19357",
    "Title": "Fostering and Maintaining Healthy Boundaries within a Mormon Construct",
    "Presenters": "Natasha Helfer Parker, Lisa Butterworth, Sara Hughes-Zabawa, Jana Spangler, Jennifer White, Becky Gomez",
    "Description": "Boundaries are the simple declaration of what you are comfortable with and what you are not comfortable with. Yet, fostering and maintaining healthy boundaries can be anything but simple, especially within a religious construct. This session brings together a panel of mental health professionals and wellness coaches from Symmetry Solutions, LLC to provide suggestions on creating healthy boundaries and to explore how to address the challenges you may be experiencing.",
    "URL": "https://sunstonemagazine.com/audio/SL19357.mp3"
  },
  {
    "Audio": "SL19358",
    "Title": "Panel Discussion: Mainstream Mormon Women Go Plural",
    "Presenters": "Kristen Draughon, Josh Allred",
    "Description": "This session features a panel of women who chose to leave mainstream Mormonism to live the polygamous lifestyle.  Panelists include the stars of a popular reality show and women from a variety of polygamous sects.\n\nThis is your chance to pick their brains on how and why each came to choose plural marriage, how their family and friends have been affected, and what the various benefits and challenges of the polygamous lifestyle are.",
    "URL": "https://sunstonemagazine.com/audio/SL19358.mp3"
  },
  {
    "Audio": "SL19361",
    "Title": "Book Review: Colleen McDannell and Sister Saints",
    "Presenters": "Colleen McDannell, Cristina Rosetti, Nadine McCombs Hansen",
    "Description": "Cristina Rosetti sits down with Dr. Colleen McDannell to talk about her new book, Sister Saints: Mormon Women Since the End of Polygamy. Dr. McDannell is the Sterling M. McMurrin Professor of Religious Studies at the University of Utah. Her research covers topics such as the history of Heaven, Vatican II, material culture, and now, Mormon women.",
    "URL": "https://sunstonemagazine.com/audio/SL19361.mp3"
  },
  {
    "Audio": "SL19362",
    "Title": "The Near and Distant Future of Faith",
    "Presenters": "Ben Blair, Michaelann Gardner Bradley, Carl Youngblood, Johnny Stephenson",
    "Description": "Traditional forms of faith drawing on divine authority claims, doctrinal certitudes, resistance to science, and detachment from “the world”, etc. are showing their wear. In the near term, if faith is to survive to rising generations in a meaningful way, it will likely need to be constituted differently, and draw its claim to authority and vitality from transformed and renewed sources. In the future, when humans have evolved beyond present conditions, or have realized visions such as a renewed world, immortality and eternal life (spoiler: these aren’t just religious visions anymore), traditional religious norms will have run their course. This session draws on Mormon and transhumanist themes to make portraits of near and distant futures of enduring faith.",
    "URL": "https://sunstonemagazine.com/audio/SL19362.mp3"
  },
  {
    "Audio": "SL19363",
    "Title": "Faith, Food, Culture and Science",
    "Presenters": "Zach Cordell, Kalani Tonga",
    "Description": "LDS members tend to put the primary focus on the Word of Wisdom when discussing nutrition in the Church community. In doing so, we may be missing the bigger impact that our faith can have on our dietary behaviors and overall health. But what happens when the current science doesn’t uphold revelation? How do we best care for our health, and why would God care about our lunch?",
    "URL": "https://sunstonemagazine.com/audio/SL19363.mp3"
  },
  {
    "Audio": "SL19364",
    "Title": "Evolution of the name of the Church; The Masonic Magic Mormon Connection",
    "Presenters": "Barbara Lewis Camp, H. Michael Marquardt, Clair Barrus, Roy Schmidt",
    "Description": "Over the years all branches of Mormonism have struggled with the name of their organization and how to adjust to change. The first paper examines the location of the first church meeting. It also follows the development of the three church names. The second paper examines the early relationship between Masonry and magic in American culture. The second paper examines the intersection of magic, masonry and early Mormonism -- with a close look at the Smith family magic parchments (Lamens) and the Faculty of Abrac.",
    "URL": "https://sunstonemagazine.com/audio/SL19364.mp3"
  },
  {
    "Audio": "SL19365",
    "Title": "The God-Image in Mormonism",
    "Presenters": "Landon Poppleton, Drew Ostler",
    "Description": "The image of god in Mormonism is not static, but an archetypal phenomenon that is revealing itself to us and transforming in an often unsettling way. This session will provide an intellectual understanding of the numinous experience of god (the mysterium tremendum et fascinans) as it relates to Mormonism. Specifically, how it promotes individuation from herd psychology and how becoming more of an individual allows one to connect with the transcendent and experience more cohesion in one’s culture.",
    "URL": "https://sunstonemagazine.com/audio/SL19365.mp3"
  },
  {
    "Audio": "SL19366",
    "Title": "Who Wears the Pants?",
    "Presenters": "Jennifer Crow, Nancy Ross",
    "Description": "Recently, the LDS Church changed the dress code for its female missionaries. This change was widely accepted by the Latter-day Saint community as a nod to the evolving views of its members and leaders. However, in 2012, Mormon feminists began a campaign called ‘Wear Pants to Church Day’ in an effort to normalize the wearing of pants to church services. Some participants in this ‘quiet protest’ reported that they were not well received in their congregations when breeching social norms of acceptable Sunday attire. In this session we will discuss the ways in which religion informs processes of social identification and community construction in the Latter-day Saint community.",
    "URL": "https://sunstonemagazine.com/audio/SL19366.mp3"
  },
  {
    "Audio": "SL19367",
    "Title": "All Are One in Christ: Transgender Spirituality and the Church",
    "Presenters": "Andy Winder, Mary Ann Clements",
    "Description": "When Dallin H. Oaks mentioned those who “confuse or alter gender” in his talk “Truth and the Plan” last October, many members interpreted his comments as condemning transgender members. But the history—and future—of gender variance in the LDS Church is as rich as it is a vital part of our community. Transgender members may have existed in the Church as early as the nineteenth-century, and their experience poses unique questions about what our doctrine means when it says that gender is eternal. This piece would highlight notable transgender Mormons in history as well as how teachings on gender identity have changed over time, as well as the unique perspectives transgender members bring to our community and the challenges they currently face.",
    "URL": "https://sunstonemagazine.com/audio/SL19367.mp3"
  },
  {
    "Audio": "SL19368",
    "Title": "The Plural Wives of John W. Woolley and Lorin C. Woolley  \nThe Interconnectedness of the Early Fundamentalists",
    "Presenters": "Marianne T. Watson, Craig L. Foster, Christopher C. Smith",
    "Description": "“The Plural Wives of John W. Woolley and Lorin C. Woolley,” by Marianne T. Watson. This paper will show there were more plural wives of both John and Lorin Woolley than previously known. They will be identified and discussed within the context of pre and post-Manifesto plural marriages. \n        \n\n“The Interconnectedness of the Early Fundamentalists,” by Craig L. Foster. Like early members of the LDS Church, early Fundamentalists took the good news of continued authority to marry plurally to fellow family members and friends. As fundamentalism grew, it did so among kith and kin until modern fundamentalism represents a large network of families. Examples from the book American Polygamy: A History of Fundamentalist Mormon Faith and other research will be given.",
    "URL": "https://sunstonemagazine.com/audio/SL19368.mp3"
  },
  {
    "Audio": "SL19371",
    "Title": "How Counterfeiting, Anti-Masonic Sentiment, and the Second Great Awakening Affected Joseph Smith's Religion",
    "Presenters": "Kathleen Kimball Melonakos, Emily Tucker",
    "Description": "Evidence suggests that the Joseph Smith family was involved in counterfeiting long before the Book of Mormon emerged. Therefore, what was Joseph Smith's relationship to the Christian society around him? Since the Christian Second Awakening and the Anti-Masonic movement were both in full swing, what might be Joseph's reasons for creating the Christian/Masonic syncretism that is Mormonism?  If we understand the past we can chart a better future.",
    "URL": "https://sunstonemagazine.com/audio/SL19371.mp3"
  },
  {
    "Audio": "SL19372",
    "Title": "How Families Will Find Purpose and Values in Tomorrow’s Religious Landscape",
    "Presenters": "Jon Ogden, Becca Ogden, Alice Fisher Roberts",
    "Description": "The role of traditional religion is changing as more people leave and carve their own paths. How can we transcend harmful religious traditions while still including some of the values and sense of purpose that religion can bring? Join us to explore how to create hope for the future.",
    "URL": "https://sunstonemagazine.com/audio/SL19372.mp3"
  },
  {
    "Audio": "SL19373",
    "Title": "Prophet for a Day: A panel presented by the Truth & Transparency Foundation",
    "Presenters": "Blaire Ostler, Mark Pugsley, Ethan Gregory Dodge, Ben Shaffer, Joanna Smith",
    "Description": "If you could be prophet of the LDS Church for a day, what would you change? In this session, we’ll ask three different panelists, all from different walks of life, this question. Each panelist will outline their changes and address potential concerns from the moderator. The proposed changes will all be rooted in each panelist’s expertise and the moderator will concentrate on how the ideas could affect overall retention. The remaining portion will be given to the audience to ask questions and raise concerns. Join us in a light-hearted discussion as we explore effective change to the policies and doctrines of Mormonism’s most influential organization.",
    "URL": "https://sunstonemagazine.com/audio/SL19373.mp3"
  },
  {
    "Audio": "SL19374",
    "Title": "Evolving Faith: Building More Stately Spiritual Mansions",
    "Presenters": "Gloria Rees, John Kesler, Thomas McConkie, Lorie Winder Stromberg",
    "Description": "Jesus taught in parables so people at different levels of spiritual openness and preparedness could expand their vision—from where Christ found them to where he called them to move. We do not go lock-step into heaven; rather, each of us goes according to the light and love we choose to live by. This session emphasizes the democracy of salvation, suggesting that we all have the choice of evolving to higher states of consciousness and intelligence. It also presents ways of seeing oneself and others where they are, and focuses on individual and organizational evolution.",
    "URL": "https://sunstonemagazine.com/audio/SL19374.mp3"
  },
  {
    "Audio": "SL19375",
    "Title": "The Difficulties and Joys of “Inner Work”",
    "Presenters": "Mark Crego, Susan Hinckley, Dan Wotherspoon, Sara McCausland, Sara McCausland",
    "Description": "In this session, leaders of the Faith Journey Foundation, the non-profit organization that manages and facilitates Latter-day Faith and several other podcasts, will share their reflections on their attempts to walk the challenging but rewarding path of spiritual development (“inner work”) that involves entirely changing how we approach life, hold our beliefs, interact with others, and understand God and ourselves. Inner work is difficult, but as we pursue it we are opened to joys that at one time we could not even imagine as possibilities.",
    "URL": "https://sunstonemagazine.com/audio/SL19375.mp3"
  },
  {
    "Audio": "SL19376",
    "Title": "Can We Talk About It Now: Sacred Symbols or Ritual Dissonance.",
    "Presenters": "Jody England Hansen, Stephanie Griswold",
    "Description": "The recent changes in the temple ceremonies included language that many had asked and hoped for. They also included changes that are upsetting. \nNearly everyday since January 1st, someone has called me trying to process the trauma that has surfaced for them. They are wondering about the different language for the covenants they made. They wonder why they are still feeling diminished even though the language is now more equitable. Some are wondering why there is such a firm instruction to not talk about this, at a time when they want to talk about the temple experience more than ever. \nI came from a background where much of the the temple experience was discussed in most settings at home and church, honoring the few parts that are only for a temple setting. I think we can honor each other, and honor the ritual, in learning to do so again. \nI will speak of possible ways to own your symbolic journey while acknowledging the dissonance that comes from attaching a literal truth to a figurative ritual. \nI will show images of sites from Egypt that reinforced the universal power of ritual for me.\nAnd this will be a place we can talk about it.",
    "URL": "https://sunstonemagazine.com/audio/SL19376.mp3"
  },
  {
    "Audio": "SL19377",
    "Title": "Post-Mormons with Carpal Tunnel: Writing the Way Out",
    "Presenters": "Mette Harrison, Timothy Liu, Dayna Patterson, Allie Spikes, Christina Stoddard, \nPaula Baker",
    "Description": "Leaving Mormonism can be an excruciating process with heaps of emotional, social, and psychological backlash. In this session, a distinguished group of post-Mormon writers will share excerpts of their exit narratives and poetry. They will discuss the role writing has played, and continues to play, in their faith transitions.",
    "URL": "https://sunstonemagazine.com/audio/SL19377.mp3"
  },
  {
    "Audio": "SL19378",
    "Title": "Ask a Sex Therapist",
    "Presenters": "Natasha Helfer Parker, Becky Gomez",
    "Description": "Come enjoy a candid Q&A where any question is welcome. This has been a well attended session in the past where sexual topics can be broached in a sex-positive, evidence-based, and humorous approach. Coming from a culture where sexuality can be treated in rigid ways, it can be healing to have safe spaces to talk openly about questions and concerns.",
    "URL": "https://sunstonemagazine.com/audio/SL19378.mp3"
  }
]
