[
  {
    "Audio": "SL17091",
    "Title": "Smith-Pettit Lecture",
    "Presenters": "Melissa Harris-Perry",
    "Description": "The Smith-Pettit lecture is free and open to the public, thanks to a generous grant from the Smith-Pettit foundation. To get a ticket, you just need to arrive early to get a seat. We are only seating for 300. There will be overflow seating available where the presentation can be viewed via live stream. Doors will open at 5:00 pm.\r\n\r\nThe lecture will be held in the central ballroom of the University of Utah Olpin Student Union building, located at 200 S Central Campus Dr., Salt Lake City, UT 84112. It will begin promptly at 7:00 pm and go until 8:00 pm. Cameras will not be allowed during the lecture.\r\n\r\nYou will need to register to attend the rest of the conference. You can register for the entire conference here.",
    "URL": "",
    "Session ID": 91
  },
  {
    "Audio": "SL17102",
    "Title": "Sunstone Art Show",
    "Presenters": "Leslie O. Peterson, Amy Rich",
    "Description": "Brigham's 56 Wives: An Art Experience",
    "URL": "",
    "Session ID": 102
  },
  {
    "Audio": "SL17111",
    "Title": "The Banality of Progress",
    "Presenters": "Mehrsa Baradaran",
    "Description": "This presentation will: 1. Think through the complex and conflicting trifecta of identity, politics, and activism. 2. Help to shed some misconceptions about identity so that we can more effectively fight against injustice.",
    "URL": "",
    "Session ID": 111
  },
  {
    "Audio": "SL17112",
    "Title": "From Surviving to Thriving: Learning How to \"Do\" Church as an Adventurous Mormon",
    "Presenters": "Dan Wotherspoon\n Boyd J. Petersen",
    "Description": "Early on in a faith shift, most of us begin to feel less comfortable at church, sure that we’re the only one thinking (what seem to be) bigger thoughts about the topics at hand, or frustrated at appeals to authority instead of genuine engagement. “Where’s the growth?” “Where’s the curiosity?”, we wonder. Experiences like these can change, however, and church can once again become a rich experience, even enjoyable. In this session, two veterans of Mormon faith shifts share a few of their secrets to once more “thrive” at church. And they want to hear yours, too! This session will feature a vigorous discussion.",
    "URL": "",
    "Session ID": 112
  },
  {
    "Audio": "SL17121",
    "Title": "The Wicked Son: My Father Is Warren Jeffs",
    "Presenters": "Roy Jeffs",
    "Description": "Roy Jeffs is the son of the infamous FLDS prophet Warren Jeffs. Join him as he shares his harrowing story of shame, escape, and resiliency.",
    "URL": "",
    "Session ID": 121
  },
  {
    "Audio": "SL17122",
    "Title": "The November 2015 Policy Change in Light of Matthew 25",
    "Presenters": "Bob Rees\nWilliam S. Bradshaw\nBerta Marquez",
    "Description": "Jesus used the parable of the sheep and goats to call his followers to look upon those we consider “the least” as if they were him. This session looks at the Church’s November 2015 policy change in regard to married gay and lesbian parents and their children in light of this parable. It will include personal stories by families affected by the policy change.\n",
    "URL": "",
    "Session ID": 122
  },
  {
    "Audio": "SL17124",
    "Title": "In Christ: Mormonism and the Paradox of NonDuality",
    "Presenters": "Philip McLemore",
    "Description": "NonDuality is a concept used to describe the mystery of existence and being and of one’s conscious relationship with and in God. Is there a place for nondual understandings within Mormonism, which is arguably one of the most dualistic religions on the planet? Is it possible that the scriptural expressions, “I shall know...as…I am known” and “Abide in me and I in you” point to nonfual realities that have the power to transform individuals into a Christlike nature and the body of Latter-day Saints into a more spiritually rich community?",
    "URL": "",
    "Session ID": 124
  },
  {
    "Audio": "SL17125",
    "Title": "Mountain Running, Mormonism, and a Pathway to Spirituality",
    "Presenters": "Jay Griffith \n Jedediah Rogers",
    "Description": "Ultrarunning, especially in the mountains, often takes on spiritual and religious dimensions: sacrificing the body and pushing beyond one's natural limits to experience transcendence. In this session, two ultra runners—one in his thirties and one in his late fifties—will share their experience of conversing with God through this sport, placing it in the context of Mormonism and its unique concepts of spirit, body, creation, and nature. The session includes a viewing of the 9-minute documentary \"Holy.\"",
    "URL": "",
    "Session ID": 124
  },
  {
    "Audio": "SL17126",
    "Title": "Mormon Socialization, Women’s Education, and Online Support Groups",
    "Presenters": "Danielle Briggs Christensen",
    "Description": "In contrast to national trends, women in Mormon-dominated Utah attain college degrees at a much lower rate than men, reporting that they value some college experience but not necessarily graduation. This session presents findings from a study focussing on an online support group (OSG) for Mormon women pursuing a college degree. The OSG provided academic assistance, emotional support, and a sense of community—the women developing a set of cultural norms adapted to their aspirations, mitigating Mormon culture’s impact.",
    "URL": "",
    "Session ID": 126
  },
  {
    "Audio": "SL17131",
    "Title": "It's the End of the World as We Know It",
    "Presenters": "Jody England Hansen\n",
    "Description": "\nAt a recent Mormon Women’s Retreat, I was asked what I felt to be the greatest problem or challenge facing the Church today. My thoughts on this go beyond policy, doctrine, and politics. In this presentation, I approach this challenge with a single question: \"Is changing the way we live in the world more frightening than global destruction?\" I will discuss what it might take to save the world, or the church, or just ourselves.",
    "URL": "",
    "Session ID": 131
  },
  {
    "Audio": "SL17132",
    "Title": "Rejecting Dogma By Embracing Paradox",
    "Presenters": "Jonathan Aderhold\n\nCo-author: Joshua Neal (will be unable to attend this year)",
    "Description": "Christ focused his teachings on subverting the letter of the law in order to pursue its spirit. In other words, he pointed us away from the known toward the unknown. Mormonism has evolved into a rigid and dogmatic group dominated by authority. Its members frequently focus on the importance of ideology, often leading them toward moral stagnation and a disregard of others. In this session, we’ll explore how embracing paradox and the incomprehensible can allow us to reorient our spirituality to be more in line with Christ’s teachings.",
    "URL": "",
    "Session ID": 132
  },
  {
    "Audio": "SL17133",
    "Title": "Old Gay Mormons",
    "Presenters": "Dallin J. Phillips",
    "Description": "This presentation is an honest, candid look at the life of a gay/bisexual man who grew up in the 60's, and the unique pleasures and frustrations that attend being an older gay man today.",
    "URL": "",
    "Session ID": 133
  },
  {
    "Audio": "SL17134",
    "Title": "Embracing All Genders: Clashes Between Mormonism and the Science of Gender Identity",
    "Presenters": "Emily Mackelprang",
    "Description": "This presentation provides information about the science of gender identity by: 1) Defining gender-relevant terminology; 2) Providing education about sex and gender—using intersexuality to illustrate the false dichotomies often associated with these terms—and, 3) Discussing what scientific research tells us about gender and gender identity. The presenter will then facilitate a conversation regarding the clash between scientific and Mormon views of sex and gender, exploring potential paths toward understanding and reconciliation.",
    "URL": "",
    "Session ID": 134
  },
  {
    "Audio": "SL17135",
    "Title": "The LORD's House in the Top of the Mountains: The Diverse Mormon Readings of Isaiah 2:2",
    "Presenters": "\nMark Thomas",
    "Description": "Isaiah 2 is one of the most famous chapters in the Hebrew Bible. The establishment of House of God in the last days, the peaceful gathering of all nations, and the beating of swords into plowshares have influenced western religion, prophecy, and art for thousands of years. The chapter is also central to the history of Mormonism. This session will examine the setting and authorial intent of the passage as well as the long and varied history and mythology of Mormon readings of the chapter.",
    "URL": "",
    "Session ID": 135
  },
  {
    "Audio": "SL17136",
    "Title": "An \"Anthropic\" Theodicy:  Where There Is a Loving, All-powerful God, Must the Natural World Be as Violently Destructive of Life as Our World Is?",
    "Presenters": "David D. Allred\nLex Newman",
    "Description": "Natural disasters such as earthquakes spread misery, especially affecting the most vulnerable. How God allows this to happen remains a major obstacle to people’s faith. Could it be these are a necessary part in keeping a planet like the earth habitable?\nThis presentation will explore the following argument: \n1. Humans with rational free agency can exist only in a law-governed universe where the behavior of physical objects is predictable.\n2. In law-governed universes, only planets with plate tectonics can support advanced animal life (including humans). \n3. Therefore, humans with rational free agency can exist only on planets with plate tectonics.\n",
    "URL": "",
    "Session ID": 136
  },
  {
    "Audio": "SL17142",
    "Title": "Lunch Presentation: Mormon Food Studies in Trump’s America",
    "Presenters": "Jerilyn Hassell Pool",
    "Description": "In the four years of food studies at Sunstone, food trends have never been studied so vigorously and in-depth as they have in the last year. How has the election changed the food patterns of Mormons? How many more bags of Cheetos have been consumed in Utah County alone? And what about the food habits of famous Mormons? Brace yourself, the alternative facts are coming and they aren’t pretty.",
    "URL": "",
    "Session ID": 142
  },
  {
    "Audio": "SL17151",
    "Title": "Contemplations on a Mormon Intrafaith Marriage",
    "Presenters": "Nathan McCluskey\nGina Colvin",
    "Description": "In this session, Nathan McCluskey and Gina Colvin will reflect on 24 years of their Mormon marriage where some of their most persistent conflicts have been over levels of religious observance.  Without any guarantees or assurances, they will discuss their past and current conflicts, negotiations, and resolutions as they decide how to manage their intrafaith future as a couple and family.",
    "URL": "",
    "Session ID": 151
  },
  {
    "Audio": "SL17152",
    "Title": "The Ghost of Eternal Polygamy One Year Later: A Report",
    "Presenters": "Carol Lynn Pearson\nJeralee Henderson Renshaw\nJay Griffith\nJane Griffith",
    "Description": "Author Carol Lynn Pearson and several women and men whose lives have been impacted by her book The Ghost of Eternal Polygamy take a look at the first year in the life of a book that, in the words of Greg Prince, could “cause a shift in the way the institutional church views itself.”",
    "URL": "",
    "Session ID": 152
  },
  {
    "Audio": "SL17153",
    "Title": "Continuity and Change in Temple Worship",
    "Presenters": "Benjamin Shaffer\nDavid Patrick ",
    "Description": "The history of LDS temple theology and practice has undergone three distinct phases: \n1) \"Development.\" From 1836–1917 temple theology and practice evolved and became standardized.\n2) \"Stability, Maturity, and Expansion.\"  From 1919–1975 a consistent temple theology and practice was integrated into LDS culture worldwide.\n3) \"Revision and Change.\" From 1975–Present major changes in temple practice and theology occurred every decade. \nThis session will explore the historical context and stated reasons for these periods of change, as well as their impact on LDS theology and culture. Perspectives will include both LDS and \"fundamentalist\" viewpoints.\n",
    "URL": "",
    "Session ID": 153
  },
  {
    "Audio": "SL17154",
    "Title": "Finding Faith and Virtue in Resistance",
    "Presenters": "Bryndis Roberts\nLorie Winder Stromberg\nMark Barnes\n",
    "Description": "From its inception, members of Ordain Women have engaged in faithful agitation for gender equality. In response, some LDS Church leaders have characterized them as neither faithful nor virtuous. A few church leaders have even imposed ecclesiastical discipline on Ordain Women supporters and board members. Despite this, Ordain Women believes that true faithfulness and virtue can be found in the questioning of and even resistance to church policies, practices, and procedures that result in inequity, marginalization, and exclusion.",
    "URL": "",
    "Session ID": 154
  },
  {
    "Audio": "SL17155",
    "Title": "Bridgewalker: Spirituality in the Poetry of Linda Sillitoe",
    "Presenters": "Cynthia Sillitoe",
    "Description": "This session explores the role of spirituality in the poetry of the presenter's mother, Linda Sillitoe, as she moved from Mormon to non-Mormon and embraced universal themes in the culture of her birth and others. The main source for interpretation will be her collections \"Crazy For Living,\" and the forthcoming \"Owning The Moon.\"",
    "URL": "",
    "Session ID": 155
  },
  {
    "Audio": "SL17156",
    "Title": "The Moral and Spiritual Case for Cannabis",
    "Presenters": "Andrew Jolley\n Emilie Campbell\n Ryan McKnightl",
    "Description": "The legalization of marijuana and other cannabis-related substances have long been a source of moral and medical controversy. This panel will make a case for why allowing research and use of the drug is a moral imperative.",
    "URL": "",
    "Session ID": 156
  },
  {
    "Audio": "SL17157",
    "Title": "The Witch Doctor in the Sky: The Acholi, Mormonism, and Mental Health",
    "Presenters": "Marie Blanchard",
    "Description": "During a one-year volunteer position with THRIVEGulu, an NGO with a mission of healing trauma in victims of the 20+ year war in Northern Uganda, this presenter lived among three cultures, the LDS culture, the Western mental health culture, and the Acholi culture. The interplay, clashes, connections, and confusions among these three cultures highlight the challenge of preserving core values in a diverse context.",
    "URL": "",
    "Session ID": 157
  },
  {
    "Audio": "SL17161",
    "Title": "Damned by the Courts: The Conflation of Church Discipline with the Criminal Justice System",
    "Presenters": "Ian Thomson",
    "Description": "Sometimes aspects of church discipline are determined not by one's religious leaders, but by the criminal court system. This can introduce inequities into a system that should be designed to help heal and redeem. This presentation will examine relevant differences across jurisdictions and use real-life anecdotes to show circumstances under which an overreliance on the criminal justice system can impede access to the benefits of full church participation.",
    "URL": "",
    "Session ID": 161
  },
  {
    "Audio": "SL17162",
    "Title": "Discussion Group: Having Conversations About Faith With Those You Disagree With",
    "Presenters": "Josh Weed\nLolly Weed",
    "Description": "This interactive discussion group will allow attendees to discuss with one another strategies on how to have conversations about faith with people they disagree with.",
    "URL": "",
    "Session ID": 162
  },
  {
    "Audio": "SL17164",
    "Title": "The Wages of Sin is Death: HIV/AIDS in Utah",
    "Presenters": "J. Seth Anderson",
    "Description": "The Utah Department of Health confirmed the first cases of AIDS in 1983 and began compiling statistics on the disease that year. How did gay and lesbian activists in Utah respond to the new and deadly disease? What did religious communities in Utah think about the disease and what, if any, support did they offer? How did the state health department respond to its responsibility to treat those who had become infected and what did it do to prevent the spread of the disease? This presentation describes where people with AIDS in Utah sought care, and examines the “Common Law Marriage Act” passed by the Utah legislature in 1987, the first piece of legislation to address the AIDS epidemic. How does the presupposition that moral unworthiness warrants death continue to permeate contemporary political and religious cultures?",
    "URL": "",
    "Session ID": 164
  },
  {
    "Audio": "SL17165",
    "Title": "Learning to Breathe After the Death of a Child",
    "Presenters": "Doe Daughtery \nReva Beth Rullell\nPatrick Bryson",
    "Description": "How does the LDS culture respond when the death of a child occurs? What could we do to be more helpful? Three parents will tell their stories of losing a child and the path their grief took.",
    "URL": "",
    "Session ID": 165
  },
  {
    "Audio": "SL17166",
    "Title": "Teach from the Little Box: Blurring the Lines between Mainstream Christianity and Mormonism",
    "Presenters": "Ian R. Harvey\n",
    "Description": "If you ask Mormons if we should always believe God and always disbelieve Lucifer, they will say yes. However, in the story of the Fall, we are supposed to believe Lucifer and not God. This presentation examines this oddity and proposes that we've been misinterpreting this story for a long time. What happens when we decide to believe God instead?",
    "URL": "",
    "Session ID": 166
  },
  {
    "Audio": "SL17167",
    "Title": "The Kingdom Embraces All",
    "Presenters": "Robert Kimball Shinkoskey",
    "Description": "The \"kingdom\" concept in Mormon theology has narrowed over the 170 years since pioneer settlement in Utah. The law book used by the first government in Utah, The Laws of the State of Deseret, consisted of the Ten Commandments alone. The Decalogue was understood to be a constitutional law document that embraced the hopes and aspirations of every portion of that early society. Today the Church tends to view the \"kingdom\" as the membership of the church. Modern scholarship demonstrates that ancient Israel understood the Decalogue the way early Utahns did.",
    "URL": "",
    "Session ID": 167
  },
  {
    "Audio": "SL17171",
    "Title": "An Introduction to MormonLeaks",
    "Presenters": "Ryan McKnight\n",
    "Description": "MormonLeaks was founded in December of 2015 by Ryan McKnight as he gathered Mormon-related leaks and assembled a team to create and operate the website. What is the process behind gathering the leaks? How does the website work? How did each team member get involved, and what are their roles?",
    "URL": "",
    "Session ID": 171
  },
  {
    "Audio": "SL17172",
    "Title": "Extraordinary Ordinary Women",
    "Presenters": "Janice Allred\nMargaret Toscano\nGina Colvin\nVickie Eastman",
    "Description": "Laurel Thatcher Ulrich's well-known aphorism, \"Well-behaved women seldom make history,\" was initially meant not to call attention to the importance of unconventional women's lives, but to the importance of ordinary women's lives. This panel will explore the lives of women, both ordinary and extraordinary, that help us better understand our past, give us insights into our own lives, and expand our own possibilities.",
    "URL": "",
    "Session ID": 172
  },
  {
    "Audio": "SL17173",
    "Title": "Transitioning with Teens",
    "Presenters": "Sheyenne Alvarez\nMark Whitley\nJessica Whitley",
    "Description": "Transitioning away from the LDS Church comes with many complications and difficulties. Relationships between parents and teens are already complex, and transitioning introduces additional issues that must be navigated to preserve relationships. This panel is made up of parents who have transitioned from the Church with teens; they will address issues that have presented themselves and strategies that have, or have not, helped the family keep its relationship intact.",
    "URL": "",
    "Session ID": 173
  },
  {
    "Audio": "SL17174",
    "Title": "Helping the FLDS in Crisis: What One Outsider Never Expected to Find Behind the FLDS Walls",
    "Presenters": "Christine Marie Katas",
    "Description": "Unlike traditional psychology, positive psychology is the study of mental wellness - what people do right, how to increase happiness, what helps communities flourish. This presenter moved to Hildale, Utah, expecting to find the sad and dangerous culture represented in the media. Instead she found mothers and children playing in the parks while in desperate need of humanitarian help. This session explores the current FLDS crisis, and how positive psychology constructs such as courage, resilience, life meaning, and strength of belief underscore why thousands of FLDS have chosen to remain faithful. This session will also reveal unexpected breakthroughs within the reclusive FLDS community during this time of transition, and what outsiders like you can do to help.\n\n",
    "URL": "",
    "Session ID": 174
  },
  {
    "Audio": "SL17175",
    "Title": "Mormon Women and Alternative Spiritual Practices",
    "Presenters": "Cristina Rosetti\n Doe Daughtrey",
    "Description": "In recognition of the gendered nature of spiritual authority within institutional Mormonism, many Mormon women have sought increased representation by seeking female ordination and encouraging further discussion of the divine feminine. Outside of institutional channels, many have also begun to look toward alternative practices to harness the power of God in their lives. These practices include immersion ceremonies, blessings, and devotion to Heavenly Mother. Using ethnographic methodologies, this paper seeks to understand the nature of these practices and the continued invocation of women’s historic spiritual authority in the lives on contemporary Mormons.",
    "URL": "",
    "Session ID": 175
  },
  {
    "Audio": "SL17191",
    "Title": "Evening Devotional: Sacred Space and Spiritual Practice",
    "Presenters": "Gina Colvin\nMaxine Hanks",
    "Description": "Feminist theologians Gina and Maxine invite participants to enter sacred space and experience spiritual practice through liturgy, chant,  contemplative prayer, and the holy day of Mary Magdalene.",
    "URL": "",
    "Session ID": 191
  },
  {
    "Audio": "SL17201",
    "Title": "It Was the Worst of Times; It Was the Best of Times: Finding God in the Wound",
    "Presenters": "Jody England Hansen",
    "Description": "This has been a terrible year. And it has been a glorious year. I want growth, wisdom, and knowledge, but I don’t always like what it takes to get them. Pain and joy coexist in the extremes of personal, spiritual, and community life. Where do we find the truth Joseph promised in proving contraries? This presentation shares a journey of learning to embrace a new level of opposition.",
    "URL": "",
    "Session ID": 201
  },
  {
    "Audio": "SL17211",
    "Title": "Meaning for All?: Identity Theory and Mormon Elasticity",
    "Presenters": "Adam J. Powell",
    "Description": "Drawing on my work as a non-Mormon academic in the social-scientific study of religion, this presentation offers a bio-cultural look at religious identity and the aspects of Mormonism which have supported the conferral of such an identity on its members. I will discuss the neuropsychological as well as sociological ways in which religious identity is emotion-laden and dependent on institutional elasticity for sustained salience before finally highlighting some of the challenges this poses for those involved in Mormonism’s exclusivism/inclusivism negotiations.",
    "URL": "",
    "Session ID": 211
  },
  {
    "Audio": "SL17212",
    "Title": "Mormonism and the Limits of Political Neutrality",
    "Presenters": "Kelsy Hillesheim",
    "Description": "Though the LDS Church claims political neutrality, this has not necessarily been the case in practice. Taking a case study approach, this presentation argues that the institutional LDS Church did indeed influence the political sphere in the 20th and 21st centuries through its involvement with the Equal Rights Amendment, Proposition 8, and the October 2016 MormonLeaks tapes.",
    "URL": "",
    "Session ID": 212
  },
  {
    "Audio": "SL17213",
    "Title": "Black Mormon Women from Baltimore: What They Have Taught Me about Race and Faith",
    "Presenters": "Laura Rutter Strickling",
    "Description": "While Black women have inherited the worst of racism over the decades and might be characterized as \"the least of these my sisters,\" Black Mormon women have also had to reconcile their membership in a historically White church that had at one time withdrawn access to spiritually emancipitory temple ordinances. This inquiry into the gendered, racialized conversion of sixteen Black Mormon women from Baltimore seeks to overturn the conceptualization that \"the least of these\" are somehow deficit and draws on W.E.B. Dubois, \"We who are dark can see [spiritual things] in a way that White [Mormons] cannot.\"",
    "URL": "",
    "Session ID": 213
  },
  {
    "Audio": "SL17214",
    "Title": "The Agency Blueprint vs. The Doctrine of Privation",
    "Presenters": "Ian R. Harvey",
    "Description": "“As man is, God once was; as God is, man may become.” Mormons: we almost got it right: but that statement only applied in Eden prior to the Fall. Other Christians: you mostly got it right. God was/is ever righteous from eternity to eternity.\n        Maybe we sould rewrite that couplet to say: “As man chose, God for us weeps; as God is, man may still choose to become.”",
    "URL": "",
    "Session ID": 214
  },
  {
    "Audio": "SL17215",
    "Title": "Priestess unto the Most High God",
    "Presenters": "Edward Bailey",
    "Description": "For many women in the church, the potential to receive an endowment of power and authority from on High is a beautiful blessing. However, the current temple blessing defers to antiquated gender positioning in which a husband rules over his wife and posterity. However, there are a number of sources, including Heber and Vilate Kimball, Phinehas Richards, John Taylor, Eliza R. Snow, and some 20th-century prophets and apostles that point toward the glory of the original promise to become hereafter priests and “priestesses unto the Most High God.”",
    "URL": "",
    "Session ID": 215
  },
  {
    "Audio": "SL17216",
    "Title": "The Mormon Suicide Epidemic in Light of Matthew 25",
    "Presenters": "\n\n Bob Rees\n John Gustav-Wrathall\nTaryn Aiken Hiatt",
    "Description": "This panel will discuss the youth LGBT suicide epidemic and how we can look to the scriptures for guidance and solutions.",
    "URL": "",
    "Session ID": 216
  },
  {
    "Audio": "SL17217",
    "Title": "Epistemological Guardianship: The Importance of How We Know What We Know",
    "Presenters": "Mithryn (A.K.A. Kenneth Lines)",
    "Description": "I know the Church is true is a very loaded statement. With over 13 years of professional experience working with data, Mithryn is very familiar with executives who claim to \"know\" things that turn out not to be true. This presentation has been given professionally to discuss the concept of \"how we know what we know\" in a business setting and to help individuals consider what counts as \"knowledge\" and how to guard that precious kernal that drives business or individual action—what we \"know\" to be true.",
    "URL": "",
    "Session ID": 217
  },
  {
    "Audio": "SL17218",
    "Title": "Fundamentalist Missionary Work",
    "Presenters": "Michael Peterson\n Betty Amrine\nAlice Lovassen\nDana Peterson\n Atrayu Pickering\n Joseph Wright\nJonathan Olsen\nEthan Patrick",
    "Description": "The panel will share the challenges, experiences, perspectives and success that fundamentalist missionaries have. Likewise they will share the experience of converts and why they accepted the message of Christ Church. They will also include a brief history of the formation of Christ's Church.",
    "URL": "",
    "Session ID": 218
  },
  {
    "Audio": "SL17221",
    "Title": "Joseph Didn’t Set Out to Start a Church (Let Alone a New Religion!)",
    "Presenters": "Christopher C. Smith\n",
    "Description": "When Oliver Cowdery showed up in Palmyra with “fire in his bones” and the idea to start a new church, Joseph Smith initially resisted the idea. Even after Cowdery persuaded him, Smith thought he would get it started and then give up his leadership and pass the baton to others. Gradually he changed his mind. David Whitmer apostatized partly in reaction to Smith’s growing sense of ownership of the movement. In addition to identifying how Mormonism became a church, this paper will identify the moment when it became in some meaningful sense an entirely new religion.",
    "URL": "",
    "Session ID": 221
  },
  {
    "Audio": "SL17222",
    "Title": "Rise Strong After Divorce",
    "Presenters": "Elizabeth A. Dalton",
    "Description": "Divorce affects over 50% of families in the Mormon community. The resulting trauma quickly buries family members in a swamp of shame and loss. It is possible to rise strong and wise after divorce and learn new \"mountain climbing\" skills. How can individuals reach out and assist others in this climb toward healing and growth? Family mediator Elizabeth Dalton will share trail wisdom gained over 25 years of guiding families after divorce.\\",
    "URL": "",
    "Session ID": 222
  },
  {
    "Audio": "SL17223",
    "Title": "Your Spiritual Journey is Trying to Eat You!: A New Way to Tell Your Journey",
    "Presenters": "Stephen Carter",
    "Description": "Stories tell people; not the other way around. And it’s the same with spiritual journeys. How much of your spiritual journey is you, and how much of it is the force of a story? This presentation will analyze how spiritual journeys are usually told and how those kinds of stories can constrain our growth. Then it will offer a new, more expansive way to tell them, complete with tips and tricks for getting started. \n",
    "URL": "",
    "Session ID": 223
  },
  {
    "Audio": "SL17224",
    "Title": "The Religion of Dieting: \nHow an Increasingly Secular Society Is Embracing \nDieting Dogma",
    "Presenters": "Paige Smathers",
    "Description": "Many people who are pursuing health believe the only way to do it is to be restrictive and rigid with their eating. This talk will provide practical advice from a registered dietitian nutritionist about how to recognize dieting dogma in our culture and how to not let healthy eating become a religious, all-or-nothing pursuit. Learning to love your body and not trying to manipulate it through diets is a radical act of self-care.",
    "URL": "",
    "Session ID": 224
  },
  {
    "Audio": "SL17225",
    "Title": "Atonement Talk in Mormonism",
    "Presenters": "Billy Phillips\nJim Smithson\n Lisa Tensmeyer Hansen",
    "Description": "Since there isn't an official LDS consensus on how the Atonement works, various ideas emphasizing substitution or satisfaction theories are bandied about in Sunday lessons as well as theories of how one might \"qualify\" for the Atonement. But can we transcend this type of discussion to speak of it in deeper, more empowering ways? Can we find better framings, better stories? This session features people who believe so, and who are excited to share some more constructive ways to think and talk about Atonement.",
    "URL": "",
    "Session ID": 225
  },
  {
    "Audio": "SL17226",
    "Title": "Genealogy: Melaninated Style",
    "Presenters": "Bryndis Roberts",
    "Description": "For LDS Church members who are more melaninated than others, family history can be extremely daunting: colonization, forced migration, and (for many of African descent) slavery have had a devastating impact on records about our ancestors. This session presents tips and strategies for overcoming such obstacles.",
    "URL": "",
    "Session ID": 226
  },
  {
    "Audio": "SL17227",
    "Title": "They, Them, Their: Seeing God on the Spectrum",
    "Presenters": "Jody England Hansen",
    "Description": "Much of the world has created God to fit into a binary concept of gender—either male or female. This session explores how God could present across the gender spectrum, displaying traits such as being nurturing, life-giving, strong, compassionate, weeping, and the qualities of the priesthood described in Section 121. Could focusing on the qualities we ascribe to God, rather than gender, help us to move beyond the narrow, binary gender roles that have become prevalent in Mormon discourse?",
    "URL": "",
    "Session ID": 227
  },
  {
    "Audio": "SL17228",
    "Title": "[My] feelings... I should not dare to reveal”: The Personality of Joseph Smith \tRonald O. Barney",
    "Presenters": "",
    "Description": "",
    "URL": "",
    "Session ID": 228
  },
  {
    "Audio": "SL17229",
    "Title": "How Compassion Can Heal Polygamist Communities",
    "Presenters": "Lawrence Barlow\nShirlee Draper",
    "Description": "Many fundamentalist communities lack access to resources to adequately deal with abuse. This is largely due to the fact that their communities are already marginalized because of their lifestyle. This panel will discuss how \"outsiders\" can help heal these communities by bridging the gap of understanding with compassion.",
    "URL": "",
    "Session ID": 229
  },
  {
    "Audio": "SL17231",
    "Title": "Joseph Smith, the Entrepreneur",
    "Presenters": "Dan Hill\nD. Michael Quinn\n George Smith",
    "Description": "Steve Jobs was a flawed man, both personally and professionally in a lot of ways, but he was also one of the most successful CEOs in history. He and others like him have transformed the world with their visions of change and innovation. This panel will explore Joseph Smith as a religious  and spiritual innovator who changed the landscape of American faith.",
    "URL": "",
    "Session ID": 231
  },
  {
    "Audio": "SL17232",
    "Title": "The Church's Sexual Addiction Recovery Program",
    "Presenters": "Ryan Flake\n Justin Pilmer\n Brayden Snow",
    "Description": "The LDS Church has a program that deals with pornography \"addiction.\"  This panel will discuss, from personal experience, what it is like to be in this program and what its benefits and drawbacks are.",
    "URL": "",
    "Session ID": 232
  },
  {
    "Audio": "SL17233",
    "Title": "Social Responses to Mormon Feminists: \"No One Else Was Talking About It, So it Must Be Taboo\"",
    "Presenters": "Jennifer Crow",
    "Description": "This session presents a study drawing on interviews, blogs, and podcasts examining the motivations and consequences individual Mormon women have faced when engaging in feminist activities. What motivates them to engage in such activities? What happens to their persona in their religious communities? How does this shift impact their private lives? How have LDS Church leaders reacted to them? What formal or informal social controls have these women experienced?",
    "URL": "",
    "Session ID": 233
  },
  {
    "Audio": "SL17234",
    "Title": "Remembering Gene",
    "Presenters": "Bob Rees",
    "Description": "Eugene England is recognized as one of the most influential Latter-day Saints of the latter half of the twentieth century. As teacher, writer, scholar and humanitarian, England had an indelible influence on several generations of Latter-day Saints at a pivotal time in Church history. Graduate Theological Union is establishing an endowed chair in Mormon Studies to be named in Gene’s honor. This session is designed to celebrate Gene's life and studies by giving attendees an opportunity to pay tribute to him through personal stories and remembrances.",
    "URL": "",
    "Session ID": 234
  },
  {
    "Audio": "SL17235",
    "Title": "Parenting and Perfectionism in the LDS Context",
    "Presenters": "Kelly Furr",
    "Description": "Even though many know that the biblical injunction to “be ye therefore perfect” is referring to wholeness or completion through Christ, rather than the elimination of errors, literal perfectionism continues to pervade LDS culture.  Parents who strive for perfection while raising their children may unwittingly pass on perfectionistic expectations and anxieties to their children, leading to negative mental health consequences.  This presentation will cover current research on perfectionism and explore how perfectionism and LDS culture are related.  It will offer practical strategies for parents and discuss existing doctrines the institutional LDS Church can accentuate to de-emphasize perfectionism.",
    "URL": "",
    "Session ID": 235
  },
  {
    "Audio": "SL17236",
    "Title": "The Greatest and the Least: The Theology of the Parables and Miracles of Jesus",
    "Presenters": "Janice Allred",
    "Description": "Jesus' parable of the sheep and the goats, in which he equates himself to the hungry, the thirsty, the stranger, the naked, the sick, and the prisoner—\"the least of these\"— is not simply an isolated parable with a message encouraging inclusivity; it forms an integral part of the meaning embedded in all of his parables and miracles. This paper will explore the theology of the parables and miracles of Jesus, showing how they give us a witness of the person and mission of Jesus Christ and his message of salvation for all people.",
    "URL": "",
    "Session ID": 236
  },
  {
    "Audio": "SL17238",
    "Title": "Anonymity and the Mormon Searcher",
    "Presenters": " Mithryn (aka Kenneth Lines)\n Vh65 (aka Violet Hughes)",
    "Description": "Anonymity provides the ability to protect oneself from reprisal, but it also provides trolls the ability to erode the quality and longevity of an online forum. This online community of over 40,000 subscribers flourishes with information, support, and caring while trying to protect the identities of those just starting to dare to ask questions that go unanswered in LDS Sunday Schools worldwide.",
    "URL": "",
    "Session ID": 238
  },
  {
    "Audio": "SL17239",
    "Title": "Addressing Mormon Thinking Errors",
    "Presenters": "Jennifer White\nNatasha Helfer Parker",
    "Description": "Last year Jennifer and Natasha presented a popular session called “Mormon Thinking Errors” which addressed typical ways myth and overgeneralizations usually rear their heads in LDS family and ward settings. This session will take the conversation further and offer concrete strategies and ideas to combat these types of messages in our own heads or when they come at us through conversations with family and friends.",
    "URL": "",
    "Session ID": 239
  },
  {
    "Audio": "SL17251",
    "Title": "Why We Stay",
    "Presenters": "Robin Linkhart\nJohn Gustav-Wrathall\nMaxine Hanks\nNathan McCluskey",
    "Description": "This perennially well-received session features the stories of those who have chosen to remain active, dedicated Latter-day Saints even in the face of challenges to traditional faith.",
    "URL": "",
    "Session ID": 251
  },
  {
    "Audio": "SL17252",
    "Title": "(In)Active Mormon Women: An Ethnodrama",
    "Presenters": "Janice Jenson – Creator\n\nCast:\nChelsea Yeates – Lucinda\nEmilie Starr – Presindia\nLily Hye Soo Dixon – Fanny\nMarlena Everts – Sylvia\nMarta Schaub – Agnes\nNatalie Keezer -  Zina\n\n(Casting may be subject to change, based on availability)",
    "Description": "Inspired by her own faith journey, Janice created this play by interviewing fifteen inactive Mormon women through a group interview process called a story circle. The story circles were audio recorded, transcribed, and then compiled into a performance script—every word in the script comes directly from these women's experiences following their spiritual journey away from the Mormon Church.  Be advised that this play contains strong language and adult content.",
    "URL": "",
    "Session ID": 252
  },
  {
    "Audio": "SL17261",
    "Title": "Transparency for All",
    "Presenters": "Ryan McKnight",
    "Description": "\"Transparency is for those who carry out public duties and exercise public power. Privacy is for everyone else.\" – Glenn Greenwald\n\nTo one degree or another, transparency has always been an issue in the LDS Church. MormonLeaks was created to help facilitate transparency, though this effort has been criticized by some LDS Church members. It is the position of MormonLeaks that everyone (including active members) benefits from LDS Church transparency.",
    "URL": "",
    "Session ID": 261
  },
  {
    "Audio": "SL17262",
    "Title": "Typical Sexual Shame Residue from Religious Upbringings",
    "Presenters": "\nKristin Marie Bennion\nNatasha Helfer Parker\n",
    "Description": "Although Mormonism has quite a bit of sexual positivity in its doctrine, the cultural processes in wards, stakes and family systems teach mostly fear, shame and the \"thou shalt nots.\" This leaves many members of our church with problems like unrealistic expectations, inadequate education, unnecessary self or partner shaming, rigid belief systems, and underdeveloped processes when it comes to our relationship with sexuality. This session will offer some reframings that can help attendees embrace their sexuality in healthier ways.",
    "URL": "",
    "Session ID": 262
  },
  {
    "Audio": "SL17263",
    "Title": "Worth of All Persons",
    "Presenters": "Carla Long\nLachlan Mackay\n Nancy Ross\nDan Wotherspoon\n Ruth Williams",
    "Description": "This panel includes people from many different branches of the Restoration movement who will discuss what \"Embracing All, Even the Least of These\" means in a faith transition. What do our books of scripture say about this topic? How we act upon those words?",
    "URL": "",
    "Session ID": 263
  },
  {
    "Audio": "SL17264",
    "Title": "Murder, Mayhem, Mormons, and Miners: Tales of Death and Violence from Utah’s Pioneer Dixie",
    "Presenters": "Melvin C. Johnson",
    "Description": "Too often we portray 19th-century Mormon pioneers as two-dimensional stick figures against the back drop of the Mormon Restoration. The presentation, however, covers several accounts of deadly incidents and treachery that occurred among the Mormons the Santa Clara and Virgin Rivers area, giving us a new look into pioneer days in Dixie.",
    "URL": "",
    "Session ID": 264
  },
  {
    "Audio": "SL17265",
    "Title": "A Life Worth Living (after Mormonism)",
    "Presenters": "Gary Horlacher\n Ernest Horstmanshoff",
    "Description": "For some Mormons, losing faith creates an existential crisis, making them ask what life's meaning is. Why is meaning in life so important? What meanings are worth living for? This presentation explores theories and research on meaning, and shares insights toward achieving a meaningful life.",
    "URL": "",
    "Session ID": 265
  },
  {
    "Audio": "SL17266",
    "Title": "More on the Evolution of the D&C Text: Revelations Printed in Mormon Newspapers",
    "Presenters": "Bill Speer",
    "Description": "The text of Doctrine & Covenants has evolved in a manner that is comparable to organismal phylogenies.  It was previously demonstrated that modern LDS and RLDS (or Community of Christ) editions represent distinct textual groups, which are also distinct from the Book of Commandments and earlier D&C editions. This study focuses on revelations printed in The Evening and the Morning Star and then reprinted in the similarly named Evening and Morning Star (without the definite articles).  Differences, though sometimes small (but significant), can be found between what is printed in the former, and what is reprinted in the latter.",
    "URL": "",
    "Session ID": 266
  },
  {
    "Audio": "SL17267",
    "Title": "Radio Heaven and Hell: Being a Talk Show Host in a Mormon State",
    "Presenters": "Richard (Richie T) Steadman\nBill Allred",
    "Description": "This panel will discuss the experiences of two popular radio personalities in Utah. Both Mormon, each will describe their journeys into radio as well as their Mormon journey inside and outside the church.",
    "URL": "",
    "Session ID": 267
  },
  {
    "Audio": "SL17268",
    "Title": "Redeeming the Fallen: LDS Reaction to the Illicit Intercourse Heresy of 1841–1842",
    "Presenters": "Meg Stout",
    "Description": "In 1841–1842 unknown numbers of faithful Mormons embraced a \"new doctrine\" where a man and a woman could be sexually intimate without ceremony as long as it was kept secret. Contemporary documents confirm the identities of several, with the affidavits of some published in newspapers. This presentation examines key instances where the \"heretics\" subsequently repented and became stalwart members of the Mormon community, along with the mechanisms used in the 1840s and later to knit the community back together.",
    "URL": "",
    "Session ID": 268
  },
  {
    "Audio": "SL17269",
    "Title": "Out of the Luminous Silence:  Connecting with the Divine Feminine through Women's Rituals",
    "Presenters": "Debra Brown Gordy",
    "Description": "LDS women are among a growing number who find the male-defined and dominated structures of traditional religions increasingly stifling, leading them to seek a connection with the Divine that embraces Heavenly Mother and expresses their own divinity. For millenia this yearning has been satisfied through women’s rituals, which were also part of the beginnings of the Restoration. Though banished and driven underground by patriarchal religions, they are not lost. Come and learn about this ancient path to connection with the Divine – the Feminine Path to God.",
    "URL": "",
    "Session ID": 269
  },
  {
    "Audio": "SL17271",
    "Title": "A Preview Discussion of a forthcoming volume entitled: The LDS Church’s Gospel Topics\nEssays: The Scholarly Community Responds",
    "Presenters": "Newell G. Bringhurst\n Matthew L. Harris\n Gary Bergera\nMargaret Toscano\n",
    "Description": "This session is a discussion of the contents of forthcoming volume entitled The LDS Church’s Gospel Topics Essays: The Scholarly Community Responds to be published by the University of Utah Press in 2018. The discussion will feature four contributing scholars. The scholars and their topics are as follows: Newell G. Bringhurst, “A Brief Overview of the Volume—Why the Gospel Topics Essays?” Matthew L. Harris, “Reflections on the ‘Race and Priesthood’ essay—Its Strengths and Weakness” Gary James Bergera, “’Through a Glass Darkly’: ‘Joseph Smith and the Beginnings of Plural Marriage’ essay.” Margaret Toscano, “Deconstructing the ‘Joseph Smith’s Teachings about Priesthood, Temple and Women’ essay.”",
    "URL": "",
    "Session ID": 271
  },
  {
    "Audio": "SL17272",
    "Title": "LDS/SSA Mormons: Preliminary Results of the Four Options Survey",
    "Presenters": "Marybeth Raynes\nLee Beckstead\nRon Schow",
    "Description": "LGB or SSA Mormons are faced with challenging choices about how to integrate faith and sexuality. Unfortunately none of the available choices are widely approved or easy to make. In order to be inclusive and better understand these choices, an research team has been formed with both conservative and liberal members. They designed a survey which includes ten sections of questions on aspects of life and relationships. This session will present the preliminary findings from more than 1,000 respondents, focused on the four options studied: single celibate, single non-celibate, mixed orientation, and same-sex relationships.",
    "URL": "",
    "Session ID": 272
  },
  {
    "Audio": "SL17273",
    "Title": "How I Became an LGBTQ Ally While Serving as a YSA Bishop and How We Can Better Support our LGBTQ members",
    "Presenters": "Richard Ostler",
    "Description": "Ostler will recount his journey to becoming a LGBTQ ally while serving as a YSA bishop. Between hearing the stories of his LGBTQ ward members and the Church’s recent policy statements, Ostler rebuilt his LGBT beliefs/attitudes/conclusions from scratch. He now sees his LGBT friends as some of his Heavenly Parent’s finest sons and daughters, equal members of society, and worthy. After his release as a YSA Bishop (serving the normal three years, released in the fall of 2016), he continues to minister to the LDS LGBTQ community, using his baptism and temple covenants as ‘fuel’ for this calling. He will present ways that Latter-day Saints can be more supportive of their LGBTQ brothers and sisters.",
    "URL": "",
    "Session ID": 273
  },
  {
    "Audio": "SL17274",
    "Title": "Mormons and Trump: An Unholy Alliance?",
    "Presenters": "Clifton Jolley\n Bob Rees\nMisty K. Snow",
    "Description": "Mormons have an ambivalent attitude toward Donald Trump. That ambivalence is most clearly seen through the lens of Mitt Romney. Romney was dissed by Trump who called the former candidate for president a \"choke artist,\" and a \"failed candidate.\"  Then Trump humiliated Romney by pretending to consider him as Secretary of State. Trump seems to stand for everything Mormons are against and against everything they are for, and yet he won a majority of Utah voters. This panel explores the complex attitudes toward Trump and poses questions as to the future of Mormon-Trump relationship.",
    "URL": "",
    "Session ID": 274
  },
  {
    "Audio": "SL17275",
    "Title": "Crafting as Subversive Resistance and Problematic Myopia: The Struggle for Intersectionality",
    "Presenters": "Analyn Gourley\nNancy Ross\nJennifer Huss Basquiat",
    "Description": "Craftivism has been defined as “the practice of engaged creativity, especially regarding political or social causes.” Some feminists are using traditionally identified “feminine” crafts to reclaim their art and empower women. By using their creativity to make the world a better place, craftivists help bring change via personalized activism. Craftivism also gives women access to working on important social and political causes using domestic crafts. Yet, these same crafts can limit the intended audience when one person’s reality erases another. This panel will explore what adaptations craftivists must make if they are to become intersectional and truly effect social change.",
    "URL": "",
    "Session ID": 275
  },
  {
    "Audio": "SL17276",
    "Title": "Millennial Mormons: A Fundamentalist Perspective",
    "Presenters": "Alia Peterson\n Katherine Horner\n Dana Peterson\n Caleb Horner\n Joshua Horner\nJonathan Olsen\n Joseph Wright\n Benjamin Jenson \n Derrik Peterson",
    "Description": "Studies show that more and more youth are leaving religion, so what keeps young adults in a fundamentalist faith? This panel will discuss personal experiences of youth from from Christ Church Inc., a break-off group from the Apostolic United Brethren (AUB).",
    "URL": "",
    "Session ID": 276
  },
  {
    "Audio": "SL17277",
    "Title": "Sacred Resistance: Mormon Women Marching",
    "Presenters": "Jody England Hansen\nNatasha Helfer Parker\nGina Colvin",
    "Description": "The Women's March on Washington inspired many Mormon women to gather in sisterhood. Some of us carried the names of those who could not gather physically, sharing a vicarious experience. In Washington D.C., Natasha Helfer Parker and Gina Colvin led a retreat for Mormon feminists who had come to the march. In this panel, we will share the sacred nature of this gathering and of the power of resistance inspired by the spirit of divine sisterhood.",
    "URL": "",
    "Session ID": 277
  },
  {
    "Audio": "SL17278",
    "Title": "Metal Records and the Invention of Religious Tradition",
    "Presenters": "Michael G. Reed \nRespondent: D. Michael Quinn",
    "Description": "This presentation offers a comparative study of the gold plates of the New World, and the lead plates of Granada, Spain. Both metallic records (brought forth in the modern period) were said to be buried in the ground, connected by rings, found by treasurer-seekers in a sacred hills, and deposited with other relics. Both artifacts claimed that indigenous people were anciently introduced to Christianity, These artifacts served similar needs, emerged in times of political/religious turmoil, and were defended by believing apologists in strikingly similar ways.",
    "URL": "",
    "Session ID": 278
  },
  {
    "Audio": "SL17279",
    "Title": "Mormon Identity in Crisis: Embracing the Least of These",
    "Presenters": "Mark Crego",
    "Description": "Our Mormon Identity is often conferred upon us by parents and a high-demand religious culture, leaving little room for exploration and mature identity development. As a result, the Mormon identity is often child-like in its magical worldview, and vulnerable to delayed identity crises in adulthood when challenges to beliefs arise. Additionally, Mormon institutions often foster a kind of identity politics, leveraging “worthiness” to control Mormon Identity. This presentation demonstrates how what is usually termed a “faith crisis” is actually more of an “identity crisis,” and presents an approach toward an inclusive and open Mormon identity going beyond faith crisis.",
    "URL": "",
    "Session ID": 279
  },
  {
    "Audio": "SL17291",
    "Title": "Plenary Session: Embracing the Least of These",
    "Presenters": "Dr. Fatimah S. Salleh",
    "Description": "Following several religious traditions, Dr. Salleh will preach a sermon on what it means to embrace “the least of these” in a tumultuous world. After the sermon, Lisa Butterworth will host an interactive Q&A.\n\nOpening musical number: \"Sinners, Are You Woke?\"\nWritten and composed by Michael Adam Ferguson",
    "URL": "",
    "Session ID": 291
  },
  {
    "Audio": "SL17301",
    "Title": "Beauty (A Devotional)",
    "Presenters": "Bob Rees",
    "Description": "Beauty may not, as Dostoevky claimed, “save the world,\" but without it, neither salvation nor the world is complete. Why has God planted in the human soul a need for beauty? One reason is that, as Emerson said, “beauty is God’s handwriting—a wayside sacrament.” As such, it deepens and refreshes us, making it possible for us to endure the ugly, the grotesque, and the unseemly. There is so much of the world that is unbeautiful that we should never “lose an opportunity of seeing anything that is beautiful.”  This devotional focuses on beauty and explores its relationship to other virtues.",
    "URL": "",
    "Session ID": 301
  },
  {
    "Audio": "SL17311",
    "Title": "Mormons, Myth, Miracles, & Magic",
    "Presenters": "Bob Rees",
    "Description": "On any given Sunday, but especially on the first Sunday of the month, it is not uncommon to hear Latter-day Saints speak of miracles in their lives. To an objective viewer, it is sometimes difficult to distinguish between some event that might qualify as a miracle and others that seem more within the realm of magic or myth. What is the difference between myth, magic, and miracles? Is it important to make such distinctions? What are the dangers of seeing every positive event as a miracle? This session examines the extraordinary and seeming-extraordinary through the lens of the natural, supernatural, and cultural.",
    "URL": "",
    "Session ID": 311
  },
  {
    "Audio": "SL17313",
    "Title": "Beyond Savannah",
    "Presenters": "\nSavannah\nLowell Acorda\nWesley Green\nJack Steele\nSarah\nKris \nBritt Johns",
    "Description": "In June, 12-year-old Savannah bore her testimony in her ward., but when she said that she knew God loves her and made her gay, the microphone was shut off and she was told to sit down. This incident, later witnessed over the Internet by millions, is symptomatic of a larger problem within the Mormon church of silencing LGBTQ voices. A panel of LGBTQ Mormons will relate stories of the many ways they have been silenced within Mormonism and what allies can do to amplify and lift up their voices.",
    "URL": "",
    "Session ID": 313
  },
  {
    "Audio": "SL17314",
    "Title": "Mormons and Heroin Use",
    "Presenters": "Elizabeth Snyder",
    "Description": "For some, religion is a balm of relief; for others it is a barbed wire of entrapment. How have some people sought relief from religious pain in narcotics? How can narcotic abuse and cultural Mormonism lead people into an ongoing state of suffering? How can one more constructively live in relation to and within Mormonism, even when it’s painful?",
    "URL": "",
    "Session ID": 314
  },
  {
    "Audio": "SL17315",
    "Title": "The Remnant Movement: Seeking to Recover and Continue the Restoration",
    "Presenters": "Tausha Larsen \nAdrian Larsen \nQuintina BearChief Adolpho\nRobert WK Adolpho",
    "Description": "The current, so-called “Remnant” movement is a mystery to many. Originating with the works of Denver Snuffer, this grass-roots movement has captured the attention of all types of Mormons, as well as the ire of the LDS church. As it seeks to reclaim what’s been lost since the days of Joseph Smith, and continue the work he started, it also rejects polygamy and church hierarchy. In this panel presentation and Q/A, four active participants in the movement will present the facts, dispel the myths, and outline the ideas driving this unique approach to the gospel.",
    "URL": "",
    "Session ID": 315
  },
  {
    "Audio": "SL17316",
    "Title": "Shame with No Name: Identifying and Healing “Aspirational Shame” in Mormon Women",
    "Presenters": "Julie de Azevedo Hanks",
    "Description": "The term, “aspirational shame,” names a common experience among Mormon women: the feeling of shame for having aspirations outside of the Church’s emphasis on women’s roles in the home. In this session, I will share case examples that define and illustrate the concept and will suggest ways to resolve this shame and to challenge the prevailing either/or paradigm for the lives of adult women.\n\n",
    "URL": "",
    "Session ID": 316
  },
  {
    "Audio": "SL17317",
    "Title": "Trials Of Our Faith: On Navigating A Faith Crisis",
    "Presenters": "Daniel Rollõ",
    "Description": "Many LDS members are experiencing tension in their relationship with the LDS Church similar to the tension people in couple’s therapy have. The best solutions to such tensions aren’t in having a satisfying answer to each unique concern, but in understanding the tension itself.",
    "URL": "",
    "Session ID": 317
  },
  {
    "Audio": "SL17318",
    "Title": "Discussion Group:  Leaving and Not Leaving Alone: How to Live With the Labels",
    "Presenters": "Samantha Louise Shelley\nTanner Gilliland",
    "Description": "This session is an interactive discussion where participants will discuss how it feels to be labeled by their family and friends once they move away from orthodox participation.",
    "URL": "",
    "Session ID": 318
  },
  {
    "Audio": "SL17334",
    "Title": "The Spiritual Brain",
    "Presenters": "Michael Adam Ferguson",
    "Description": "Brain science has matured to the point where it is beginning to subsume the philosophical discipline of religious phenomenology. In this session, Dr. Michael Ferguson will lead attendees through an exciting spiral of divine ascent, complete with detailed mechanisms for the cognitive and neural dynamics of theosis (i.e., divine imitation). The best of contemporary science and the highest expression of Christian theology are fused in an extraordinary presentation you will not want to miss.",
    "URL": "",
    "Session ID": 334
  },
  {
    "Audio": "SL17322",
    "Title": "The Mormon Heavenly Mother: Helper of the Oppressed",
    "Presenters": "Margaret Toscano",
    "Description": "The Heavenly Mother, though acknowledged as legitimate by LDS leaders, nonetheless has been marginalized in practice, referred to mostly as one of the “heavenly parents.” Recently, she also has been challenged by liberal writers who question her value, seeing her as a representative of heteronormative marriage. This paper will contest both views, arguing that the Mormon Mother God is a vital symbol of the oppressed and outcast, whether they face discrimination for their race, their LGBTQ identity, their immigrant status, or as one of the poor and needy.",
    "URL": "",
    "Session ID": 322
  },
  {
    "Audio": "SL17329",
    "Title": "Health Is Our Birthright",
    "Presenters": "Sarah E. Firmage",
    "Description": "How we care for our individual bodies is a private, sacred choice. The relationship between a healer and a client is also sacred, very similar to that of a priest and parishoner. It must remain free of government, religious, or corporate intrusions. It must be available to all people, including those on the LGBT spectrum. We are seeing healthcare rights threatened and removed one by one. To ignore these intrusions is to give our power away, lay down our freedom of choice, and lay down our God-given intelligence to find new ways to heal.",
    "URL": "",
    "Session ID": 329
  },
  {
    "Audio": "SL17323",
    "Title": "Revelation Through Hallucination",
    "Presenters": "Bryce Blankenagel\nCody Noconi ",
    "Description": "Given the unique psychoactive effects and abundant availability of myriad entheogens, there exists evidence that Joseph Smith used plant medicines to incite visions and personal revelations for himself and his parishioners. This model provides a much-needed naturalistic explanation for multiple instances of visionary experiences in Mormon history which have previously been explained with group-hallucination psychology or attributed to the power of God.",
    "URL": "",
    "Session ID": 323
  },
  {
    "Audio": "SL17324",
    "Title": "A Year of Faith Transition Stories: A Qualitative Analysis of Emergent Themes",
    "Presenters": "Nancy Ross\nRob Vox\n",
    "Description": "This session explores emergent themes generated across a year of faith transition interviews from the Faith Transitions Podcast. The data includes 28 Mormon transitions and seven transitions occurring outside of the Mormon tradition. Commonalities and differences between stories will be explored, concluding with a Q & A regarding the transition process with suggestions for navigating a faith transition.\n",
    "URL": "",
    "Session ID": 324
  },
  {
    "Audio": "SL17325",
    "Title": "Borderlands: Helping Newcomers and Those Experiencing a Crisis of Belief",
    "Presenters": "D. Jeff Burton\n Jon Ogden",
    "Description": "Almost every member of the LDS Church has a time when some cherished belief or understanding is challenged and doubt begins to be part of their traditional Mormon \"knowing\" testimony experience. We in the Borderlands can help those struggling by sharing ten simple approaches and perspectives. These can help struggling members see their difficult experiences in a more positive light and help them return to emotional stability, personal growth, and continued Church activity or affiliation (suitable to  their needs and wants).",
    "URL": "",
    "Session ID": 325
  },
  {
    "Audio": "SL17326",
    "Title": "Awash in a Sea of Faith: Is Mormon Political History Repeating Itself?",
    "Presenters": "\nRandy Snyder",
    "Description": "\n\nAs an homage to \"Awash in a Sea of Faith: Christianizing the American People,\" by Jon Butler, this session explores how Mormons managed to overwhelmingly vote for a candidate that is decidedly against all their sensibilities and values. It will also explore why a minority of Mormons conscientiously didn't, drawing parallels to Mormon political history.  Included will be research on the impact fabricated news played in the election by Jeff Green.\n",
    "URL": "",
    "Session ID": 326
  },
  {
    "Audio": "SL17327",
    "Title": "The Polygamist's Daughter: Healing in the Aftermath of Trauma and Abuse",
    "Presenters": "Anna LeBaron",
    "Description": "This presentation will address the issue of \"Healing in the Aftermath of Trauma and Abuse\", including the hidden abuses which leave marks and scars not just on the body, but on the heart, soul, and spirit as well.",
    "URL": "",
    "Session ID": 327
  },
  {
    "Audio": "SL17328",
    "Title": "More Than a Name: How Genealogy Connects Us",
    "Presenters": "Corey Howard\n Kathy Carlston",
    "Description": "This presentation proposes that the true purpose of genealogy is to help us get to know our ancestors. To illustrate this concept, the presenter will use stories from her own history that helped her understand her contemporary family dynamic.",
    "URL": "",
    "Session ID": 328
  },
  {
    "Audio": "SL17321",
    "Title": "Sing a New Song: Hymns of Devotion, Inclusion, and Faith",
    "Presenters": "Fred Voros\nAlan Eastman ",
    "Description": "Come and sing new, relevant hymns with us! These hymns address topics such as the lifting of the priesthood ban on race, reverence for the earth, Heavenly Mother, the Atonement, evolution, the homeless, refugees, women's prophetic role, the devil, death, faith, and doubt. The session will consist almost entirely of singing new hymns by Fred Voros, Alan Eastman, and other members of the Western Hymn Writers Workshop. All are welcome, regardless of singing ability.",
    "URL": "",
    "Session ID": 321
  },
  {
    "Audio": "SL17331",
    "Title": "Other Sheep, Indeed",
    "Presenters": "Denver C. Snuffer, Jr.",
    "Description": "Christ's \"other sheep\" are mentioned in the New Testament and Book of Mormon, but remain unidentified. There are important things known to the \"other sheep\" but still unknown to Mormons. \"The least of these\" may not be our inferiors, but may be needed to complete Mormonism. Mormonism welcomes all truth, wherever it is found, and cannot allow itself to become self-satisfied or unwelcoming to new and important ideas from outside. No Mormon should be willing to ignore scripture to conform to orthodoxy. This paper will defend taking a much broader view of the unfinished \"restoration of all things.\"",
    "URL": "",
    "Session ID": 331
  },
  {
    "Audio": "SL17332",
    "Title": "Mormon Generations: What New Research Tells Us about Four Generations of Current and Former Latter-day Saints",
    "Presenters": "Jana Riess",
    "Description": "Millennials, GenXers, Baby Boomers, and the Silent Generation. What do they have in common, and where do they diverge? \n\nThis session looks at research findings from the nationally representative Next Mormons survey, conducted in late 2016. Which generation of Latter-day Saints has the largest number of children? Which has the strongest belief in God and in Mormon teaching? And which is the most likely generation to leave the Church? A significant portion of the session will be devoted to Q&A, and there will be age-appropriate door prizes for lucky members of each generation.\n",
    "URL": "",
    "Session ID": 332
  },
  {
    "Audio": "SL17333",
    "Title": "Walking One Another Home: Why I Continue to Stay",
    "Presenters": "Bob Rees",
    "Description": "This session will  explore the value and beauty of faith found within communing with the Divine and with one another.",
    "URL": "",
    "Session ID": 333
  },
  {
    "Audio": "SL17335",
    "Title": "An Unruly Faith: The Making of a Documentary about Kate Kelly and Gender Equity in the Mormon Church",
    "Presenters": "\nCindy Madsen Reid",
    "Description": "Three years ago, Cindy Madsen Reid, a first-time documentarian, read about Kate Kelly and the Ordain Women movement. Thinking it might make an interesting story and wanting to explore a career in film, she called Kate and asked her if she could follow her with a camera. Three years later, the story continues. Come get a sneak peak at the trailer, hear about a budding filmmaker, and catch key moments in an activist’s journey.",
    "URL": "",
    "Session ID": 335
  },
  {
    "Audio": "SL17336",
    "Title": "The Nauvoo Council of Fifty Minutes",
    "Presenters": "H. Michael Marquardt \nRespondent: Clair Barrus",
    "Description": "In September 2016 the LDS Church Historian’s Press made available in print the early minutes of the Council of Fifty. These minutes were kept from church members and the public for well over one hundred and fifty years. This paper will explore some of the events and topics discussed in these meetings, including Joseph Smith and Brigham Young being accepted as kings, the gentiles rejecting the gospel, and being shod with the preparation of the gospel of peace.",
    "URL": "",
    "Session ID": 336
  },
  {
    "Audio": "SL17337",
    "Title": "Healthy Communication and Negotiation in Mixed-faith Relationships\n",
    "Presenters": "Tom Perry",
    "Description": "Conflict and disagreements in mixed faith relationships are very common; finding healthy, two-way communication and negotiation can often mitigate these disagreements and issues.\n",
    "URL": "",
    "Session ID": 337
  },
  {
    "Audio": "SL17338",
    "Title": "Quantifiably Stranger Than Fiction",
    "Presenters": "Christian N. K. Anderson\nCheryl Bruno\nJoseph Geisner",
    "Description": "In the gerentocracy of the LDS Church, actuarial tables can be (and have been) used to forecast leadership a few decades in the future. Though these predictions are generally quite accurate, surprises happen. Using historic actuarial tables, this presentation demonstrates four time periods where reality deviated most from the statistically most likely path, then presents four corresponding alternative history vignettes with particular emphasis on humanitarian ramifications.",
    "URL": "",
    "Session ID": 338
  },
  {
    "Audio": "SL17339",
    "Title": "Voice in the Wilderness",
    "Presenters": "Margaret Olsen Hemming\n Pandora Brewer",
    "Description": "The ancient practice of midrash inserts fictional narrative where actual scripture is silent, giving details to characters that are otherwise footnotes. This presentation explores the historical context and current spiritual relevance of midrash. We will examine criticism of its practice, from accusations of cultural appropriation to the hubris of trying to add to scriptural record, and then discuss the power of focusing on female characters and stories. We will look at examples of midrash, including the process of publishing the midrash issue of Exponent II and how the experience helped us think differently about women in the scriptures.",
    "URL": "",
    "Session ID": 339
  },
  {
    "Audio": "SL17351",
    "Title": "Playmate Mormons: Faith and Sex Work",
    "Presenters": "Kylie Johnson\n Sasha Earl\nKristin B. Hodson",
    "Description": "Mormonism has a complicated relationship with bodies and sex. Sasha Earl, a faithful, active Mormon stripper will join Playboy Playmate Kylie Johnson to discuss healthy intimacy, bodies, and faith.",
    "URL": "",
    "Session ID": 351
  },
  {
    "Audio": "SL17352",
    "Title": "Can We Talk? How to Facilitate Challenging Conversations with Those You Love (and Those You Don't)",
    "Presenters": "Jay Griffith \n Jacob Hess",
    "Description": "Family dinners, church, Facebook, work—all are rife with opportunities to have conversations about sometimes painful and divisive topics. And yet we usually avoid these subjects because we don’t know how to feel safe sharing what we really think. In this workshop, Jacob and Jay will teach proven methods to help bridge these troublesome waters while staying anchored to the essence of Christian ethics. Time will also be spent in small groups practicing with these tools.",
    "URL": "",
    "Session ID": 352
  },
  {
    "Audio": "SL17353",
    "Title": "Standing at the Crossroads of Identity and Faith",
    "Presenters": "Bryndis Roberts\nKalani Tonga\nGina Colvin\n",
    "Description": "The LDS Church professes to be a worldwide church, and its teachings proclaim that all are welcome. However, the Church tends to become mired in issues that are primarily of concern of those who live in the \"Mormon Corridor\" in the United States, taking political positions that are alienating rather than welcoming to those outside that culture. As women of color, we struggle constantly with navigating paths in a church that often does not hear us or see us. Many of us are now standing at a crossroads in our relationship with the LDS Church.",
    "URL": "",
    "Session ID": 353
  },
  {
    "Audio": "SL17354",
    "Title": "Getting Unstuck: Healing from Community Rejection and Spiritual Wounds",
    "Presenters": "\nLisa Patterson Butterworth\nJana Johnson Spangler",
    "Description": "Out of the dark night of the soul can come great growth. Using the principles of trauma recovery and the pillars of meaning, we will outline the process for healing the deep wounds that some experience during faith transition and give resources for rebuilding a life with new depths of kindness, strength, and resilience.  This session will include experiential and processing components.",
    "URL": "",
    "Session ID": 354
  },
  {
    "Audio": "SL17355",
    "Title": "Transitions: What I Learned",
    "Presenters": "\nAlex Pedersen\nNicholas R. Stewart\nSamuel Yamamoto",
    "Description": "This session will focus on the personal experiences of people who have transitioned out of the LDS Church, focusing on lessons learned in the process and aftermath of transition.",
    "URL": "",
    "Session ID": 355
  },
  {
    "Audio": "SL17356",
    "Title": "Seer Stones, Folk Magic, and Alvin's Hand",
    "Presenters": "Bill Reel",
    "Description": "Mormonism's beginnings are deeply connected with the folk magic practice of the Smith Family and Joseph Smith himself.  This session will expound on the Chase family, water witching, magic circles, guardian spirits, throat slit Spaniards, Obadiah Dogberry, Joseph's seer stones, and of course Alvin’s hand. Once we understand these narratives, Mormonism's beginnings look quite different.",
    "URL": "",
    "Session ID": 356
  },
  {
    "Audio": "SL17357",
    "Title": "Bob's Mormon Cred Scale 2.0",
    "Presenters": "Tom Perry\n Matt Long\nJohn Hamer\n Heather Craw\nBob Caswell\nRandy Snyder\n",
    "Description": "How much Mormon cred do you have? That is, how much of the end-to-end Mormon experience have you participated in? Bob Caswell, of the Infants on Thrones podcast, derived a Mormon cred scale back in 2014 through which he attempted to quantify anyone's Mormon credibility by having them answer a series of questions. Thousands of responses later, the infamous cred scale lives on as a point of reference. But now, Bob will join his fellow Infants in hosting a panel discussion to reveal and discuss the new and improved version of the cred scale for all to love… or hate.",
    "URL": "",
    "Session ID": 357
  },
  {
    "Audio": "SL17358",
    "Title": "Leadershift: The Slurge from Love to Power",
    "Presenters": "Paul Toscano",
    "Description": "Leadershift is the final essay in my \"Shift Happens\" series. \n\nIn part 1, I revisit the theme of my 1989 Sunstone speech \"A Plea to the Leadership of the Church: Choose Love Not Power\" and examine why church and state leaders tend to shift steadily from compassion to control, from ethics to self-preservation, from love to power. \n\nIn part 2, I discuss how this shift illuminates God's perceived failure to exercise divine leadership to intervene to prevent pain and evil, which is perhaps the most potent reason for the individual abandonment of theism for atheism.",
    "URL": "",
    "Session ID": 358
  },
  {
    "Audio": "SL17359",
    "Title": "Ask a Sex Therapist",
    "Presenters": "Natasha Helfer Parker\nKristin Marie Bennion",
    "Description": "Sexuality is commonly a taboo subject and is often relegated to secret or non-existent spaces, especially in religious cultures that have roots in Puritanism. This session will offer an open, safe space for attendees to ask trained professionals questions about sexuality.",
    "URL": "",
    "Session ID": 359
  },
  {
    "Audio": "SL17361",
    "Title": "Helping Mormonism Move from Patriarchy toward Partnership",
    "Presenters": " Carol Lynn Pearson\nJulie deAzevedo Hanks",
    "Description": "Carol Lynn Pearson and therapist Julie deAzevedo Hanks relate their experiences in discovering that patriarchy is not a given, but is a historical construct, and one that is in process of giving way to a much more sustainable and enlightened paradigm: partnership. How can this shift be accomplished in the solid patriarchy we know as Mormonism?",
    "URL": "",
    "Session ID": 361
  },
  {
    "Audio": "SL17362",
    "Title": "Without Death We Cannot Mourn, Without Mourning We Cannot Be Saved: On Mormonism's Confrontation with Its Haunted, Invisible Body",
    "Presenters": "Jacob Baker",
    "Description": "In this paper I will argue that Jesus's historical context provided a framework for what he meant about those who were \"the least of these\" within his community, but who \"the least of these\" are within modern communities will differ according to modern contexts and concerns. I will argue for a specific interpretation and what this might mean for moral obligations regarding \"the least of these,\" and how Mormonism's natural universalism has become obscured by other concerns, hiding \"the least of these\" from us while in plain sight, making its body invisible to itself. I argue that a proper understanding of mourning as individual confrontation with death and the collective building of solidarity is the only long-term, redemptive solution the moral obligations we have toward those in a community who qualify as \"the least of these,\" and that the collective salvation or damnation of a community hinges on how these are seen and responded to.",
    "URL": "",
    "Session ID": 362
  },
  {
    "Audio": "SL17363",
    "Title": "Good, Better, Best. \nDiscovering transformative service and charity after going on Mormon sabbatical.",
    "Presenters": "Doree Burt",
    "Description": "During my longer-than-planned Mormon sabbatical, I have discovered a different type of service. Not a check-list service. Not an assigned good-deed service. But the soul-charging, spirit-changing service that comes when not trying to rescue anyone. I call this \"Jesus service.\" This presentation explores what \"Jesus service\" means and how the LDS organization might hinder or help its pursuit. \n",
    "URL": "",
    "Session ID": 363
  },
  {
    "Audio": "SL17364",
    "Title": "The 10 Things Donald Trump can Teach us about Joseph Smith",
    "Presenters": "John Larsen",
    "Description": "Trump's rise from outside pariah to the presidency of the United States gives us insight into the phenomenon of charismatic leaders such as Joseph Smith. A comparison of the two men can shed light on the nature of revolutionary leaders and what characteristics it takes (or doesn't take) to stage an inside revolution. Looking at Trump, we can re-examine some of the assumptions about the motivation, skills, and character of Joseph Smith.",
    "URL": "",
    "Session ID": 364
  },
  {
    "Audio": "SL17365",
    "Title": "FreeBYU’s Campaign for Religious Freedom at the Y",
    "Presenters": "Brad Levin",
    "Description": "This session gives an overview of FreeBYU's activism over the preceding year, detailing what they’ve achieved, and highlighting what they hope to accomplish in the coming year. They are one of the few Mormon activist groups with a track record of both eliciting statements from LDS PR officials and achieving policy reform.\n",
    "URL": "",
    "Session ID": 365
  },
  {
    "Audio": "SL17366",
    "Title": "The Paradox of Jesus in The Book of Mormon",
    "Presenters": "Brian W. Kassenbrock",
    "Description": "Jesus is the Christ of the New Testament, however, his persona is surrounded by Hermetic themes such as light and darkness. These paradoxes relate to others such as the role of Ancient Egyptian language and culture in the context of Hebraic beliefs and give us insight as to why another set of scriptures was needed.",
    "URL": "",
    "Session ID": 366
  },
  {
    "Audio": "SL17367",
    "Title": "Voice Lessons: Finding My Way Back to the Songs of My Faith",
    "Presenters": "John Bonner",
    "Description": "An important part of my faith journey started with my singing in the Tabernacle Choir, continued through my leaving the Church (after coming out as gay), and ended with rediscovering my Mormon voice through writing. This session will tell the story of how I began the process of mending my divided heart, particularly in the wake of the November 2015 exclusion policy. I will be reading selections from the various personal essays I've published since November 5, 2015.",
    "URL": "",
    "Session ID": 367
  },
  {
    "Audio": "SL17368",
    "Title": "Polygamy in our DNA: is this “dead” practice preventing divine union in our marriages and families?",
    "Presenters": "Lizza Jacobs Nelson",
    "Description": "Even though Mormons currently don’t practice polygamy outside the temple, this practice has dramatically shaped our identities and relationships, affecting marriages, families and community interactions. If God is the divine union of the masculine and feminine in perfect harmony, polygamy has thrown that balance off, causing emotional and spiritual dysfunction, which we often perpetuate without knowing it. This session will recognize polygamy’s threads of influence and talk about how to transform conflict and pain through meditation, awareness, and receiving wholeness from the divine.",
    "URL": "",
    "Session ID": 368
  },
  {
    "Audio": "SL17369",
    "Title": "How the Restoration Experience Can Inform the Responsible Use of Scripture",
    "Presenters": "John Hamer",
    "Description": "Because of the legacy of Joseph Smith Jr., Latter Day Saint heritage churches have experience with scripture that is unique within Christianity.  With the Book of Mormon and Book of Abraham, Joseph Smith dictated whole books of scripture.  By claiming the prophetic mantle, he dictated new revelations in God’s voice that were compiled into the books of Doctrine and Covenants.  And in the “Joseph Smith Translation” or “Inspired Version” of the Bible, he took the existing scripture, crossed some words out, and added others.  \n\n By collapsing the historical distance in the composition and editing of scripture from antiquity to the recent past, Joseph Smith gave his heirs in the tradition a unique perspective on scripture.  And when his latter-day scriptures have failed to withstand academic challenges, that perspective has led many in the movement to dismiss all scripture and organized religion as having any value.  Without dismissing that response, John Hamer will explain how having 19th century scripture in the canon has informed his own general understanding and use of scripture in Community of Christ.",
    "URL": "",
    "Session ID": 369
  },
  {
    "Audio": "SL17371",
    "Title": "Organizing to Counter the Mormon Alt Right: A Collaborative Learning and Working Session",
    "Presenters": "Joanna Brooks",
    "Description": "This session will provide space and resources for learning how to stand up against racism and alt right extremism in Mormon spaces. We will first learn from the perspectives and writings of Mormon activists of color and then move to discussion of the role white Mormons can play in taking responsibility for the toxicity of historic and present day racism and political extremism in Mormon contexts.",
    "URL": "",
    "Session ID": 371
  },
  {
    "Audio": "SL17372",
    "Title": "Mormons, Addiction, and Opioids: Persepectives From Experts and Individuals",
    "Presenters": "Jeff Johnson,\n James Ott\nCatania Johnson\n Devin Edwards\nElizabeth Porter\nRyan Watkins",
    "Description": "Utah has one of the highest prescription drug abuse rates in the country. How does this affect the Mormon community? Experts and those who have experience with addiction will share their observations and stories.",
    "URL": "",
    "Session ID": 372
  },
  {
    "Audio": "SL17373",
    "Title": "Perspectives of Mormon Women (Re)Entering the Workforce",
    "Presenters": "Naomi Watkins\nDanielle Briggs Christensen\n Mandee Grant\nCristall Harper\nLisa Baker Heaton\nCecilia Wilbur",
    "Description": "The narrative of LDS women forgoing educational and professional pursuits to marry and rear children is well told, but what of the stories of LDS women who want to (re)enter the workforce or complete degrees? This panel conversation will focus on women’s paths of persistence in (re)entering the workforce, highlighting the pressures, expectations, obstacles and challenges these Mormon women face.",
    "URL": "",
    "Session ID": 372
  },
  {
    "Audio": "SL17374",
    "Title": "To Redact, or Not to Redact? That Is the Question: The George Q Cannon Journals",
    "Presenters": "Gary JamesBergera\n Joseph Geisner \nJohn S. Dinger\n",
    "Description": "This panel will discuss the release of the George Q Cannon Journals and the redactions made by the Church Historian's Press when publishing the journals online. A press release stated in part: “some passages of the original journal will be withheld in accordance with policies of the Church History Library to redact sacred, private, and confidential information.” What were some of the redacted passages? What can we learn from these redactions?",
    "URL": "",
    "Session ID": 374
  },
  {
    "Audio": "SL17375",
    "Title": "Integrating the Opposites:  Ethical Guidelines for Helping faith-based people who are sexually and/or gender diverse\"",
    "Presenters": "\nJerry Buie\nLisa Hansen\nDavid C. Pruden",
    "Description": "Intense inner conflict and strained relationships often occur for sexually and/or gender diverse Mormons who are trying to reconcile their sexuality and/or gender identity with their faith. Policies and practices for understanding their concerns have been deeply polarized for decades. The Reconciliation and Growth Project (RGP), a group of 11 mental-health professionals and academics from across the political spectrum, has developed a set of ethical guidelines for helping therapists, faith-based LGBT people, their families, and communities. The presenters will discuss these guidelines and model elements of our Peacemaking Protocol. The project can be found at reconciliationandgrowth.org.",
    "URL": "",
    "Session ID": 375
  },
  {
    "Audio": "SL17376",
    "Title": "Food of the Goddess: The Entheogenic Theory of Religion",
    "Presenters": "Micah Nickolaisen",
    "Description": "This presentation will begin by discussing psychedelic plants (psilocybic mushrooms, mescaline cacti, ergot extract, ayahuasca, cannabis, etc.), how they affect the human brain, what psychedelic experiences are like, and the effects they can have on people. The second half will explain the entheogenic theory of religion, a somewhat speculative explanation of how we changed from shamanic, egalitarian, peaceful goddess worshippers to patriarchal, warmongering, religious dogmatists after the development of agriculture.",
    "URL": "",
    "Session ID": 376
  },
  {
    "Audio": "SL17377",
    "Title": "Infants on Post-Mormon Values",
    "Presenters": "\nMatt Long\nBob Caswell\nTom Perry\nHeather Craw\nRandy Snyder\nJohn Hamer",
    "Description": "What do values look like after a faith crisis?  Without scriptures or prophets or belief in divinity, who is to say what is right and wrong?  When the Liahona disappears, what becomes your moral compass? What is the baby? What is the bathwater? The members of the Infants on Thrones podcast will explore these questions with their trademark fearless introspection, unexpected thoughtfulness, and manly humor.",
    "URL": "",
    "Session ID": 377
  },
  {
    "Audio": "SL17378",
    "Title": "Muslims and Mormons\nالمسلمين والمورمون",
    "Presenters": "\nZahraa Albaghdady \nCassie Hard\nNada al-Amin",
    "Description": "This panel will discuss the personal expereinces of Muslim immigrants who have moved to a predominantly Mormon state.",
    "URL": "",
    "Session ID": 378
  },
  {
    "Audio": "SL17379",
    "Title": "Enjoying the Temple with Fresh Eyes",
    "Presenters": "Dan Wotherspoon\n Sonja Farnsworth\n Jody England Hansen",
    "Description": "For many, the Mormon temple experience is first jarring, then inspiring, and eventually repetitive, dull, and monotonous. How might we enliven temple worship and service? Are there ways of approaching it that can add life, personal and communal empowerment, and richer views and experiences? Meet three people for whom this answer is a resounding yes.",
    "URL": "",
    "Session ID": 379
  },
  {
    "Audio": "SL17391",
    "Title": "Linger Longer with Elna Baker and Mindy Gledhill",
    "Presenters": "Elna Baker\nMindy Gledhill",
    "Description": "Every year, the Sunstone symposium ends with a closing banquet called a “Linger-Longer.” We invite participants to join us for this event to hear Elna and Mindy perform. Tickets are $18 per person (in addition to a regular conference ticket).\n\nSpace is limited. You can purchase Linger-Longer tickets here: https://www.sunstonemagazine.com/registration/",
    "URL": "",
    "Session ID": 91
  }
]
