[
  {
    "Audio": "SL20091",
    "Title": "Smith-Pettit Lecture",
    "Presenters": "Bart Ehrman, Karin Peter, Lindsay Hansen Park",
    "Description": "This session is sponsored by the Smith-Pettit Foundation, and is free and open to the public. To watch this session without registering for the symposium, go to https://www.facebook.com/SunstoneMagazine at 7:00 pm Mountain Time. To enter a questions for the Q&A, you must be registered for the symposium, and submit your question through the Whova app. \n\nA recent Pew Research poll showed that 72% of Americans believe in a literal heaven, 58% in a literal hell. Most people who hold these beliefs are Christian and assume they are the age-old teachings of the Bible. But eternal rewards and punishments are found nowhere in the Old Testament and are not what Jesus or his disciples taught.\nJoin Bart D. Erhman as he unfolds the history of post-mortality, drawing from his latest book, Heaven and Hell:  A History of the Afterlife. Then participate in a Q&A session with him afterward. \nThis lecture is sponsored by the Smith-Petit Foundation. It is free and open to the public.",
    "URL": "https://sunstonemagazine.com/audio/SL20091.mp3"
  },
  {
    "Audio": "SL20121",
    "Title": "Mormon Bigfoot: Searching for Something to Believe In",
    "Presenters": "Tom Bennett",
    "Description": "When a post-Mormon finds out that a compelling Bigfoot \"documentary\" is actually a work of fiction, he must again deal with doubt.\n\nSoon after returning from my mission, I sat down on a curb in downtown Atlanta and wept over my lost faith. I have since made peace with my Mormonism and now view it as a beautiful metaphor, an agent for stability, and an tool for spiritual growth.\n\nSince leaving the Church, I have gone on to study many other philosophies and faiths, eventually finding a beautiful amalgamation of my spiritual views in the quest to determine the truth behind the Bigfoot phenomenon (which interestingly enough is led by an LDS professor in Idaho.)",
    "URL": "https://sunstonemagazine.com/audio/SL20121.mp3"
  },
  {
    "Audio": "SL20122",
    "Title": "Taking Off the Nametag: Why Some Missionaries Leave the LDS Church for Good",
    "Presenters": "Dawn Dimick",
    "Description": "As a returned missionary, what does it mean to leave the LDS Church? Some struggle to reconcile leaving behind the doctrines of the Church without leaving behind their loved ones. While some family members assume that it's “a phase” that will pass, others feel a deep sense of loss. Grief is felt on all sides and often contributes to misunderstanding and stigmatization. Disaffiliation with the Church is often a complex journey of holding on and letting go, but some factors make understanding this process difficult. Through interviewing returned missionaries and analyzing previous studies, this study highlights potential problems with how the Church reports membership data, commonly held experiences of those who leave, and how we can promote understanding on all sides.",
    "URL": "https://sunstonemagazine.com/audio/SL20122.mp3"
  },
  {
    "Audio": "SL20123",
    "Title": "Conversations with Charlotte England",
    "Presenters": "Andi Pitcher Davis; Charlotte England,  Jim McConkie, Jay Griffith, Michael Austin",
    "Description": "In honor of Gene England's 88th birthday on the 22nd of this month, this session will honor Gene's life and teachings with interviews between his widow, Charlotte England, and several of her close friends and longtime peers of Gene's. One conversation will discuss an evening Jim McConkie spent with Charlotte when he apologized for his uncle, Bruce R. McConkie's, harsh letter and shutdown to Gene years prior regarding several of Gene’s teachings and beliefs.",
    "URL": "https://sunstonemagazine.com/audio/SL20123.mp3"
  },
  {
    "Audio": "SL20124",
    "Title": "The Metaphysics of Suffering",
    "Presenters": "John W. Yelland",
    "Description": "Everyone, no matter how privileged or poor, will inevitably come face-to-face with tragedy. How can we make sense of all the pain and suffering in our world, especially when so much of it seems random or unfair? As a hospice chaplain, the presenter has ministered to people asking these same questions, and as someone whose life has been defined by tragedy and death, he, too, askes them — every day.\n\nThis session will explore suffering, evil, and how to transform these stark realities of life into something that transcends the self. Through touching stories, theology, and philosophy, death will be tackled.",
    "URL": "https://sunstonemagazine.com/audio/SL20124.mp3"
  },
  {
    "Audio": "SL20125",
    "Title": "The Surprising Way 2 Nephi 29:11 Defines a Prophet",
    "Presenters": "Robert Kimball Shinkoskey",
    "Description": "This brief scriptural passage succinctly summarizes the content and spirit of both the Old and New Testament teachings about the availability of divine contact and assistance to all human beings and nations. This scripture also suggests that the definition of prophecy, and the related concept of prophethood, has been perhaps too narrowly understood. Prophets are those who lift spirits and teach gratitude.",
    "URL": "https://sunstonemagazine.com/audio/SL20125.mp3"
  },
  {
    "Audio": "SL20126",
    "Title": "Thriving Through a Faith Transition",
    "Presenters": "Jenny Morrow, Laura Moss, Mark Hallstrom",
    "Description": "What kind of experiences lead people to transition out of the Church? How do these transitions evolve? How possible is it to maintain a relationship with the Church or with still-active friends and family? Three panelists will draw on their own experiences and research as they explore these questions.",
    "URL": "https://sunstonemagazine.com/audio/SL20126.mp3"
  },
  {
    "Audio": "SL20131",
    "Title": "Walking One Another Home: Why I Continue to Stay",
    "Presenters": "Bob Rees",
    "Description": "In the introduction to the first volume of Why I Stay: The Challenges of Discipleship for Contemporary Mormons, editor Bob Rees states, “Deciding whether to stay in or leave one’s faith tradition is among the most difficult and soul-wrenching decisions a person can face.” It is a decision that is at the heart of what has come to be called “the Mormon Faith Crisis” which has highlighted why some, especially younger generations, are finding difficulty staying, In this session, Bob Rees (the editor of the second volume of Why I Stay, which will be published in 2021), gives his reasons for continuing to stay.",
    "URL": "https://sunstonemagazine.com/audio/SL20131.mp3"
  },
  {
    "Audio": "SL20132",
    "Title": "What Don't The Prophets Say Anymore?: A Text Analysis of General Conference, 1942-2020",
    "Presenters": "Quentin Spencer",
    "Description": "One way to track the evolution of Mormon culture is to look at trends in both what is said and not said over the pulpit at general conference. Using modern data analytics tools, it is possible to observe terms, phrases, and citations going in and out of use over time. This talk will review some of the more notable changes over the last 80 years, including a speaker-level analysis that shows a significant divergence among current church leaders in their use of words associated with either grace or works.",
    "URL": "https://sunstonemagazine.com/audio/SL20132.mp3"
  },
  {
    "Audio": "SL20133",
    "Title": "Transforming Our Grief-filled Mormon Experiences into Gratitude",
    "Presenters": "Peter Leavitt",
    "Description": "Sometimes the difference between feeling grief or gratitude about our Mormon experience is our perspective. How do we perceive the meanings and consequences of our faith journey? How do we view our relationships with the various Mormons in our lives? In this session, we will draw from social psychology to identify some ways we can subtly change our perceptions of other Mormons and our own relationship to Mormonism (whatever that might be) to help gratitude about our experiences come more easily. Our experiences as Mormons are rare and unique and they are something we can be grateful for even in the face of grief.",
    "URL": "https://sunstonemagazine.com/audio/SL20133.mp3"
  },
  {
    "Audio": "SL20134",
    "Title": "A Metaphorical Approach to \"the Church is True\"",
    "Presenters": "Robert Terry",
    "Description": "After undergoing a typical LDS faith crisis, I reconstructed my LDS testimony using Marcus Borg’s metaphorical paradigm as a pattern. In other words, I readily acknowledged historical and scriptural problems, but chose to focus instead on the truth and beauty of lived experience. I’ll summarize the Borg's paradigm, explain my perspective of the restored gospel, and share some of the highlights of five years of blogging and Facebook discussions where apologists and critics came to play. CES Letter, B of Mormon historicity, polygamy, the Book of Abraham — we’ll cover it all.",
    "URL": "https://sunstonemagazine.com/audio/SL20134.mp3"
  },
  {
    "Audio": "SL20135",
    "Title": "How Useful Is God's Body?: Eastern vs. Mormon Concepts of God",
    "Presenters": "Ben Heaton",
    "Description": "Joseph Smith taught the importance of understanding the nature of God. I will explore the use of the Via Negativa to address the concept of God(s) having a physical body, including how different human body systems might or might not be of use to an embodied God. I will discuss related issues including resurrected bodies, multiple gods, nonduality, and how our own body can be a vehicle in seeking to understand God and our deepest self.",
    "URL": "https://sunstonemagazine.com/audio/SL20135.mp3"
  },
  {
    "Audio": "SL20136",
    "Title": "The Plat of Zion and How It Changed",
    "Presenters": "Graham Ruttan",
    "Description": "All structures are, in some ways, ideology made manifest. This session will explore the Plat of Zion, a city planning map Joseph Smith received by revelation, and explore the way this city planning map changed to reflect trends in LDS teachings.",
    "URL": "https://sunstonemagazine.com/audio/SL20136.mp3"
  },
  {
    "Audio": "SL20151",
    "Title": "“Does Mormonism Have an Answer for Climate Change?”: Eco-Grief, Apocalypticism, and Mormon Environmental Rhetorics in the Anthropocene",
    "Presenters": "Shane Peterson",
    "Description": "Given the severity of climate change, its apocalyptic implications, and the growing trend of “eco-grief,” Mormon Studies must engage with this issue more directly and openly. By using the Wayne C. Booth's theories of rhetoric, I hope to determine how people across the Mormon spectrum communicate about this issue and understand it; whether or not Mormon theology and culture has an “answer” for this global climate crisis; how those in Mormonism will be affected by this problem; and if our faith community can create enough resilience together to adequately address this impending disaster.",
    "URL": "https://sunstonemagazine.com/audio/SL20151.mp3"
  },
  {
    "Audio": "SL20152",
    "Title": "\"Tabernacles of Clay: Gender and Sexuality in Modern Mormonism\": A Book Panel and Response from Author Taylor G. Petrey",
    "Presenters": "Patrick Mason; Jaclyn Foster, Alexandria Griffin, Taylor Petrey, Blaire Ostler",
    "Description": "This panel brings together a diverse group of scholarly voices to react to Tabernacles of Clay: Gender and Sexuality in Modern Mormonism by Taylor G. Petrey. Drawing on deep archival research, Petrey situates LDS doctrines in gender theory and American religious history since World War II. His challenging conclusion is that Mormonism is conflicted between ontologies of gender essentialism and gender fluidity, illustrating a broader tension in the history of sexuality in modernity itself.\n\nAs Petrey details, LDS leaders have embraced the idea of fixed identities representing a natural and divine order, but their teachings also acknowledge that sexual difference is persistently contingent and unstable. While queer theorists have built an ethics and politics based on celebrating such sexual fluidity, LDS leaders view it as a source of anxiety and a tool for the shaping of a heterosexual social order. Through public preaching and teaching, the deployment of psychological approaches to \"cure\" homosexuality, and political activism against equal rights for women and same-sex marriage, Mormon leaders hoped to manage sexuality and faith for those who have strayed from heteronormativity.",
    "URL": "https://sunstonemagazine.com/audio/SL20152.mp3"
  },
  {
    "Audio": "SL20153",
    "Title": "Other Scriptures: Grief, Gratitude, and the Haudenosaunee Great Peace",
    "Presenters": "Thomas W Murphy",
    "Description": "The arrival of a messenger who heralds an era of prolonged peace and equality may be one of the only events in the Book of Mormon attested to by external sources. In Haudenosaunee (Iroquois) traditions, the Peacemaker and the Mother of Nations encourage ceremonies of condolence and thanksgiving missing from the settler colonial narrative in the Book of Mormon. This presentation draws from decolonizing methodologies and Haudenosaunee oral tradition for an alterNative reading of this Latter-day scriptural apogee.",
    "URL": "https://sunstonemagazine.com/audio/SL20153.mp3"
  },
  {
    "Audio": "SL20154",
    "Title": "The Struggle When Faith in Christ Exceeds Faith in the Church",
    "Presenters": "Armando Martín",
    "Description": "I will begin this session by recounting my personal journey of loss and joy as my faith in Christ began to exceed my faith in church.\n\nChurch can provide important instruction for living. However, historically members rely on church to be a roadmap for salvation. Challenges and debate ensue when church dogma conflicts with the foundational New Testament scripture: call on the name of Jesus and be saved (Romans 10:13). \n\nMoreover, church can become an obstacle when the leadership initiates new programs, policies, procedures, and practices. Subtly, these well-intended initiatives can take priority over the essence of the gospel—dependence and reliance on Christ to be our everything.",
    "URL": "https://sunstonemagazine.com/audio/SL20154.mp3"
  },
  {
    "Audio": "SL20155",
    "Title": "Self-Compassion: Bringing Healing and Growth to Your Faith Journey",
    "Presenters": "Diane Rane Jones, Jana Spangler",
    "Description": "Having compassion for yourself means honoring and accepting the messiness of your own human experience. This messiness is often painfully present as our faith evolves. In this session, we will explore how to integrate the practice of self-compassion when challenging experiences arise. Through discussion, meditation, and experiential exercises, we will learn how to treat ourselves with greater care, kindness, and understanding.",
    "URL": "https://sunstonemagazine.com/audio/SL20155.mp3"
  },
  {
    "Audio": "SL20161",
    "Title": "Coffee, Alcohol, Cannabis, Psilocybin, Ayahuasca: Navigating Substance Use after Mormonism",
    "Presenters": "Jeff Lundgren, CMHC, Jennifer White, LCSW",
    "Description": "When transitioning Mormons begin to question the validity of the Word of Wisdom, many begin to explore and experiment with previously forbidden substances. Some have positive experiences, but not all. This presentation will address substance use from a mental health perspective, addressing common pitfalls, and offering strategies for exploring the use of coffee, alcohol, cannabis, psilocybin, ayahuasca, and more. The presentation will not focus on legal issues, but rather on the medical and psychiatric applications of these substances.",
    "URL": "https://sunstonemagazine.com/audio/SL20161.mp3"
  },
  {
    "Audio": "SL20162",
    "Title": "A Faith Journey through the Music of Mumford and Sons",
    "Presenters": "Ryan Pence",
    "Description": "Come experience the highs and lows of a faith journey through the music and lyrics of Mumford and Sons. Some songs capture the feelings of a relationship that works for a time, as you purely hold on to your truth. Others talk about something that calls you away from this first truth, and you become lost. Others speak of the need for someone who can see your pain and find no fault, giving you space to show your weakness. Others talk about finding strength in pain so that you can see a new path, and emerge from your cave to live your life as it is meant to be lived — your soul totally free. \"Awake my soul!\"",
    "URL": "https://sunstonemagazine.com/audio/SL20162.mp3"
  },
  {
    "Audio": "SL20162",
    "Title": "Mormon or Ex-Mormon?: How About a Third Choice?",
    "Presenters": "Mette Ivie Harrison",
    "Description": "It feels like the choice is to stay or go, to be Mormon or ex-Mormon. Why do we have to accept this binary? There are a lot of other choices that don't entail giving up your Mormon identity. Go on sabbatical. Hold fast to your Mormonism—just make it your own. And don't let anyone tell you that you have to make a choice. This session is guaranteed to upset ex-Mormons and Mormons alike.",
    "URL": "https://sunstonemagazine.com/audio/SL20162.mp3"
  },
  {
    "Audio": "SL20164",
    "Title": "Mindfully Navigating Grief & Loss Within Faith Awakenings",
    "Presenters": "Sara Hughes-Zabawa",
    "Description": "A faith awakening/transition can usher in unique experiences with grief and loss. At times a loss of identity, certainty, and connection to a community can occur. In this session, we'll utilize the latest grief and loss research to explore how faith transitions can help us more mindfully manage the cyclical nature and non-finite aspect of grief and loss. We'll highlight the complexity of grief often experienced in mixed-faith marriages and mixed-faith families. Concrete suggestions will be offered for creating stress-reduction plans and fostering support systems to reduce the chronic sorrow often associated with ongoing instances of loss and religious/spiritual difference.",
    "URL": "https://sunstonemagazine.com/audio/SL20164.mp3"
  },
  {
    "Audio": "SL20165",
    "Title": "How We Wrote Mormon History",
    "Presenters": "Joe Geisner, Polly Aird, Vickie Speek",
    "Description": "Every great book has a great backstory. The recently published book Writing Mormon History allows the reader to enter into the historian's world. Each chapter is written by a well-known historian describing the journey of writing books that have shaped our understanding of the Mormon past, offering an unprecedented glimpse into why they wrote these important works. Come join the editor and some of the authors of Writing Mormon History as they discuss the book and answer your questions.\n\n\nhttp://www.signaturebooks.com/product/writing-mormon-history/\n\nHere is Sunstone podcast about the book:\n\nhttps://www.sunstonemagazine.com/episode-64-writing-mormon-history-historians-and-their-books/?fbclid=IwAR1DDCScDoFVKU0GaZytuWbZxcRd9ZvF4qTFfyQ_nQ7ndThc1tEPuQBu8xI",
    "URL": "https://sunstonemagazine.com/audio/SL20165.mp3"
  },
  {
    "Audio": "SL20171",
    "Title": "Living Trees, Living Water, and the Renewal of the Earth",
    "Presenters": "Madison Daniels, Bob Rees, Kathryn Knight Sonntag, Patricia Karamesines",
    "Description": "Living Trees and Living Waters stand at the heart of spiritual traditions around the world. As potent symbols of sustainability and vitality, can these images help us construct a vision of Zion and a renewed Earth? The shadow of the Anthropocene hangs over us all as the threat of Climate Change grows each year. Can the living truths of the Divine Feminine and the words of Christ help us transform our relationship with each other and the Earth? Join as Kathryn Knight Sonntag, Patricia Karamesines, and Bob Rees share and discuss how Heavenly Mother and the Gospel of love could change the fate of the Earth.",
    "URL": "https://sunstonemagazine.com/audio/SL20171.mp3"
  },
  {
    "Audio": "SL20172",
    "Title": "Pastoral Hope for Spiritual Abuse",
    "Presenters": "Katie Langston, Gina Colvin",
    "Description": "The name of God should never be invoked to coerce, shame, or frighten people into compliance—yet in a culture of “worthiness interviews” and high-demand religious expectations,  this is an experience that is far too frequent. In this session, Gina Colvin and Katie Langston, seminarians and ministers, will explore how spiritual abuse damages a person’s relationship with the divine, how folks in high-demand religious systems can recognize and set healthy boundaries, and what appropriate pastoral care looks and feels like.",
    "URL": "https://sunstonemagazine.com/audio/SL20172.mp3"
  },
  {
    "Audio": "SL20174",
    "Title": "Ask the Truth and Transparency Foundation",
    "Presenters": "Ryan McKnight, Ethan Gregory Dodge",
    "Description": "The Truth & Transparency Foundation is responsible for revealing the pay rates of LDS General authorities, tying $32 billion to the LDS Church, and revealing the abuse that eventually led to the imprisonment of Sterling Van Wagenen. Come ask the founders anything.",
    "URL": "https://sunstonemagazine.com/audio/SL20174.mp3"
  },
  {
    "Audio": "SL20175",
    "Title": "The Struggles & Successes of Mormon Arts",
    "Presenters": "Emily Larsen; Mattathias Westwood; Michael Austin, LAZERos (Laz), Nathan Florence, Camilla Stark",
    "Description": "The ARCH-HIVE, a collective of eclectic Mormon artists, presents a panel on the struggles & successes of Mormon art in the past, present, and future. From the orthodox to the esoteric, the official to the underground, Mormon and Mormon-adjacent artists have used art of all forms to express their feelings on spirituality, the divine, and even Mormon culture itself. In this panel, a diverse roster of artists and scholars of Mormon arts will discuss topics including artistic license vs. orthodoxy, media and cultural taboos, current trends, the future of art in Mormondom, and what our artwork tells us about ourselves.",
    "URL": "https://sunstonemagazine.com/audio/SL20175.mp3"
  },
  {
    "Audio": "SL20176",
    "Title": "Reframing the Grief in a Mixed-faith Marriage",
    "Presenters": "Natasha Helfer Parker, LCMFT, CST; Sara Hughes-Zabawa; Jana Spangler; Jeff Lundgren, CMHC; Kattie Mount, Lisa Butterworth, Jennifer White, LCSW, Jenny Elledge, LMFT",
    "Description": "As more Mormons experience faith transitions and faith awakenings, many couples find themselves grieving their mixed-faith marriages. In this session, we will explore both personal and professional insights into honoring both the challenging and beautiful aspects of differing beliefs in a marriage. We will highlight the gifts associated with individualization and fostering mutual respect for each person’s spiritual journey. We will offer suggestions on reducing conflict, improving communication, and strengthening a couple's emotional connection and intimacy.",
    "URL": "https://sunstonemagazine.com/audio/SL20176.mp3"
  },
  {
    "Audio": "SL20191",
    "Title": "Closing Broadcast",
    "Presenters": "Martha Vasquez, Sara Fisk",
    "Description": "Closing Broadcast",
    "URL": "https://sunstonemagazine.com/audio/SL20191.mp3"
  },
  {
    "Audio": "SL20192",
    "Title": "Film: The Return of Elder Pingree – Memoir of a Departed Mormon",
    "Presenters": "Geoff Pingree",
    "Description": "THE RETURN OF ELDER PINGREE is a feature-length documentary film that follows lapsed Mormon Geoff Pingree as he retraces the steps he took 25 years earlier in Guatemala as devout missionary 'Elder Pingree.' He seeks to discover what has become of the Guatemalans who once trusted him with their religious faith, attempts to understand the violent political conditions he was ignorant of as a missionary, and grapples with the basic human question of how one might do good in the world.",
    "URL": "https://sunstonemagazine.com/audio/SL20192.mp3"
  },
  {
    "Audio": "SL20211",
    "Title": "Gaining from Grief; Living in Gratitude",
    "Presenters": "Doreika Carter",
    "Description": "As human beings we are bonded by one common thread: we all go through seasons. Grief and gratitude are examples of such seasons and how we adjust to and learn from the seasons will determine who we become and whether we will able to acompilsh our God-given purpose in life.",
    "URL": "https://sunstonemagazine.com/audio/SL20211.mp3"
  },
  {
    "Audio": "SL20212",
    "Title": "Mormons and Native Americans: Myths vs. Realities",
    "Presenters": "Sarah Newcomb, Joe Geisner, Andrew Hamilton",
    "Description": "Brigham Young is quoted as having said about Native Americans: \"It is cheaper to feed them than to fight them.\" Due to this and the Mormon belief that Native Americans are descended from the Book of Mormon people, it is a common myth that 19th-century Mormons were always kind to Native Americans.  The reality is that they drove Native Americans from their ancestral lands and committed a number of murders and even massacres against them.  This session will discuss the myths vs. the realities of Mormon and Native relations.",
    "URL": "https://sunstonemagazine.com/audio/SL20212.mp3"
  },
  {
    "Audio": "SL20213",
    "Title": "Make Your Own Manual: A Painting & Writing Workshop",
    "Presenters": "Jeannine Luke",
    "Description": "Church manuals are created by committee for a wide audience. Let's create a manual just for you, based on your thoughts, experiences, and values!   Using paint (watercolors, or watered down acrylics) and paper, we will create the \"container\" to hold your insights, resulting in an inspirational manual for life! No talent or experience needed! It will be a fun, relaxing, meaningful process.  \n\nCome prepared with water-based paints, a container of water, watercolor paper, a paint brush or two, and a pen. (A 9\"x12\" hot press is totally optional.)",
    "URL": "https://sunstonemagazine.com/audio/SL20213.mp3"
  },
  {
    "Audio": "SL20214",
    "Title": "Eternal Damnation, Outer Darkness, and the Reorganization of Intelligence",
    "Presenters": "Tom Bennett",
    "Description": "While lacking the lake of fire from mainstream Christianity, Mormonism proposes an equally terrifying “outer darkness.” What is the nature of this particular damnation and what have Mormon authorities and scholars said concerning it? Are some spirits really going to be lost forever in the depths of space? Is this a bad thing? How do intelligences play in to this? What is the nature of eternity? Is this a part of the plan of salvation, or a realm beyond it? Let's look into one of Mormonism's great mysteries and find what becomes of the damned.",
    "URL": "https://sunstonemagazine.com/audio/SL20214.mp3"
  },
  {
    "Audio": "SL20215",
    "Title": "Gratitude, and Some Grief, about Temple Changes",
    "Presenters": "Margaret Toscano",
    "Description": "When I heard last year about the changes in the temple ceremony, I was very happy that negative images and language about women had been removed. These changes eliminate the oppressive overlay that has made women feel like eternal second-class citizens. While these changes are mostly positive, they neither alter the underlying power structure of the temple nor challenge the exclusive male priesthood authority in the Church. This essay explains why I have mixed feelings about the changes: they subtly cover over imbalances and hide women’s independent right to the fullness of the Melchizedek priesthood.",
    "URL": "https://sunstonemagazine.com/audio/SL20215.mp3"
  },
  {
    "Audio": "SL20216",
    "Title": "The Making of a Modern Day Prophet",
    "Presenters": "Simeon Baker",
    "Description": "In this session I will explore the Life and Testimony of Gerald W. Peterson, Sr.  The details of his life and how he became a modern day Prophet  have mostly been known by his family and followers.  I will explore his faith transition from Christian to Latter-Day Saint to Prophet.  This session will provide rare insights into how Gerald, Sr. organized Christ's Church, built a Temple, and brought in the Times of Israel.",
    "URL": "https://sunstonemagazine.com/audio/SL20216.mp3"
  },
  {
    "Audio": "SL20221",
    "Title": "The Sexual \"What If\" Syndrome: Grieving our Sexual Development",
    "Presenters": "Natasha Helfer Parker, LCMFT, CST, Lisa Butterworth, Jennifer White, LCSW, Sara Hughes-Zabawa",
    "Description": "Many people who transition from orthodox Mormonism to either post or nuanced positions often revisit their sexual development journey as a youth and young adult. They often feel like many decisions were co-opted by the standards of the Church and are dealing with grief, anger, feelings of betrayal and the “what if?” syndrome. These “what if’s?” can be a normal part of the grief cycle and yet can also interfere with moving forward in sexually healthy ways. This session will address some of the common “what if’s?” that people deal with, as well as some strategies to move into healthier paradigms.",
    "URL": "https://sunstonemagazine.com/audio/SL20221.mp3"
  },
  {
    "Audio": "SL20222",
    "Title": "Learning to Better Support our Loved-one’s Faith Transition (Using recently published Church-approved Resources!)",
    "Presenters": "Trace Rogers, Lindsay Hansen Park",
    "Description": "For many people, navigating a faith crisis, transition, or transformation is a solo proposition with minimal support. Some recent books, including Bridges: Ministering to Those Who Question, can help people better support, engage with, understand, and maintain healthy connections to the one making such a transition. This session will discuss ways to help those within our circle of influence to gain knowledge from “Church-approved,” Deseret Book-available sources. The goal is to help everyone foster healthier relationships with those who question—whether they distance themselves or remain engaged with the Church.",
    "URL": "https://sunstonemagazine.com/audio/SL20222.mp3"
  },
  {
    "Audio": "SL20223",
    "Title": "Parents Just Don’t Understand: Redeeming Laman and Lemuel Using Family Systems Theory",
    "Presenters": "Paula Baker",
    "Description": "What if Laman and Lemuel actually decided to repent? How would their transformation affect family dynamics? How would it have forced Nephi to change? This presentation redeems Laman and Lemuel from a one-dimensional narrative using systems theory and a fanfiction approach to scripture. We’ll explore the context and communication within Lehi’s family and how patterns and scripts kept key players “stuck.” We’ll also make connections between psychology and theology, redefining the concepts of repentance and conversion.",
    "URL": "https://sunstonemagazine.com/audio/SL20223.mp3"
  },
  {
    "Audio": "SL20225",
    "Title": "Marriage and Polygamy",
    "Presenters": "Kenneth Card",
    "Description": "This session argues that a scriptural look at the history of marriage in the LDS Church since its beginning shows that a man should have only one wife and that polygamy has never been a commandment from God.",
    "URL": "https://sunstonemagazine.com/audio/SL20225.mp3"
  },
  {
    "Audio": "SL20226",
    "Title": "How Hearts Are Changed: Learning to Affirm LGBTQ Journeys",
    "Presenters": "Christina Dee, Kris Irvin, Heather Robertson",
    "Description": "Many Latter-day Saints are filled with fear and uncertainty when they learn that they or their loved ones are LGBTQ. In this session, the presenters will share how they are learning to embrace and affirm themselves and their LGBTQ family and friends. Where they once felt grief, they now feel peace. They are learning to sit with the complexity of LGBTQ acceptance while participating in a church whose core theology is structured around heteronormative ideals and defined gender roles. They have found gratitude in this journey and consider it a blessing.",
    "URL": "https://sunstonemagazine.com/audio/SL20226.mp3"
  },
  {
    "Audio": "SL20231",
    "Title": "A Marvelous Work and...I Wonder:  Finding Solid Footing in the Gospel of Jesus Christ While Walking through Shadows of Doubt about the Restoration",
    "Presenters": "Daniel Glenn Line",
    "Description": "Many church members will reach a point in their faith journey where they ask if what they believe is true. This crossroad will come with feelings trust and betrayal, confidence and confusion. The pain of such times can cause many people to divorce themselves from both their faith and source of that faith.  Being able to \"Prove all things, hold fast that which is good\" (1 Thessalonians 5:21) in the midst of this struggle can be a source of growth necessary to maintain faith in Christ.",
    "URL": "https://sunstonemagazine.com/audio/SL20231.mp3"
  },
  {
    "Audio": "SL20232",
    "Title": "Social Liberals, Church Patriarchs, and Mormon Racial Dogma, 1945-1978",
    "Presenters": "Robert Greenwell",
    "Description": "No issue caused the LDS Church more grief in the twentieth century than restricting people of black African origin from receiving priesthood ordination and temple rites.  Following World War II there was an energetic movement to eliminate segregation and discrimination everywhere in the United States. LDS Church leaders stubbornly opposed this powerful movement in spite of strong pressure from both inside and outside the church to end these practices. This session explores the interaction between that movement and the LDS church.",
    "URL": "https://sunstonemagazine.com/audio/SL20232.mp3"
  },
  {
    "Audio": "SL20233",
    "Title": "LGBTQIA+ Experiences in Mormonism",
    "Presenters": "Kris Irvin, Tiana Matson, Mika McIntosh, Nicholas R. Stewart",
    "Description": "Often absent in the larger LDS conversations is the voice of LGBTQIA people. This session will feature LGBTQIA+ individuals sharing their experiences in and around Mormonism.",
    "URL": "https://sunstonemagazine.com/audio/SL20233.mp3"
  },
  {
    "Audio": "SL20234",
    "Title": "Growing out of Evergreen",
    "Presenters": "Jahn Curran, Ken McFayden",
    "Description": "Growing out of Evergreen",
    "URL": "https://sunstonemagazine.com/audio/SL20234.mp3"
  },
  {
    "Audio": "SL20235",
    "Title": "How Grief Permanently Changes You",
    "Presenters": "Mette Ivie Harrison",
    "Description": "When you are grieving, people often want to help you \"get through it,\" as if there is some point at which you'll go back to being who you once were. The reality is that grief never ends, that you will be forever changed, and that there are people who will not be able to go on this journey with you. This session presents real talk about what the grieving process does to you and how the people around you will perceive your grief (hint: they go kind of crazy).",
    "URL": "https://sunstonemagazine.com/audio/SL20235.mp3"
  },
  {
    "Audio": "SL20236",
    "Title": "Folksong of the Fringe",
    "Presenters": "David Harris",
    "Description": "Since my teenage years, I've been interested in songwriting as a way to document my experiences. Religion was a big part of my life in my early years while growing up in a Mormon family and serving a mission in the early 1980s. Faith, doubt, rebellion, heresy, mysticism, ecumenicism and universalism all have their expression in my songs. \n\nI studied music composition at BYU, and I've written instrumental music for small ensembles and also worship music, such as hymn arrangements and choral music, but only my songs will be featured in this session.",
    "URL": "https://sunstonemagazine.com/audio/SL20236.mp3"
  },
  {
    "Audio": "SL20241",
    "Title": "Bengt Washburn Comedy Show",
    "Presenters": "Bengt Washburn",
    "Description": "Bengt Washburn Comedy Show",
    "URL": "https://sunstonemagazine.com/audio/SL20241.mp3"
  },
  {
    "Audio": "SL20251",
    "Title": "Why We Stay",
    "Presenters": "Caleb Jones, Julie de Azevedo Hanks, Farina King, Bob Ahlander",
    "Description": "This perennially well-received session features the stories of those who have chosen to remain active, dedicated Latter-day Saints even in the face of challenges to traditional faith.",
    "URL": "https://sunstonemagazine.com/audio/SL20251.mp3"
  },
  {
    "Audio": "SL20261",
    "Title": "\"I'll Never Not Be Mormon\": The Impact of Disaffiliation on Identity and Womanhood",
    "Presenters": "Emily Janes",
    "Description": "When women leave the LDS Church many are left navigating changes regarding what womanhood means to them and how it impacts their daily choices. This presentation summarizes the results of Emily Janes’ thesis on how the process of disaffiliation from the Church impacts women’s views of their womanhood. Interviews with 25 women who have disaffiliated from the church provide insight into the socialization of women in the Church, the pain and grief they feel as they deconstruct their beliefs through the process of disaffiliation, and the peace many feel from unbinding their views on womanhood.",
    "URL": "https://sunstonemagazine.com/audio/SL20261.mp3"
  },
  {
    "Audio": "SL20262",
    "Title": "Finding Peace & Gratitude Amidst the Calamities of Life",
    "Presenters": "Tim Williams",
    "Description": "When others afflict us, when life afflicts us, we can find peace and gratitude amidst the pain and loss",
    "URL": "https://sunstonemagazine.com/audio/SL20262.mp3"
  },
  {
    "Audio": "SL20263",
    "Title": "Mormons like me? Identity as Problem and Solution",
    "Presenters": "Jordan K Harmon",
    "Description": "Who do we belong to and how does identification motivate and shape our lives? Identification with our ego and our groups is inevitable and yet presents sticky problems. This session proposses that perpetual loss of identity is congruent with both spiritual and secular frameworks. A radical reading of Christ’s identity points us toward identifying with context over content. Grief over loss of illusions of self and other are replaced with expanding gratitude.",
    "URL": "https://sunstonemagazine.com/audio/SL20263.mp3"
  },
  {
    "Audio": "SL20264",
    "Title": "How Evangelical Critics View Mormon Origins",
    "Presenters": "Ryan Wimmer",
    "Description": "Continuing Ryan Wimmer’s theme from the  2018 Sunstone Symposium of why Evangelicals fail to convert Mormons, we turn to how Joseph Smith and Mormon origins compare to fundamentalist Christianity historically. Evangelicals frequently use dichotomies such as Mormonism vs. Biblical Christianity, Joseph Smith vs. the Bible, etc., highlighting the inconsistencies between the two. This presentation argues that, when compared to the Bible, Joseph Smith possesses superior historical documentation and witnesses to founding events. The beginnings of Christianity suffer from similar and greater inconsistencies and historical problems.  This weakness of Christian ministries to Mormons results in very few ex-Mormons becoming another type of Christian.",
    "URL": "https://sunstonemagazine.com/audio/SL20264.mp3"
  },
  {
    "Audio": "SL20265",
    "Title": "How Is the Church Really Doing?: Some Uncorrelated Statistics",
    "Presenters": "Brian Simper",
    "Description": "The LDS church releases loads of statistics, and they imply many more.  This is a brief (and possibly entertaining) look at the LDS Church's demographic profile and how its may need to change in order to meet future demands. Information is drawn from official reports and almanacs.  Comparisons will be made with other churches and even the early Christian church. We can’t see the future, but historyans statitstics might help us see its outlines.",
    "URL": "https://sunstonemagazine.com/audio/SL20265.mp3"
  },
  {
    "Audio": "SL20266",
    "Title": "Married to My Faith Crisis",
    "Presenters": "Celeste Davis",
    "Description": "In 2014, I did something stupid and wonderful. Despite being woefully under-qualified, I started a blog about marriage. Due to a lot of work and a lot of luck, it picked up traction and became my job. Around 2017, a faith crisis tornado-ed into my life, leaving a lot of grief and little gratitude in its wake. Strangely, it was the research I was reading on how to make marriages thrive that again and again seemed to provide me the exact wisdom I needed for my faith crisis. I’ve found that the tools necessary to navigate both journeys are the same.",
    "URL": "https://sunstonemagazine.com/audio/SL20266.mp3"
  },
  {
    "Audio": "SL20272",
    "Title": "Does God Care about Aesthetics?: A Dialogue",
    "Presenters": "Clifton Jolley, Bob Rees",
    "Description": "Will heavenly beings go to services in a grand church like Gaudi’s La Sagrada Familia or something akin to the Provo Temple? Will such a building be adorned with Rafael’s paintings or propagandistic illustrations by Mormon artist Jon McNaughton? Will the Telestial Kingdom hear only Muzak while Celestial Choirs inspire with the Hallelujah Chorus? Bob Rees will argue that God inspires great art of all kinds, while Clifton Jolley will argue that aesthetically superior expressions have little to do with glory. Is there anything in Mormon theology suggesting a celestial or heavenly aesthetic such as Rees imagines and Jolley argues against?",
    "URL": "https://sunstonemagazine.com/audio/SL20272.mp3"
  },
  {
    "Audio": "SL20273",
    "Title": "No More Apologies: Scholars Talk About Their Lives After Leaving Apologetics",
    "Presenters": "Bryce Haymond, Jonathan H. Westover, Robin Linkhart, Radio Free Mormon",
    "Description": "This panel will explore the journey of former LDS apologists and scholars as they moved out of apologetics and into new arenas of their faith.",
    "URL": "https://sunstonemagazine.com/audio/SL20273.mp3"
  },
  {
    "Audio": "SL20274",
    "Title": "Grief & Gratitude in Poetry: A Reading of Signature Books Poets",
    "Presenters": "Dayna Patterson; Marilyn Bushman-Carlton, Lisa Bickmore, Susan Elizabeth Howe, Warren Scott Hatch",
    "Description": "Signature Books has a rich history of publishing high quality poetry from a broad range of Mormon poets. In this reading, poets published by Signature over the past 25 years will gather together to read poems of grief and gratitude.",
    "URL": "https://sunstonemagazine.com/audio/SL20274.mp3"
  },
  {
    "Audio": "SL20275",
    "Title": "LDS Artists of Color: An Introduction",
    "Presenters": "Esther Hi’ilani Candari; Marlena Wilding; Andi Pitcher Davis; Kalani Tonga; Michelle Franzoni Thorley, Margaret Blair Young, Tshoper Kabambi, Kwani Povi Winder",
    "Description": "The future of Mormon art, like the future of the Mormon people, lies with its global, diverse, and multicultural population. This session highlights the work of five women of color whose work is transforming the landscape of Mormon visual art. All of these artists invite and challenge questions about culture and faith.\n\nView and shop the work of the featured artists: \n\nMarlena Marie Wilding.  https://www.marlenawilding.com\nEsther Hi'lani Candari    https://www.hiilanifinearts.com\nMichelle Franzoni Thorley  https://florafamiliar.com\nKwani Winder    http://www.kwaniwinder.com\nKalani Tonga  https://www.facebook.com/kalani.a.tonga",
    "URL": "https://sunstonemagazine.com/audio/SL20275.mp3"
  },
  {
    "Audio": "SL20276",
    "Title": "El paisaje del feminismo mormón en México",
    "Presenters": "Anya Tinajero Vega, Juliana Castro",
    "Description": "El paisaje del feminismo mormón en México",
    "URL": "https://sunstonemagazine.com/audio/SL20276.mp3"
  },
  {
    "Audio": "SL20291",
    "Title": "Closing Broadcast Keynote",
    "Presenters": "Fatimah Salleh, Robin Linkhart",
    "Description": "Closing Broadcast Keynote",
    "URL": "https://sunstonemagazine.com/audio/SL20291.mp3"
  },
  {
    "Audio": "SL20311",
    "Title": "Mercy: A Devotional",
    "Presenters": "Bob Rees, Gloria Gardner Rees",
    "Description": "Everyone needs mercy because everyone faces questions of justice. And everyone needs to be merciful because, as Shakespeare says, it is a virtue that is “twice blest”/It blesseth him that gives and him that takes.” Shakespeare also identifies mercy as “an attribute of God himself.” The Psalms say God’s mercy “endures forever.” As a virtue, mercy encompasses other virtues such as compassion, kindness, generosity, and gentleness. It is also a gift of grace and love. This devotional explores the virtue of mercy and its essential place in human and divine relationships.",
    "URL": "https://sunstonemagazine.com/audio/SL20311.mp3"
  },
  {
    "Audio": "SL20312",
    "Title": "First and Second Vision Stories: Development, History, and Magic",
    "Presenters": "H. Michael Marquardt, Clair Barrus",
    "Description": "1st paper: This paper will present the historical background to the earliest and most complete written accounts of the first vision of Joseph Smith. The three most important descriptions were provided in 1832, 1835 and 1839, and all have different backgrounds and emphasis. Early developments came in 1835 when theological changes were being made in the Church. The most detailed telling was made during a period of persecution. \n2nd paper: Smith family magic practices are well attested. But the relationship between obtaining plates of gold from a messenger, and Joseph Smith's practice of magic remains unclear. Did Joseph Smith's use of an 1801 book on ceremonial magic assist him in his quest for gold plates? I look at Francis Barrett's The Magus and parallels to Lucy’s account of her son’s attempts to obtain the plates, including his encounters with good and evil beings, magic circles, the deity Abrac, and more. What can be learned from Lucy Mack Smith's reminiscences and the instructions on ceremonial magic from The Magus?",
    "URL": "https://sunstonemagazine.com/audio/SL20312.mp3"
  },
  {
    "Audio": "SL20313",
    "Title": "No Industrial Revolution, No Latter-19th-Century (and later) Mormonism: How a Religion Founded in America Became Largely British",
    "Presenters": "George Richard Compton",
    "Description": "Had not its main body moved to the inter-mountain west, the Church would not have grown and prospered that way it did.  In order to achieve an economically self-sustaining societal critical mass in an inhospitable environment, Brigham Young, the industrialist, needed a large number of workers possessing post-agrarian vocational skills and the motivation and financial wherewithal to pick up and relocate.  Uniquely able to satisfy that need was post-industrial-revolution Great Britain, which provided about three-quarters of the 60,000 to 70,000 Saints who had immigrated to the Salt Lake Valley by 1868.",
    "URL": "https://sunstonemagazine.com/audio/SL20313.mp3"
  },
  {
    "Audio": "SL20314",
    "Title": "In Search of a Larger God",
    "Presenters": "Susan Meredith Hinckley",
    "Description": "I used to feel like I needed a bigger church, but behind that need was actually a more fundamental one: the need for a larger God. When my children left Mormonism, they somehow took with them my belief in the Heavenly Father that had been the center of our religious life. Regaining my spiritual footing has required a new kind of faith: a turning away from the confines of what I had been taught and toward what I have seen and lived for myself. In re-envisioning my God, I am reinventing my faith.",
    "URL": "https://sunstonemagazine.com/audio/SL20314.mp3"
  },
  {
    "Audio": "SL20315",
    "Title": "The 3000 year old Shemitah of the Bible and the Mysterious Economic Effect Today",
    "Presenters": "David Patrick",
    "Description": "As a financial services professional, and someone who studies religion, I was easily attracted to a book about the Mystery of the Shemitah by Jonathan Cahn that promised to cover both subjects with a bold unveiling of \"last days\" connections. When I found this mystery of the Shemitah in 2015 it put me on a path of discovery (and blew my mind!) on the unseen hand of God in the sculpting of nations, economies, people, and places.  This presentation will follow that journey and insert some other latter day saint prophecies and warning that many will find intriguing and timely.",
    "URL": "https://sunstonemagazine.com/audio/SL20315.mp3"
  },
  {
    "Audio": "SL20316",
    "Title": "Feminist Geneology as Spiritual Practice",
    "Presenters": "Ariel Wootan Merkling",
    "Description": "Owning our story can be an important step in transforming grief to gratitude. Learn about ways to engage feminist genealogy as a way to connect with your story, find your voice and wrestle with complicated intersections of history, spirituality, and meaning.",
    "URL": "https://sunstonemagazine.com/audio/SL20316.mp3"
  },
  {
    "Audio": "SL20321",
    "Title": "Nauvoo Polygamy and the RLDS Church",
    "Presenters": "Lachlan Mackay",
    "Description": "Community of Christ (a.k.a. the RLDS Church) has a long and complicated relationship with Nauvoo polygamy. Although consistent in its opposition to the practice, the understandings of members and leaders regarding the introduction of plural marriage have evolved in surprising ways through the years, and the response to that evolution mirrors the Kübler-Ross model of the five stages of grief. Defined for generations by its battles with The Church of Jesus Christ over polygamy, Community of Christ in recent decades has begun to make peace with its past.",
    "URL": "https://sunstonemagazine.com/audio/SL20321.mp3"
  },
  {
    "Audio": "SL20322",
    "Title": "\"They have lost their love\": Grief and Tragedy in the Book of Mormon",
    "Presenters": "Gary Ettari",
    "Description": "This paper examines the grief Moroni expresses at the conclusion of the Book of Mormon and argues that it renders the work as a whole a tragedy, as the term is defined by the philosopher Stanley Cavell. Cavell suggests in several works that tragedy is closely associated with both alienation and skepticism, that it is “a refusal to know or to be known, an avoidance of acknowledgement.”  I apply Cavell’s definition of tragedy to the books of Ether and Moroni in order to explain both the actions of the Jaredites and the grief that Moroni feels as he witnesses and records the Nephites' destruction .",
    "URL": "https://sunstonemagazine.com/audio/SL20322.mp3"
  },
  {
    "Audio": "SL20323",
    "Title": "Real War in the Book of Mormon: The Gadianton Robbers of Ancient Rome",
    "Presenters": "Jared Manning",
    "Description": "Book of Mormon events involving Gadianton Robbers bear striking resemblances to conflicts in ancient Rome described by historians Sallust and Tacitus. Sallust recounts an unsuccessful coup attempt similar to events in the Book of Helaman while Tacitus tells of a war in north Africa resembling events in 3 Nephi. Similarities include essential characteristics of the people involved such as motives and government operations; military objectives and tactics, both on the battlefield and in diplomatic efforts; and the close timing of parallel events. Mormon even resembles Roman historians in biographical experiences, moralizing tone, and use of Roman historiographical conventions.",
    "URL": "https://sunstonemagazine.com/audio/SL20323.mp3"
  },
  {
    "Audio": "SL20324",
    "Title": "Spiritual Bypassing in the Bishop’s Office: When Help Turns to Harm",
    "Presenters": "Paula Baker",
    "Description": "Take a trip down the rabbit hole! This presentation discusses spiritual bypassing using an Alice in Wonderland analogy. Don’t know what spiritual bypassing is? You may not know the term, but you’ve probably encountered the phenomenon. Spiritual bypassing occurs when people use spiritual ideas or practices to avoid facing painful psychological or emotional wounds. This presentation defines spiritual bypassing, gives examples of how it occurs at individual and cultural levels, and outlines potential ways to discern positive religious coping from harmful avoidance behaviors.",
    "URL": "https://sunstonemagazine.com/audio/SL20324.mp3"
  },
  {
    "Audio": "SL20325",
    "Title": "The Bear River Massacre: A Shoshone History",
    "Presenters": "Darren Parry, Andrew Hamilton",
    "Description": "The recently released book, \"The Bear River Massacre: A Shoshone History\", by Darren Parry, Chairman of the Northwestern Band of Shoshone, is the first book to tell the story of “the largest massacre of Native Americans by federal troops in the history of the United States” from the perspective of the Shoshone Nation. In this session Chairman Parry, a direct descendant of Massacre survivor Chief Sagwitch, will tell the story of the massacre from the perspective of the Shoshone Nation and speak about what the Shoshone Band is doing today and their plans to build an Interpretative Center at the site of the Massacre",
    "URL": "https://sunstonemagazine.com/audio/SL20325.mp3"
  },
  {
    "Audio": "SL20331",
    "Title": "Viewing the Bible through Restoration Scripture",
    "Presenters": "John Hamer",
    "Description": "The academic disciplines of history and literary criticism were in their infancy in the early 19th century.  Although Christians were becoming aware that some Biblical passages, read literally, were in error (cf. Joshua commanding the sun to stand still), Joseph Smith’s own work at Bible revision (the “Inspired Version” or “Joseph Smith Translation”) illustrate the hope that these errors could be corrected with minor edits. Many Christians naively assumed that the Bible was the direct word of God, spoken in God’s own voice to prophets, apostles, and evangelists whose role was functionally equivalent to a dictaphone. As such, any errors found in the text must be the work of Medieval scribes and copyists.\n\nAfter centuries of study, as history and literary criticism have matured as disciplines, it has become clear that the Medieval scribes and copyists were relatively faithful and skilled. The errors in Biblical text came from the original authors: the flawed prophets, apostles, and evangelists, who were subject as all humans are to the limitations of their own time and place in history.  It is now very clear that the Bible is not a history book and many of its stories from Genesis to Jesus’ nativity have no historical basis.  It’s ever more clear that if the dichotomy is between “history” and “fiction,” much of the Bible’s component texts are fictional. Many of these fit within the definition some scholars have given for “pious fraud.”\n\nAlthough the Book of Mormon describes a “history” of ancient America widely accepted among European Americans in the early 19th century, it’s central narrative (the “Moundbuilder” thesis) has subsequently been proved false.  In composing the Book of Mormon and other scriptures, Joseph Smith was not recovering actual history, spoken to him by God’s own voice like a dictaphone. Instead the stories are his own, human composition. If inspired, these are human responses to the Divine, just as the works of ancient authors, if inspired, are human responses to the Divine.  When Joseph Smith composed original stories about Abraham and Moses, he was not recovering history. Neither figure existed in history. However, he may have been doing something quite similar to what the ancient authors of Genesis and Exodus were doing in composing their own stories about Abraham and Moses.",
    "URL": "https://sunstonemagazine.com/audio/SL20331.mp3"
  },
  {
    "Audio": "SL20332",
    "Title": "Healing Mormon Trauma Through Self-expression",
    "Presenters": "Kimberly Anderson, Heather Cooke",
    "Description": "\"Art is a wound turned into light.\"\n\n~ Georges Braque \n\nThis presentation will explore how art, personal expression, and narrative therapy can be used as a modality for healing from trauma.",
    "URL": "https://sunstonemagazine.com/audio/SL20332.mp3"
  },
  {
    "Audio": "SL20333",
    "Title": "Ethical Approaches to Scholarship about Vulnerable Communities",
    "Presenters": "Lindsay Hansen Park, Cristina Rosetti",
    "Description": "Cristina Rosetti will ask the question, \"Who has the authority to speak on behalf of marginalized religious\ncommunities in Mormon Studies?\"\nLindsay Hansen Park will speak on the impact of research, advocacy, and scholarship on fundamentalist\nMormon communities.\"",
    "URL": "https://sunstonemagazine.com/audio/SL20333.mp3"
  },
  {
    "Audio": "SL20334",
    "Title": "The Demise of the Patriarchal Priesthood",
    "Presenters": "Jacob Vidrine",
    "Description": "It is commonly accepted that women in early Mormonism were considered as having received the Melchizedek Priesthood through participation in temple rituals. It is also taken for granted that this understanding was lost over time. What hasn’t been explicitly discussed before is that this loss of understanding that women received priesthood through the temple rituals was accompanied by a loss of understanding that men also received additional higher priesthood authority in the temple. This presentation will document important sources regarding women and the priesthood, as well as when and how church leaders after Joseph Smith minimized temple priesthood authority.",
    "URL": "https://sunstonemagazine.com/audio/SL20334.mp3"
  },
  {
    "Audio": "SL20335",
    "Title": "Avoiding Grief within the Non-Monogamy Option",
    "Presenters": "Natasha Helfer Parker, LCMFT, CST",
    "Description": "As a therapist who specializes in marriage, sexuality, and faith transitions, Natasha has noticed that many couples decide to open their marriages for a variety of reasons during or after a shift in LDS religious belief or orthopraxy. This is of particular interest for two reasons: 1) we mirror a trend in the larger culture that is becoming more comfortable defining relationships outside of typical monogamous structures, and 2) the history we have with Mormon polygamy. This session will offer considerations, discussion, and strategies to help couples navigate these new possibilities in effective, strength-building ways.",
    "URL": "https://sunstonemagazine.com/audio/SL20335.mp3"
  },
  {
    "Audio": "SL20336",
    "Title": "Stronger Together: How to Communicate through Differences of Faith and Belief",
    "Presenters": "Riley Ostlund, Angelica Lloyd, Nicholas R. Stewart",
    "Description": "This session provides some examples in how to maintain relationships and communicate with people who don’t share your same faith or belief.",
    "URL": "https://sunstonemagazine.com/audio/SL20336.mp3"
  },
  {
    "Audio": "SL20341",
    "Title": "Lunch Broadcast Pushed to the Edge: A Historical Discourse Analysis of the Intersections of Feminism, Transgender Healthcare, and Mormonism",
    "Presenters": "Stacey Jackson Roberts, Aimee Evans Hickman",
    "Description": "In recent years, gender transitions and the lives of transgender people have been thrust into the consciousness of greater society, yet many remain unaware of the historical interplay of transgender healthcare and radical feminism on historical and contemporary Mormon (LDS) policies and viewpoints. Using her academic training in intersectional feminism, clinical social work, historical discourse analysis, and principles of anti-oppression, Stacey will examine the interconnected histories between healthcare, feminism, and Mormonism, and the likely implications for the marginalization of transgender people within Mormonism.",
    "URL": "https://sunstonemagazine.com/audio/SL20341.mp3"
  },
  {
    "Audio": "SL20351",
    "Title": "How Faith and Rationality Are Incompatible",
    "Presenters": "Spencer Wright",
    "Description": "Of course all are free to believe whatever they want (as long as they’re not harming others), but not every belief is rational.  In this presentation, Spencer Wright will demonstrate the ways in which faith-based beliefs are incompatible with rationality.  Recognition of this incompatibility can be both a cause for grief and a cause for gratitude. We’ll look at it from both angles.",
    "URL": "https://sunstonemagazine.com/audio/SL20351.mp3"
  },
  {
    "Audio": "SL20352",
    "Title": "Lifting the Lamanite Curse: How Human Genomics is Exposing Mormon Myths",
    "Presenters": "Simon Southerton",
    "Description": "The prophet Joseph Smith’s claim that the Book of Mormon is a translation of the recovered writings of ancient American prophets has attracted intense scrutiny from the day it was published. As a consequence, the Book’s historicity needed to be defended from detractors and promoted to the faithful. Recent whole-genome studies on thousands of Indigenous Americans and Polynesians has failed to find a trace of ancient Book of Mormon Israelites in the pre-Columbian Americas or in the Pacific. There is now an enormous body of scientific evidence that raises serious questions about the history it presents, the racist ideas it contains, its use to erase indigenous culture and the value of persisting with vanishing Lamanite apologetics.",
    "URL": "https://sunstonemagazine.com/audio/SL20352.mp3"
  },
  {
    "Audio": "SL20353",
    "Title": "Achieving Zion: The Impact of Racism on Becoming One",
    "Presenters": "Mica McGriggs, Ph.D.",
    "Description": "Systemic racism is present in all communities, and Mormonism has uniquely benefitted from white-supremacy. During this session Dr. Mica McGriggs a psychologist and racial equity educator, will lead an exploration of the theological, relational, and personal aspects of racism. “Zion” cannot be achieved unless the sin of racism is rooted out and repented of. Restitution must be made within ourselves and our community. White Mormons all along the spectrum of orthodoxy must reconcile with their history and mythologized racial innocence in order to truly become one with self and community.",
    "URL": "https://sunstonemagazine.com/audio/SL20353.mp3"
  },
  {
    "Audio": "SL20354",
    "Title": "Author Meets Critics \"The Whites Want Every Thing: Indian-Mormon Relations, 1847–1877\"",
    "Presenters": "Andrew Hamilton; Will Bagley, Darren Parry, Sarah Newcomb, Elise Boxer",
    "Description": "The Whites Want Every Thing, by Will Bagley, explores the Native American view of Mormon and \"Indian\" relations during the years 1847-1First, Bagley will discuss his book. Then Native American leaders and scholars will share their views on the book and on the myths and realities of Mormon and Indian relations. Did 19th-century Mormons really follow the adage to feed, not fight the Native Americans? Learn real history from scholars and descendants of those who were pushed from their lands by the Mormon's arrival in the West.",
    "URL": "https://sunstonemagazine.com/audio/SL20354.mp3"
  },
  {
    "Audio": "SL20355",
    "Title": "Mormon Women in Art: Where We've Been and Where We're Going",
    "Presenters": "Margaret Olsen Hemming, Rosie Gochnour Serago, Michelle Franzoni Thorley",
    "Description": "Mormon art sometimes places women in submissive, peripheral, secondary roles. The explosion of art by Mormon women in the last decade has changed that. This session will address how social media has made space for women without traditional representation or financial backing to form successful careers in the arts. We will discuss how Mormon women of color are creating art that mixes their family culture with doctrine, creating results that look very different from what we typically see on our church building walls.",
    "URL": "https://sunstonemagazine.com/audio/SL20355.mp3"
  },
  {
    "Audio": "SL20356",
    "Title": "To the Mother in Heaven in Grief and Gratitude",
    "Presenters": "Janice Allred",
    "Description": "In 1994 I published my first essay on the Mother in Heaven, \"Toward a Mormon Theology of God the Mother,\" which led to my excommunication from the LDS Church in 1Although this continues to be a source of grief in my life, I am grateful for the scriptures revealed by Joseph Smith. They have been a rich and powerful resource for developing a Christian theology of God the Mother. In this paper I will discuss my search for God the Mother and give some of the highlights of the theology I have developed.",
    "URL": "https://sunstonemagazine.com/audio/SL20356.mp3"
  },
  {
    "Audio": "SL20361",
    "Title": "PLAN 10 FROM OUTER SPACE -- 25th Anniversary Screening and Q & A with Trent Harris",
    "Presenters": "Trent Harris, Andrew Hamilton, Stefene Russell",
    "Description": "PLAN 10 FROM OUTERSPACE, described as “Nancy Drew on acid,” is a science fiction mystery movie based on Mormon history and symbolism. It stars Karen Black and Stefene Russell. Premiering at Sundance, PLAN 10 has become a Mormon cult classic. \n\nWatch PLAN 10 at the recorded video link below before Saturday, August 1st and then join us live for the Q&A! This session will be a Q & A with PLAN 10's director Trent Harris.",
    "URL": "https://sunstonemagazine.com/audio/SL20361.mp3"
  },
  {
    "Audio": "SL20362",
    "Title": "Psychedelics, Healing, and Spirituality",
    "Presenters": "Stephen H. Urquhart, Sara Urquhart",
    "Description": "This session will discuss the medical, spiritual, and inspriational uses of psychedelic substances, as well as medical uses and safety tips.",
    "URL": "https://sunstonemagazine.com/audio/SL20362.mp3"
  },
  {
    "Audio": "SL20363",
    "Title": " Mormonism and Community",
    "Presenters": "Dallin Johnson, Anthony Miller, Nicholas R. Stewart",
    "Description": "The Mormon Church can be a very comfortable community for many people. Some people stay in the church because of the community. Many who leave struggle to find a new community. This panel explores the topic of community in the broader spectrum of Mormonism, whether in or out of the Church.",
    "URL": "https://sunstonemagazine.com/audio/SL20363.mp3"
  },
  {
    "Audio": "SL20364",
    "Title": "The First Vision in Poetry",
    "Presenters": "Bob Rees; Dayna Patterson; Bruce Jorgensen; Kathryn Knight Sonntag; Dennis Clark; Javen Tanner, Clifton Jolley, R.A. Christmas, Gloria Rees",
    "Description": "Two hundred years ago Joseph Smith walked into the woods near his family farm and experienced the founding vision of the Restoration. While theologians and scholars have debated the veracity and contours of Joseph’s theophany, painters and poets have attempted to capture its essence in pigment and verse. This session presents examples of both visual and verbal expressions that have attempted to capture what happened on that spring day in 1820 when the heavens were opened to usher in the Last Dispensation. We will include examples of Latter-day Saint art and readings of Latter-day Saint poetry.",
    "URL": "https://sunstonemagazine.com/audio/SL20364.mp3"
  },
  {
    "Audio": "SL20365",
    "Title": "Entheogens in Occult Traditions and the Visionary World of First Nephi",
    "Presenters": "Bryce Blankenagel, Brian Kassenbrock",
    "Description": "Post-enlightenment magic and occult grimoires and handbooks seamlessly blend the spiritual and physical, often obscuring naturalistic mechanisms to achieve incantations, spells, hexes, or conjurations. The Book of Mormon similarly blends the spiritual and physical to obscure the presence of entheogens to uninitiated readers.\nEarly Mormon experiences suggest the use of hallucinogenic substances, common at the time. The First Book of Nephi’s first episodes revolve around Lehi’s visions and then a complex serial vision from his son Nephi.  Both suggest hallucinogen use. In the latter part of 1st Nephi, there is an active debate on the role of visions.",
    "URL": "https://sunstonemagazine.com/audio/SL20365.mp3"
  },
  {
    "Audio": "SL20366",
    "Title": "Latter-day Saint Morals and \"The End of White Christian America\"",
    "Presenters": "Rod Decker",
    "Description": "The End of White Christian America, is a book  by Robert P. Jones showing that most white churches are losing members. Jana Riess also shows Latter-day Saint growth slowing, presenting evidence that young people are leaving partly because of the LDS Church’s moral and political conservatism. \n This presentation looks at Reiss’s and Jones’s evidence, at how white Christianity and Latter-day Saints have fared historically, and at surveys showing Latter-day Saint attitudes towards the moral conservatism of their churches. The presentation argues that liberalizing Latter-day Saint morals is unlikely to boost its membership.",
    "URL": "https://sunstonemagazine.com/audio/SL20366.mp3"
  },
  {
    "Audio": "SL20371",
    "Title": "Harnessing the Power of Vulnerability as a Spiritual Practice",
    "Presenters": "Sara Hughes-Zabawa, Jana Spangler",
    "Description": "Vulnerability has been an underappreciated and underutilized virtue in LDS culture. Through her research, Brené Brown has opened up a global conversation about the power of vulnerability in our personal and institutional lives. In this session, we will talk about how vulnerability could help the Church and its members live up to their Christian potential more fully, and how it could help those who are grappling with their faith move through their grief empowered with more support, hope, and confidence.",
    "URL": "https://sunstonemagazine.com/audio/SL20371.mp3"
  },
  {
    "Audio": "SL20372",
    "Title": "Could Addressing the Gender of God Help Heal the World?",
    "Presenters": "Carol Lynn Pearson",
    "Description": "What if it never was intended that in the heavens there be a near-total eclipse of the Female Divine? What if half of God has been continually present but not accounted for? What if the disappearance of the Mother from history and from religion is not a cold case but can be cracked wide open? What if we Latter-day Saints have a rare opportunity and obligation never again to propose the nebulous claim that somehow, hidden, there’s a Mother there—but to firmly declare that there’s a Mother—there—here—and now—taking her place at the Family Table in absolute and divine Partnership with the Father? Let’s talk about it. And let’s share some of the radical poems in my soon to be released book, Finding Mother God: Poems to Heal the World.",
    "URL": "https://sunstonemagazine.com/audio/SL20372.mp3"
  },
  {
    "Audio": "SL20372",
    "Title": "A Reading by BCC Press's Newest Authors",
    "Presenters": "$1, Twila Newey; Melody Newey Johnson, Andi Pitcher Davis, Michael Austin, Margaret Olsen Hemming",
    "Description": "This session wil feature three of BCC Press's newest authors reading from their work. Twila Newey will read from her novel, Sylvia, which explores faith and family when four sisters come together as adults when their mother, and the matriarch of their extended Mormon family, dies suddenly in an automobile accident. Melody Newey Johnson will read from her book An Imperfect Roundness, a collection of poetry that explores the lived experience of womanhood, motherhood, aging, loss, and healing through spiritual inquiry grounded in faith and in the natural world. And Dr. Fatimah Salleh will read from The Book of Mormon for the Least of These—her bestselling book, co-authored with Margaret Olsen Hemming. It explores the social justice undercurrents in the Book of Mormon and casts it, in a verse-by-verse close reading, as a book that speaks directly to issues of racism, sexism, immigration, refugees, and socioeconomic inequality. Michael Austin, publication director at BCC Press, will give a brief introduction to the philosophy and mission of the press.",
    "URL": "https://sunstonemagazine.com/audio/SL20372.mp3"
  },
  {
    "Audio": "SL20374",
    "Title": "Mormonism, Purpose, and Afterlife as Seen through a Purple Rain",
    "Presenters": "Clifton Jolley",
    "Description": "Much of what we believe depends on what we hope or fear. We judge others and our church through the lens of who and where we are in a particular moment. Wonder becomes less a fascination than a question, while our questions of belief and believing are not inclined to be answered.  Increasingly we see only through a glass, and darkly. Which is why for those such as us—old and foolishdoubts of the present become less troublesome— than regrets of the past, and we recognize in the uncertainty of the future—something akin to faith.",
    "URL": "https://sunstonemagazine.com/audio/SL20374.mp3"
  },
  {
    "Audio": "SL20375",
    "Title": "Mormonism and White Supremacy: American Religion and the Problem of Racial Innocence",
    "Presenters": "Joanna Brooks, Mehrsa Baradaran",
    "Description": "Mormonism and White Supremacy: American Religion and the Problem of Racial Innocence",
    "URL": "https://sunstonemagazine.com/audio/SL20375.mp3"
  },
  {
    "Audio": "SL20376",
    "Title": "Freemasonry's Impact on Mormon Mourning in Nauvoo",
    "Presenters": "Cheryl L. Bruno, Nicholas S. Literski",
    "Description": "In Mormon Nauvoo, there was barely a person who did not feel the pangs of a loved one’s death. At the passing of one of his dear friends, King Follett, Joseph Smith sought to comfort those who had experienced loss. Secreted within the words of his sermon were Masonic themes which many in the audience had “ears to hear.” Joseph’s own death, greatly mourned by his followers, would contain Masonic elements. Cheryl and Nick will present the mythology of grief contained within Freemasonry’s legends and rituals. They will demonstrate how these features were present in the teachings, death, and burials of Mormonism’s founder.",
    "URL": "https://sunstonemagazine.com/audio/SL20376.mp3"
  }
]
